# Addressing Data Spilling

The sales.xlsx contains historical sales data about different customer purchases in stores.
Your current team is only interested in the following product types:
Climbing Accessories, Cooking Gear, First Aid, Golf Accessories, Insect Repellents, and Sleeping Bags.
You need to read the files into pandas DataFrames and prepare the output so that it can be added into your analytics pipeline.

In [2]:
import pandas as pd
import copy

In [3]:
sales_data = pd.read_excel("sales.xlsx")
sales_data.head()

,Year,Product,line,Product.1,type,Product.2,Order,method,type.1,Retailer,...,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1
0,2004,Camping,Equipment,Cooking,Gear,TrailChef,Water,Bag,Telephone,United,...,6.59,156672.570,5.195714,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2004,Camping,Equipment,Cooking,Gear,TrailChef,Water,Bag,Telephone,Canada,...,7145.88,6.190,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2004,Camping,Equipment,Cooking,Gear,TrailChef,Water,Bag,Telephone,Mexico,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2004,Camping,Equipment,Cooking,Gear,TrailChef,Water,Bag,Telephone,Brazil,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2004,Camping,Equipment,Cooking,Gear,TrailChef,Water,Bag,Telephone,Japan,...,91707.18,5.488,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
sales_data.shape

(65535, 26)

In [5]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 65535 entries, 0 to 65534
Data columns (total 26 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Year       65535 non-null  int64
 1   Product    65535 non-null  object
 2   line       65535 non-null  object
 3   Product.1  65535 non-null  object
 4   type       65535 non-null  object
 5   Product.2  65535 non-null  object
 6   Order      65535 non-null  object
 7   method     61083 non-null  object
 8   type.1     46709 non-null  object
 9   Retailer   32525 non-null  object
 10  country    24135 non-null  object
 11  Revenue    21494 non-null  object
 12  Planned    20925 non-null  object
 13  revenue    20645 non-null  object
 14  Product.3  20588 non-null  object
 15  cost       19224 non-null  float64
 16  Quantity   13663 non-null  float64
 17  Unit       7046 non-null   float64
 18  cost.1     2403 non-null   float64
 19  Unit.1     650 non-null    float64
 20  price      233 non-null    float64
 21  Gross      46 non-null     float64
 22  profit     4 non-null      float64
 23  Unit.2     0 non-null      float64
 24  sale       0 non-null      float64
 25  price.1    0 non-null      float64
dtypes: float64(11), int64(1), object(14)
memory usage: 13.0+ MB

To look at the data types of the columns

In [6]:
sales_data.dtypes

Year           int64
Product       object
line          object
Product.1     object
type          object
Product.2     object
Order         object
method        object
type.1        object
Retailer      object
country       object
Revenue       object
Planned       object
revenue       object
Product.3     object
cost         float64
Quantity     float64
Unit         float64
cost.1       float64
Unit.1       float64
price        float64
Gross        float64
profit       float64
Unit.2       float64
sale         float64
price.1      float64
dtype: object

In [7]:
for label, content in sales_data.iteritems():
    print(label, content[1])

Year 2004
Product Camping
line Equipment
Product.1 Cooking
type Gear
Product.2 TrailChef
Order Water
method Bag
type.1 Telephone
Retailer Canada
country 13444.68
Revenue 14313.48
Planned 6298.8
revenue 2172
Product.3 2.9
cost 6.59
Quantity 7145.88
Unit 6.19
cost.1 nan
Unit.1 nan
price nan
Gross nan
profit nan
Unit.2 nan
sale nan
price.1 nan

In [8]:
# There seems to be some column spillage in our data. The data should appear as shown below:
d = pd.DataFrame.from_dict(
    {
    "Year": [2004],
    "Product line": ["Camping Equipment"],
    "Product type": ["Cooking Gear"],
    "Product": ["TrailChef Water Bag"],
    "Order method type": ["Telephone"],
    "Retailer Country": ["Canada"],
    "Revenue": [13444.68],
    "Planned revenue": [14313.48],
    "Product cost": [6298.8],
    "Quantity": [2172],
    "Unit cost": [2.9],
    "Unit price": [6.59],
    "Gross Profit": [7145.88],
    "Unit sale price": [6.19]
})

This is how data should look like:

In [9]:
d

,Year,Product line,Product type,Product,Order method type,Retailer Country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross Profit,Unit sale price
0,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone,Canada,13444.68,14313.48,6298.8,2172,2.9,6.59,7145.88,6.19

Let's fix the spillage on the product line column which currently is as product and line separate columns

In [10]:
sales_data.groupby(["Product", "line"])["Year"].count()

Product         line
Camping         Equipment      20112
Golf            Equipment       6615
Mountaineering  Equipment       9261
Outdoor         Protection      6615
Personal        Accessories    22932
Name: Year, dtype: int64

In [11]:
sales_data["Product line"] = sales_data.apply(lambda x: x["Product"] + " " + x["line"], axis=1)

In [12]:
sales_data = sales_data.drop(["Product", "line"], axis=1)
sales_data.head()

,Year,Product.1,type,Product.2,Order,method,type.1,Retailer,country,Revenue,...,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line
0,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,United,States,315044,...,156672.570,5.195714,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
1,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,Canada,13444.7,14313.5,...,6.190,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
2,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,Mexico,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
3,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,Brazil,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
4,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,Japan,181120,235237,...,5.488,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment

Now let's make a copy of our data

In [20]:
tmp = copy.deepcopy(sales_data)
tmp.head()

,Year,Product.1,type,Product.2,Order,method,type.1,Retailer,country,Revenue,...,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line
0,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,United,States,315044,...,156672.570,5.195714,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
1,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,Canada,13444.7,14313.5,...,6.190,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
2,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,Mexico,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
3,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,Brazil,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
4,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,Japan,181120,235237,...,5.488,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment

We proceed at looking at the next column, Product.1 and type

In [21]:
tmp.groupby(["Product.1", "type"])["Year"].count()

Product.1   type
Binoculars  Opera           441
            Ranger          441
            Seeker         1764
Climbing    Accessories    3087
Cooking     Gear           5880
Eyewear     Bella           441
            Capri           441
            Cat             441
            Dante           441
            Fairway         441
            Hawk            441
            Inferno         441
            Maximus         441
            Polar          2205
            Retro           441
            Trendi          441
            Zone            441
First       Aid            2205
Golf        Accessories    1764
Insect      Repellents     2205
Irons       Hailstorm       882
            Lady            882
Knives      Bear            882
            Double          441
            Edge            441
            Max             441
            Pocket          441
            Single          441
Lanterns    EverGlow       2205
            Firefly        2646
            Flicker         441
Navigation  Astro           441
            Auto            441
            Glacier        1764
            Sky             441
            Trail          1323
Packs       Canyon         2646
Putters     Blue            882
            Course          441
Rope        Husky          1764
Safety      Granite         882
            Husky           882
Sleeping    Bags           3087
Sunscreen   Sun            2205
Tents       Star           3207
Tools       Granite        2646
Watches     Infinity        441
            Kodiak          441
            Legend          441
            Lux             441
            Mountain       2205
            Sam             441
            TX              441
            Venue           441
            Zodiak          441
Woods       Hailstorm       882
            Lady            882
Name: Year, dtype: int64

In [22]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(tmp.groupby(["Product.1", "type", "Product.2"])["Year"].count())

Product.1   type         Product.2
Binoculars  Opera        Vision          441
            Ranger       Vision          441
            Seeker       35              441
                         50              441
                         Extreme         441
                         Mini            441
Climbing    Accessories  Firefly        1323
                         Granite        1764
Cooking     Gear         TrailChef      5880
Eyewear     Bella        E-mail           63
                         Fax              63
                         Mail             63
                         Sales            63
                         Special          63
                         Telephone        63
                         Web              63
            Capri        E-mail           63
                         Fax              63
                         Mail             63
                         Sales            63
                         Special          63
                         Telephone        63
                         Web              63
            Cat          Eye             441
            Dante        E-mail           63
                         Fax              63
                         Mail             63
                         Sales            63
                         Special          63
                         Telephone        63
                         Web              63
            Fairway      E-mail           63
                         Fax              63
                         Mail             63
                         Sales            63
                         Special          63
                         Telephone        63
                         Web              63
            Hawk         Eye             441
            Inferno      E-mail           63
                         Fax              63
                         Mail             63
                         Sales            63
                         Special          63
                         Telephone        63
                         Web              63
            Maximus      E-mail           63
                         Fax              63
                         Mail             63
                         Sales            63
                         Special          63
                         Telephone        63
                         Web              63
            Polar        Extreme         441
                         Ice             441
                         Sports          441
                         Sun             441
                         Wave            441
            Retro        E-mail           63
                         Fax              63
                         Mail             63
                         Sales            63
                         Special          63
                         Telephone        63
                         Web              63
            Trendi       E-mail           63
                         Fax              63
                         Mail             63
                         Sales            63
                         Special          63
                         Telephone        63
                         Web              63
            Zone         E-mail           63
                         Fax              63
                         Mail             63
                         Sales            63
                         Special          63
                         Telephone        63
                         Web              63
First       Aid          Aloe            441
                         Calamine        441
                         Compact         441
                         Deluxe          441
                         Insect          441
Golf        Accessories  Course         1764
Insect      Repellents   BugShield      2205
Irons       Hailstorm    Steel           441
                         Titanium        441
            Lady         Hailstorm       882
Knives      Bear         Edge            441
                         Survival        441
            Double       Edge            441
            Edge         Extreme         441
            Max          Gizmo           441
            Pocket       Gizmo           441
            Single       Edge            441
Lanterns    EverGlow     Butane          441
                         Double          441
                         Kerosene        441
                         Lamp            441
                         Single          441
            Firefly      2               441
                         4               441
                         Extreme         441
                         Lite            441
                         Mapreader       441
                         Multi-light     441
            Flicker      Lantern         441
Navigation  Astro        Pilot           441
            Auto         Pilot           441
            Glacier      Basic           441
                         Deluxe          441
                         GPS             882
            Sky          Pilot           441
            Trail        Master          441
                         Scout           441
                         Star            441
Packs       Canyon       Mule           2646
Putters     Blue         Steel           882
            Course       Pro             441
Rope        Husky        Rope           1764
Safety      Granite      Climbing        441
                         Signal          441
            Husky        Harness         882
Sleeping    Bags         Hibernator     3087
Sunscreen   Sun          Blocker         441
                         Shelter        1323
                         Shield          441
Tents       Star         Dome            588
                         Gazer          1590
                         Lite            588
                         Peg             441
Tools       Granite      Axe             441
                         Extreme         441
                         Grip            441
                         Hammer          441
                         Ice             441
                         Shovel          441
Watches     Infinity     E-mail           63
                         Fax              63
                         Mail             63
                         Sales            63
                         Special          63
                         Telephone        63
                         Web              63
            Kodiak       E-mail           63
                         Fax              63
                         Mail             63
                         Sales            63
                         Special          63
                         Telephone        63
                         Web              63
            Legend       E-mail           63
                         Fax              63
                         Mail             63
                         Sales            63
                         Special          63
                         Telephone        63
                         Web              63
            Lux          E-mail           63
                         Fax              63
                         Mail             63
                         Sales            63
                         Special          63
                         Telephone        63
                         Web              63
            Mountain     Man            2205
            Sam          E-mail           63
                         Fax              63
                         Mail             63
                         Sales            63
                         Special          63
                         Telephone        63
                         Web              63
            TX           E-mail           63
                         Fax              63
                         Mail             63
                         Sales            63
                         Special          63
                         Telephone        63
                         Web              63
            Venue        E-mail           63
                         Fax              63
                         Mail             63
                         Sales            63
                         Special          63
                         Telephone        63
                         Web              63
            Zodiak       E-mail           63
                         Fax              63
                         Mail             63
                         Sales            63
                         Special          63
                         Telephone        63
                         Web              63
Woods       Hailstorm    Steel           441
                         Titanium        441
            Lady         Hailstorm       882
Name: Year, dtype: int64

We can see that the Product type column hasn't spilled any further, therefore we only need to combine the Product.1 and type columns. But before that let's filter our data to only include the product types we are interested in. These are Climbing Accessories, Cooking Gear, First Aid, Golf Accessories, Insect Repellents, and Sleeping Bags.

In [30]:
tmp1 = copy.deepcopy(tmp[tmp["Product.1"].isin(["Climbing", "Cooking", "First", "Golf", "Insect", "Sleeping"])])
tmp1.head()

,Year,Product.1,type,Product.2,Order,method,type.1,Retailer,country,Revenue,...,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line
0,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,United,States,315044,...,156672.570,5.195714,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
1,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,Canada,13444.7,14313.5,...,6.190,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
2,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,Mexico,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
3,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,Brazil,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
4,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,Japan,181120,235237,...,5.488,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment

In [31]:
tmp1.groupby(["Product.1"])["Year"].count()

Product.1
Climbing    3087
Cooking     5880
First       2205
Golf        1764
Insect      2205
Sleeping    3087
Name: Year, dtype: int64

We can see that tmp1 only contains the product that we are interested in

In [32]:
tmp1.groupby(["Product.1", "type"])["Year"].count()

Product.1  type
Climbing   Accessories    3087
Cooking    Gear           5880
First      Aid            2205
Golf       Accessories    1764
Insect     Repellents     2205
Sleeping   Bags           3087
Name: Year, dtype: int64

Now we can combine the two columns and obtain the Product type column

In [33]:
tmp1["Product type"] = tmp1["Product.1"] + " " + tmp1["type"]
tmp1 = tmp1.drop(["Product.1", "type"], axis=1)
tmp1.head()

,Year,Product.2,Order,method,type.1,Retailer,country,Revenue,Planned,revenue,...,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type
0,2004,TrailChef,Water,Bag,Telephone,United,States,315044,437477,158372,...,5.195714,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
1,2004,TrailChef,Water,Bag,Telephone,Canada,13444.7,14313.5,6298.8,2172,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
2,2004,TrailChef,Water,Bag,Telephone,Mexico,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
3,2004,TrailChef,Water,Bag,Telephone,Brazil,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
4,2004,TrailChef,Water,Bag,Telephone,Japan,181120,235237,89413.1,35696,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear

We proceed to the next column which is Product which is a little bit completed because there are single and multiple words, spilling into the other columns. We are going to do this procedurally, starting with the ones that have spilled the most.

In [34]:
tmp1.groupby(["Product.2"])["Year"].count()

Product.2
Aloe           441
BugShield     2205
Calamine       441
Compact        441
Course        1764
Deluxe         441
Firefly       1323
Granite       1764
Hibernator    3087
Insect         441
TrailChef     5880
Name: Year, dtype: int64

In [35]:
tmp1.groupby(["Product.2", "Order"])["Year"].count()

Product.2   Order
Aloe        Relief           441
BugShield   Extreme          441
            Lotion           882
            Natural          441
            Spray            441
Calamine    Relief           441
Compact     Relief           441
Course      Pro             1764
Deluxe      Family           441
Firefly     Charger          441
            Climbing         441
            Rechargeable     441
Granite     Belay            441
            Carabiner        441
            Chalk            441
            Pulley           441
Hibernator  Camp             441
            E-mail            63
            Extreme          441
            Fax               63
            Lite             441
            Mail              63
            Pad              441
            Pillow           441
            Sales             63
            Self             441
            Special           63
            Telephone         63
            Web               63
Insect      Bite             441
TrailChef   Canteen          588
            Cook             588
            Cup              588
            Deluxe           588
            Double           588
            Kettle           588
            Kitchen          588
            Single           588
            Utensils         588
            Water            588
Name: Year, dtype: int64

We can see that there are some products with only one word while others have more than one word.
The ones with one word can be noticed by the following words in the Order column: E-mail, Fax, Mail, Sales, Special, Telephone, Web.
As earlier stated we will start with the longer words that have spilled the farthest to other columns.

In [36]:
tmp2 = copy.deepcopy(tmp1[~tmp1["Order"].isin(["E-mail", "Fax", "Mail", "Sales", "Special", "Telephone", "Web"])])
tmp2.head()

,Year,Product.2,Order,method,type.1,Retailer,country,Revenue,Planned,revenue,...,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type
0,2004,TrailChef,Water,Bag,Telephone,United,States,315044,437477,158372,...,5.195714,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
1,2004,TrailChef,Water,Bag,Telephone,Canada,13444.7,14313.5,6298.8,2172,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
2,2004,TrailChef,Water,Bag,Telephone,Mexico,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
3,2004,TrailChef,Water,Bag,Telephone,Brazil,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
4,2004,TrailChef,Water,Bag,Telephone,Japan,181120,235237,89413.1,35696,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear

In [37]:
tmp2.groupby(["Product.2", "Order"])["Year"].count()

Product.2   Order
Aloe        Relief           441
BugShield   Extreme          441
            Lotion           882
            Natural          441
            Spray            441
Calamine    Relief           441
Compact     Relief           441
Course      Pro             1764
Deluxe      Family           441
Firefly     Charger          441
            Climbing         441
            Rechargeable     441
Granite     Belay            441
            Carabiner        441
            Chalk            441
            Pulley           441
Hibernator  Camp             441
            Extreme          441
            Lite             441
            Pad              441
            Pillow           441
            Self             441
Insect      Bite             441
TrailChef   Canteen          588
            Cook             588
            Cup              588
            Deluxe           588
            Double           588
            Kettle           588
            Kitchen          588
            Single           588
            Utensils         588
            Water            588
Name: Year, dtype: int64

Let's check if there are products with more than two words which could have spilled to the method column

In [39]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(tmp2.groupby(["Product.2", "Order", "method"])["Year"].count())

Product.2   Order         method
Aloe        Relief        E-mail        63
                          Fax           63
                          Mail          63
                          Sales         63
                          Special       63
                          Telephone     63
                          Web           63
BugShield   Extreme       E-mail        63
                          Fax           63
                          Mail          63
                          Sales         63
                          Special       63
                          Telephone     63
                          Web           63
            Lotion        E-mail        63
                          Fax           63
                          Lite         441
                          Mail          63
                          Sales         63
                          Special       63
                          Telephone     63
                          Web           63
            Natural       E-mail        63
                          Fax           63
                          Mail          63
                          Sales         63
                          Special       63
                          Telephone     63
                          Web           63
            Spray         E-mail        63
                          Fax           63
                          Mail          63
                          Sales         63
                          Special       63
                          Telephone     63
                          Web           63
Calamine    Relief        E-mail        63
                          Fax           63
                          Mail          63
                          Sales         63
                          Special       63
                          Telephone     63
                          Web           63
Compact     Relief        Kit          441
Course      Pro           Gloves       441
                          Golf         882
                          Umbrella     441
Deluxe      Family        Relief       441
Firefly     Charger       E-mail        63
                          Fax           63
                          Mail          63
                          Sales         63
                          Special       63
                          Telephone     63
                          Web           63
            Climbing      Lamp         441
            Rechargeable  Battery      441
Granite     Belay         E-mail        63
                          Fax           63
                          Mail          63
                          Sales         63
                          Special       63
                          Telephone     63
                          Web           63
            Carabiner     E-mail        63
                          Fax           63
                          Mail          63
                          Sales         63
                          Special       63
                          Telephone     63
                          Web           63
            Chalk         Bag          441
            Pulley        E-mail        63
                          Fax           63
                          Mail          63
                          Sales         63
                          Special       63
                          Telephone     63
                          Web           63
Hibernator  Camp          Cot          441
            Extreme       E-mail        63
                          Fax           63
                          Mail          63
                          Sales         63
                          Special       63
                          Telephone     63
                          Web           63
            Lite          E-mail        63
                          Fax           63
                          Mail          63
                          Sales         63
                          Special       63
                          Telephone     63
                          Web           63
            Pad           E-mail        63
                          Fax           63
                          Mail          63
                          Sales         63
                          Special       63
                          Telephone     63
                          Web           63
            Pillow        E-mail        63
                          Fax           63
                          Mail          63
                          Sales         63
                          Special       63
                          Telephone     63
                          Web           63
            Self          0            441
Insect      Bite          Relief       441
TrailChef   Canteen       E-mail        84
                          Fax           84
                          Mail          84
                          Sales         84
                          Special       84
                          Telephone     84
                          Web           84
            Cook          Set          588
            Cup           E-mail        84
                          Fax           84
                          Mail          84
                          Sales         84
                          Special       84
                          Telephone     84
                          Web           84
            Deluxe        Cook         588
            Double        Flame        588
            Kettle        E-mail        84
                          Fax           84
                          Mail          84
                          Sales         84
                          Special       84
                          Telephone     84
                          Web           84
            Kitchen       Kit          588
            Single        Flame        588
            Utensils      E-mail        84
                          Fax           84
                          Mail          84
                          Sales         84
                          Special       84
                          Telephone     84
                          Web           84
            Water         Bag          588
Name: Year, dtype: int64

We can see that there are three letter words whose words have spilled to the method column, indicated by words such as bag, kit, flame in the method column. Let's further obtain a subset of these products with three words

In [297]:
tmp3 = copy.deepcopy(tmp2[~tmp2["method"].isin(["E-mail", "Fax", "Mail", "Sales", "Special", "Telephone", "Web"])])
tmp3.head()

,Year,Product.2,Order,method,type.1,Retailer,country,Revenue,Planned,revenue,...,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type
0,2004,TrailChef,Water,Bag,Telephone,United,States,315044,437477,158372,...,5.195714,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
1,2004,TrailChef,Water,Bag,Telephone,Canada,13444.7,14313.5,6298.8,2172,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
2,2004,TrailChef,Water,Bag,Telephone,Mexico,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
3,2004,TrailChef,Water,Bag,Telephone,Brazil,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
4,2004,TrailChef,Water,Bag,Telephone,Japan,181120,235237,89413.1,35696,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear

In [42]:
tmp3.groupby(["Product.2", "Order", "method"])["Year"].count()

Product.2   Order         method
BugShield   Lotion        Lite        441
Compact     Relief        Kit         441
Course      Pro           Gloves      441
                          Golf        882
                          Umbrella    441
Deluxe      Family        Relief      441
Firefly     Climbing      Lamp        441
            Rechargeable  Battery     441
Granite     Chalk         Bag         441
Hibernator  Camp          Cot         441
            Self          0           441
Insect      Bite          Relief      441
TrailChef   Cook          Set         588
            Deluxe        Cook        588
            Double        Flame       588
            Kitchen       Kit         588
            Single        Flame       588
            Water         Bag         588
Name: Year, dtype: int64

So far so good, but let's check if there are products with more than three words that could have spilled to the type.1 column

In [44]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(tmp3.groupby(["Product.2", "Order", "method", "type.1"])["Year"].count())

Product.2   Order         method    type.1
BugShield   Lotion        Lite      E-mail        63
                                    Fax           63
                                    Mail          63
                                    Sales         63
                                    Special       63
                                    Telephone     63
                                    Web           63
Compact     Relief        Kit       E-mail        63
                                    Fax           63
                                    Mail          63
                                    Sales         63
                                    Special       63
                                    Telephone     63
                                    Web           63
Course      Pro           Gloves    E-mail        63
                                    Fax           63
                                    Mail          63
                                    Sales         63
                                    Special       63
                                    Telephone     63
                                    Web           63
                          Golf      Bag          441
                                    and          441
                          Umbrella  E-mail        63
                                    Fax           63
                                    Mail          63
                                    Sales         63
                                    Special       63
                                    Telephone     63
                                    Web           63
Deluxe      Family        Relief    Kit          441
Firefly     Climbing      Lamp      E-mail        63
                                    Fax           63
                                    Mail          63
                                    Sales         63
                                    Special       63
                                    Telephone     63
                                    Web           63
            Rechargeable  Battery   E-mail        63
                                    Fax           63
                                    Mail          63
                                    Sales         63
                                    Special       63
                                    Telephone     63
                                    Web           63
Granite     Chalk         Bag       E-mail        63
                                    Fax           63
                                    Mail          63
                                    Sales         63
                                    Special       63
                                    Telephone     63
                                    Web           63
Hibernator  Camp          Cot       E-mail        63
                                    Fax           63
                                    Mail          63
                                    Sales         63
                                    Special       63
                                    Telephone     63
                                    Web           63
            Self          0         Inflating    441
Insect      Bite          Relief    E-mail        63
                                    Fax           63
                                    Mail          63
                                    Sales         63
                                    Special       63
                                    Telephone     63
                                    Web           63
TrailChef   Cook          Set       E-mail        84
                                    Fax           84
                                    Mail          84
                                    Sales         84
                                    Special       84
                                    Telephone     84
                                    Web           84
            Deluxe        Cook      Set          588
            Double        Flame     E-mail        84
                                    Fax           84
                                    Mail          84
                                    Sales         84
                                    Special       84
                                    Telephone     84
                                    Web           84
            Kitchen       Kit       E-mail        84
                                    Fax           84
                                    Mail          84
                                    Sales         84
                                    Special       84
                                    Telephone     84
                                    Web           84
            Single        Flame     E-mail        84
                                    Fax           84
                                    Mail          84
                                    Sales         84
                                    Special       84
                                    Telephone     84
                                    Web           84
            Water         Bag       E-mail        84
                                    Fax           84
                                    Mail          84
                                    Sales         84
                                    Special       84
                                    Telephone     84
                                    Web           84
Name: Year, dtype: int64

Unfortunately there still are as indicated by words such as set, kit and bag in the type.1 column. Let's get a subset with the products with four words

In [298]:
tmp4 = copy.deepcopy(tmp3[~tmp3["type.1"].isin(["E-mail", "Fax", "Mail", "Sales", "Special", "Telephone", "Web"])])
tmp4.head()

,Year,Product.2,Order,method,type.1,Retailer,country,Revenue,Planned,revenue,...,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type
735,2004,TrailChef,Deluxe,Cook,Set,Telephone,United,States,865351,930482,...,254856.69,120.64,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
736,2004,TrailChef,Deluxe,Cook,Set,Telephone,Canada,67799.7,72902.6,47831.8,...,120.64,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
737,2004,TrailChef,Deluxe,Cook,Set,Telephone,Mexico,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
738,2004,TrailChef,Deluxe,Cook,Set,Telephone,Brazil,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
739,2004,TrailChef,Deluxe,Cook,Set,Telephone,Japan,419827,451426,296183,...,120.64,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear

In [46]:
tmp4.groupby(["Product.2", "Order", "method", "type.1"])["Year"].count()

Product.2   Order   method  type.1
Course      Pro     Golf    Bag          441
                            and          441
Deluxe      Family  Relief  Kit          441
Hibernator  Self    0       Inflating    441
TrailChef   Deluxe  Cook    Set          588
Name: Year, dtype: int64

Seems like there products with 5 words let's check, that might have spilled to the Retailer column

In [47]:
tmp4.groupby(["Product.2", "Order", "method", "type.1", "Retailer"])["Year"].count()

Product.2   Order   method  type.1     Retailer
Course      Pro     Golf    Bag        E-mail        63
                                       Fax           63
                                       Mail          63
                                       Sales         63
                                       Special       63
                                       Telephone     63
                                       Web           63
                            and        Tee          441
Deluxe      Family  Relief  Kit        E-mail        63
                                       Fax           63
                                       Mail          63
                                       Sales         63
                                       Special       63
                                       Telephone     63
                                       Web           63
Hibernator  Self    0       Inflating  Mat          441
TrailChef   Deluxe  Cook    Set        E-mail        84
                                       Fax           84
                                       Mail          84
                                       Sales         84
                                       Special       84
                                       Telephone     84
                                       Web           84
Name: Year, dtype: int64

Yes, there are. We can see that by seeing values such as Tee and Mat in the Retailer column. Let's get a subset of these products

In [48]:
tmp5 = copy.deepcopy(tmp4[~tmp4["Retailer"].isin(["E-mail", "Fax", "Mail", "Sales", "Special", "Telephone", "Web"])])
tmp5.head()

,Year,Product.2,Order,method,type.1,Retailer,country,Revenue,Planned,revenue,...,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type
2793,2004,Hibernator,Self,0,Inflating,Mat,Telephone,United,States,901517,...,127.27,325573.610000,110.1644,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags
2794,2004,Hibernator,Self,0,Inflating,Mat,Telephone,Canada,57049.5,61344.1,...,23791.52,118.360000,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags
2795,2004,Hibernator,Self,0,Inflating,Mat,Telephone,Mexico,28879.8,31053.9,...,12043.84,118.360000,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags
2796,2004,Hibernator,Self,0,Inflating,Mat,Telephone,Brazil,19647.8,21126.8,...,8193.76,118.360000,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags
2797,2004,Hibernator,Self,0,Inflating,Mat,Telephone,Japan,423905,470263,...,168950.27,115.920833,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags

In [49]:
tmp5.groupby(["Product.2", "Order", "method", "type.1", "Retailer"])["Year"].count()

Product.2   Order  method  type.1     Retailer
Course      Pro    Golf    and        Tee         441
Hibernator  Self   0       Inflating  Mat         441
Name: Year, dtype: int64

To check for products with 6 words that could have spilled to country column

In [53]:
tmp5.groupby(["Product.2", "Order", "method", "type.1", "Retailer", "country"])["Year"].count()

Product.2   Order  method  type.1     Retailer  country
Course      Pro    Golf    and        Tee       Set          441
Hibernator  Self   0       Inflating  Mat       E-mail        63
                                                Fax           63
                                                Mail          63
                                                Sales         63
                                                Special       63
                                                Telephone     63
                                                Web           63
Name: Year, dtype: int64

We have a product with 6 words(indicated by Set in the column country) therefore we need to get a subset of this too. Huh, quite repititive. But we will endure, hopefully this is the last.

In [54]:
tmp6 = copy.deepcopy(tmp5[~tmp5["country"].isin(["E-mail", "Fax", "Mail", "Sales", "Special", "Telephone", "Web"])])
tmp6.head()

,Year,Product.2,Order,method,type.1,Retailer,country,Revenue,Planned,revenue,...,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type
17493,2004,Course,Pro,Golf,and,Tee,Set,Telephone,United,States,...,2.80,10.64,114309.370000,7.891613,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories
17494,2004,Course,Pro,Golf,and,Tee,Set,Telephone,Canada,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories
17495,2004,Course,Pro,Golf,and,Tee,Set,Telephone,Mexico,32224.2,...,10.64,23012.18,7.308571,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories
17496,2004,Course,Pro,Golf,and,Tee,Set,Telephone,Brazil,10268.4,...,10.64,7107.20,4.128000,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories
17497,2004,Course,Pro,Golf,and,Tee,Set,Telephone,Japan,32314.7,...,10.64,23032.65,7.292857,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories

In [55]:
tmp6.groupby(["Product.2", "Order", "method", "type.1", "Retailer", "country", "Revenue"])["Year"].count()

Product.2  Order  method  type.1  Retailer  country  Revenue
Course     Pro    Golf    and     Tee       Set      E-mail       63
                                                     Fax          63
                                                     Mail         63
                                                     Sales        63
                                                     Special      63
                                                     Telephone    63
                                                     Web          63
Name: Year, dtype: int64

Seems that was our last. A product that had 6 words. Taking a look at our data we can see that we can now fix the Product column

In [56]:
tmp6

,Year,Product.2,Order,method,type.1,Retailer,country,Revenue,Planned,revenue,...,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type
17493,2004,Course,Pro,Golf,and,Tee,Set,Telephone,United,States,...,2.80,10.64,114309.370000,7.891613,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories
17494,2004,Course,Pro,Golf,and,Tee,Set,Telephone,Canada,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories
17495,2004,Course,Pro,Golf,and,Tee,Set,Telephone,Mexico,32224.2,...,10.64,23012.18,7.308571,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories
17496,2004,Course,Pro,Golf,and,Tee,Set,Telephone,Brazil,10268.4,...,10.64,7107.20,4.128000,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories
17497,2004,Course,Pro,Golf,and,Tee,Set,Telephone,Japan,32314.7,...,10.64,23032.65,7.292857,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
59971,2006,Course,Pro,Golf,and,Tee,Set,Fax,Belgium,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories
59972,2006,Course,Pro,Golf,and,Tee,Set,Fax,Switzerland,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories
59973,2006,Course,Pro,Golf,and,Tee,Set,Fax,Austria,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories
59974,2006,Course,Pro,Golf,and,Tee,Set,Fax,Italy,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories
59975,2006,Course,Pro,Golf,and,Tee,Set,Fax,Spain,10304.8,...,10.64,7538.44,10.430000,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories

In [59]:
tmp6["Product"] = tmp6["Product.2"] + " " + tmp6["Order"] + " " + tmp6["method"] + " " + tmp6["type.1"] + " " +                     tmp6["Retailer"] + " " + tmp6["country"]
tmp6 = tmp6.drop(["Product.2", "Order", "method", "type.1", "Retailer", "country"], axis=1)
tmp6.head()

,Year,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
17493,2004,Telephone,United,States,159493,171697.68,45183.6,16137.0,2.80,10.64,114309.370000,7.891613,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
17494,2004,Telephone,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
17495,2004,Telephone,Mexico,32224.2,35005.6,9212.00,3290.0,2.8,10.64,23012.18,7.308571,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
17496,2004,Telephone,Brazil,10268.4,12012.6,3161.20,1129.0,2.8,10.64,7107.20,4.128000,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
17497,2004,Telephone,Japan,32314.7,35271.6,9282.00,3315.0,2.8,10.64,23032.65,7.292857,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set

Let's try and fix the other columns for this product with six words

In [60]:
tmp6.groupby(["Revenue"])["Year"].count()

Revenue
E-mail       63
Fax          63
Mail         63
Sales        63
Special      63
Telephone    63
Web          63
Name: Year, dtype: int64

The Revenue column is supposedly the order method type column, but let's check if there is any order method that has more than two words

In [62]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(tmp6.groupby(["Revenue", "Planned"])["Year"].count())

Revenue    Planned
E-mail     Australia       3
           Austria         3
           Belgium         3
           Brazil          3
           Canada          3
           China           3
           Denmark         3
           Finland         3
           France          3
           Germany         3
           Italy           3
           Japan           3
           Korea           3
           Mexico          3
           Netherlands     3
           Singapore       3
           Spain           3
           Sweden          3
           Switzerland     3
           United          6
Fax        Australia       3
           Austria         3
           Belgium         3
           Brazil          3
           Canada          3
           China           3
           Denmark         3
           Finland         3
           France          3
           Germany         3
           Italy           3
           Japan           3
           Korea           3
           Mexico          3
           Netherlands     3
           Singapore       3
           Spain           3
           Sweden          3
           Switzerland     3
           United          6
Mail       Australia       3
           Austria         3
           Belgium         3
           Brazil          3
           Canada          3
           China           3
           Denmark         3
           Finland         3
           France          3
           Germany         3
           Italy           3
           Japan           3
           Korea           3
           Mexico          3
           Netherlands     3
           Singapore       3
           Spain           3
           Sweden          3
           Switzerland     3
           United          6
Sales      visit          63
Special    Australia       3
           Austria         3
           Belgium         3
           Brazil          3
           Canada          3
           China           3
           Denmark         3
           Finland         3
           France          3
           Germany         3
           Italy           3
           Japan           3
           Korea           3
           Mexico          3
           Netherlands     3
           Singapore       3
           Spain           3
           Sweden          3
           Switzerland     3
           United          6
Telephone  Australia       3
           Austria         3
           Belgium         3
           Brazil          3
           Canada          3
           China           3
           Denmark         3
           Finland         3
           France          3
           Germany         3
           Italy           3
           Japan           3
           Korea           3
           Mexico          3
           Netherlands     3
           Singapore       3
           Spain           3
           Sweden          3
           Switzerland     3
           United          6
Web        Australia       3
           Austria         3
           Belgium         3
           Brazil          3
           Canada          3
           China           3
           Denmark         3
           Finland         3
           France          3
           Germany         3
           Italy           3
           Japan           3
           Korea           3
           Mexico          3
           Netherlands     3
           Singapore       3
           Spain           3
           Sweden          3
           Switzerland     3
           United          6
Name: Year, dtype: int64

We can see that there's a order method type called sales visit whose values have spilled to the planned. Let's get a subset of this.

In [64]:
tmp7 = copy.deepcopy(tmp6[tmp6["Planned"] == "visit"])
tmp7.head()

,Year,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
17514,2004,Sales,visit,United,States,5819.70,6586.16,1733.2,619.0,2.80,10.64,4086.500000,5.105,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
17515,2004,Sales,visit,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
17516,2004,Sales,visit,Mexico,13497.6,14598.08,3841.60,1372.0,2.8,10.64,9656.02,6.806667,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
17517,2004,Sales,visit,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
17518,2004,Sales,visit,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set

In [65]:
tmp7.groupby(["Revenue", "Planned", "revenue"])["Year"].count()

Revenue  Planned  revenue
Sales    visit    Australia      3
                  Austria        3
                  Belgium        3
                  Brazil         3
                  Canada         3
                  China          3
                  Denmark        3
                  Finland        3
                  France         3
                  Germany        3
                  Italy          3
                  Japan          3
                  Korea          3
                  Mexico         3
                  Netherlands    3
                  Singapore      3
                  Spain          3
                  Sweden         3
                  Switzerland    3
                  United         6
Name: Year, dtype: int64

Now we can fix this

In [66]:
tmp7

,Year,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
17514,2004,Sales,visit,United,States,5819.70,6586.16,1733.2,619.0,2.80,10.64,4086.500000,5.105,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
17515,2004,Sales,visit,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
17516,2004,Sales,visit,Mexico,13497.6,14598.08,3841.60,1372.0,2.8,10.64,9656.02,6.806667,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
17517,2004,Sales,visit,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
17518,2004,Sales,visit,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
59866,2006,Sales,visit,Belgium,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
59867,2006,Sales,visit,Switzerland,28451.8,30600.64,8052.80,2876.0,2.8,10.64,20398.98,5.816667,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
59868,2006,Sales,visit,Austria,0,425.60,112.00,40.0,2.8,10.64,-112.00,0.000000,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
59869,2006,Sales,visit,Italy,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
59870,2006,Sales,visit,Spain,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set

In [67]:
tmp7["Order method type"] = tmp7["Revenue"] + " " + tmp7["Planned"]
tmp7 = tmp7.drop(["Revenue", "Planned"], axis=1)
tmp7.head()

,Year,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
17514,2004,United,States,5819.70,6586.16,1733.2,619.0,2.80,10.64,4086.500000,5.105,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit
17515,2004,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit
17516,2004,Mexico,13497.6,14598.08,3841.60,1372.0,2.8,10.64,9656.02,6.806667,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit
17517,2004,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit
17518,2004,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit

Let's look at the next column, which supposedly is Retailer country

In [70]:
tmp7.groupby(["revenue", "Product.3"])["Year"].count()

revenue      Product.3
Australia    21183.33     1
             24114.16     1
Austria      0            3
China        27162.24     1
Denmark      6013.69      1
Finland      21185.75     1
France       0            1
             16307.46     1
             20542.05     1
Germany      3962.88      1
Italy        0            1
Japan        16448.11     1
Korea        8433.46      1
Mexico       13497.62     1
             23901.12     1
             30444        1
Netherlands  10970.16     1
Singapore    7422.67      1
Sweden       13058.36     1
Switzerland  12745.46     1
             28451.78     1
United       Kingdom      3
             States       3
Name: Year, dtype: int64

We can see that some countries(United Kingdom, United States) have more than two word that spilled to the next column. Let's get a subset of this data.

In [77]:
tmp8 = copy.deepcopy(tmp7[tmp7["Product.3"].isin(["Kingdom", "States"])])
tmp8.head()

,Year,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
17514,2004,United,States,5819.70,6586.16,1733.2,619.0,2.8,10.64,4086.50,5.105,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit
17529,2004,United,Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit
38682,2005,United,States,10904.28,11363.52,2990.4,1068.0,2.8,10.64,7913.88,10.210,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit
38697,2005,United,Kingdom,27987.84,28855.68,7593.6,2712.0,2.8,10.64,20394.24,10.320,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit
59850,2006,United,States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit

In [78]:
tmp8.groupby(["revenue", "Product.3", "cost"])["Year"].count()

revenue  Product.3  cost
United   Kingdom    8750.77     1
                    27987.84    1
         States     5819.70     1
                    10904.28    1
Name: Year, dtype: int64

In [79]:
tmp8["Retailer country"] = tmp8["revenue"] + " " + tmp8["Product.3"]
tmp8 = tmp8.drop(["revenue", "Product.3"], axis=1)
tmp8.head()

,Year,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type,Retailer country
17514,2004,5819.70,6586.16,1733.2,619.0,2.8,10.64,4086.50,5.105,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,United States
17529,2004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,United Kingdom
38682,2005,10904.28,11363.52,2990.4,1068.0,2.8,10.64,7913.88,10.210,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,United States
38697,2005,27987.84,28855.68,7593.6,2712.0,2.8,10.64,20394.24,10.320,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,United Kingdom
59850,2006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,United States

The rest of the columns can simply be translated and dropping the respective column not needed

In [80]:
tmp8["Revenue"] = tmp8["cost"]
tmp8 = tmp8.drop(["cost"], axis=1)

tmp8["Planned revenue"] = tmp8["Quantity"]
tmp8 = tmp8.drop(["Quantity"], axis=1)

tmp8["Product cost"] = tmp8["Unit"]
tmp8 = tmp8.drop(["Unit"], axis=1)

tmp8["Quantity"] = tmp8["cost.1"]
tmp8 = tmp8.drop(["cost.1"], axis=1)

tmp8["Unit cost"] = tmp8["Unit.1"]
tmp8 = tmp8.drop(["Unit.1"], axis=1)

tmp8["Unit price"] = tmp8["price"]
tmp8 = tmp8.drop(["price"], axis=1)

tmp8["Gross profit"] = tmp8["Gross"]
tmp8 = tmp8.drop(["Gross"], axis=1)

tmp8["Unit sale price"] = tmp8["profit"]
tmp8 = tmp8.drop(["profit", "Unit.2", "sale", "price.1" ], axis=1)

tmp8

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
17514,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,United States,5819.70,6586.16,1733.2,619.0,2.8,10.64,4086.50,5.105
17529,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,United Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
38682,2005,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,United States,10904.28,11363.52,2990.4,1068.0,2.8,10.64,7913.88,10.210
38697,2005,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,United Kingdom,27987.84,28855.68,7593.6,2712.0,2.8,10.64,20394.24,10.320
59850,2006,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
59865,2006,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,United Kingdom,8750.77,8926.96,2349.2,839.0,2.8,10.64,6401.57,10.430

Now this is structured like we want it to be so let us store it

In [81]:
str1 = tmp8

Our last stop over was countries with more than two words. With our subsets now we can walk backwards. For example try to fix columns for countries with just one word. We first start by creating a subset that has countries with just one word

In [84]:
temp = copy.deepcopy(tmp7[~tmp7.index.isin(tmp8.index.values)])
temp.head()

,Year,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
17515,2004,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit
17516,2004,Mexico,13497.6,14598.08,3841.6,1372.0,2.8,10.64,9656.02,6.806667,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit
17517,2004,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit
17518,2004,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit
17519,2004,Korea,8433.46,8788.64,2312.8,826.0,2.8,10.64,6120.66,10.210000,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit

In [85]:
temp.groupby(["revenue", "Product.3"])["Year"].count()

revenue      Product.3
Australia    21183.33     1
             24114.16     1
Austria      0.00         3
China        27162.24     1
Denmark      6013.69      1
Finland      21185.75     1
France       0.00         1
             16307.46     1
             20542.05     1
Germany      3962.88      1
Italy        0.00         1
Japan        16448.11     1
Korea        8433.46      1
Mexico       13497.62     1
             23901.12     1
             30444.00     1
Netherlands  10970.16     1
Singapore    7422.67      1
Sweden       13058.36     1
Switzerland  12745.46     1
             28451.78     1
Name: Year, dtype: int64

Looks we can just translate the rest

In [86]:
temp["Retailer country"] = temp["revenue"]
temp = temp.drop(["revenue"], axis=1)

temp["Revenue"] = temp["Product.3"]
temp = temp.drop(["Product.3"], axis=1)

temp["Planned revenue"] = temp["cost"]
temp = temp.drop(["cost"], axis=1)

temp["Product cost"] = temp["Quantity"]
temp = temp.drop(["Quantity"], axis=1)

temp["Quantity"] = temp["Unit"]
temp = temp.drop(["Unit"], axis=1)

temp["Unit cost"] = temp["cost.1"]
temp = temp.drop(["cost.1"], axis=1)

temp["Unit price"] = temp["Unit.1"]
temp = temp.drop(["Unit.1"], axis=1)

temp["Gross profit"] = temp["price"]
temp = temp.drop(["price"], axis=1)

temp["Unit sale price"] = temp["Gross"]
temp = temp.drop(["Gross", "profit", "Unit.2", "sale", "price.1"], axis=1)

temp.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
17515,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17516,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,Mexico,13497.6,14598.08,3841.6,1372.0,2.8,10.64,9656.02,6.806667
17517,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17518,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17519,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,Korea,8433.46,8788.64,2312.8,826.0,2.8,10.64,6120.66,10.210000

This will be our second structured data

In [87]:
str2 = temp

We are done with fixing the Retailer country. We look at the Order method type where our last fix at tmp6 we only looked at Order method  types with more than one word(Sales visit). So we get the subset with one word and fix it.

In [89]:
tmp6.groupby(["Revenue"])["Year"].count()

Revenue
E-mail       63
Fax          63
Mail         63
Sales        63
Special      63
Telephone    63
Web          63
Name: Year, dtype: int64

We want a subset that doesn't contain the sales value

In [212]:
temp = copy.deepcopy(tmp6[~tmp6.index.isin(tmp7.index.values)])
temp.head()

,Year,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
17493,2004,Telephone,United,States,159493,171697.68,45183.6,16137.0,2.80,10.64,114309.370000,7.891613,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
17494,2004,Telephone,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
17495,2004,Telephone,Mexico,32224.2,35005.6,9212.00,3290.0,2.8,10.64,23012.18,7.308571,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
17496,2004,Telephone,Brazil,10268.4,12012.6,3161.20,1129.0,2.8,10.64,7107.20,4.128000,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set
17497,2004,Telephone,Japan,32314.7,35271.6,9282.00,3315.0,2.8,10.64,23032.65,7.292857,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set

In [213]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp.groupby(["Revenue", "Planned"])["Year"].count())

Revenue    Planned
E-mail     Australia      3
           Austria        3
           Belgium        3
           Brazil         3
           Canada         3
           China          3
           Denmark        3
           Finland        3
           France         3
           Germany        3
           Italy          3
           Japan          3
           Korea          3
           Mexico         3
           Netherlands    3
           Singapore      3
           Spain          3
           Sweden         3
           Switzerland    3
           United         6
Fax        Australia      3
           Austria        3
           Belgium        3
           Brazil         3
           Canada         3
           China          3
           Denmark        3
           Finland        3
           France         3
           Germany        3
           Italy          3
           Japan          3
           Korea          3
           Mexico         3
           Netherlands    3
           Singapore      3
           Spain          3
           Sweden         3
           Switzerland    3
           United         6
Mail       Australia      3
           Austria        3
           Belgium        3
           Brazil         3
           Canada         3
           China          3
           Denmark        3
           Finland        3
           France         3
           Germany        3
           Italy          3
           Japan          3
           Korea          3
           Mexico         3
           Netherlands    3
           Singapore      3
           Spain          3
           Sweden         3
           Switzerland    3
           United         6
Special    Australia      3
           Austria        3
           Belgium        3
           Brazil         3
           Canada         3
           China          3
           Denmark        3
           Finland        3
           France         3
           Germany        3
           Italy          3
           Japan          3
           Korea          3
           Mexico         3
           Netherlands    3
           Singapore      3
           Spain          3
           Sweden         3
           Switzerland    3
           United         6
Telephone  Australia      3
           Austria        3
           Belgium        3
           Brazil         3
           Canada         3
           China          3
           Denmark        3
           Finland        3
           France         3
           Germany        3
           Italy          3
           Japan          3
           Korea          3
           Mexico         3
           Netherlands    3
           Singapore      3
           Spain          3
           Sweden         3
           Switzerland    3
           United         6
Web        Australia      3
           Austria        3
           Belgium        3
           Brazil         3
           Canada         3
           China          3
           Denmark        3
           Finland        3
           France         3
           Germany        3
           Italy          3
           Japan          3
           Korea          3
           Mexico         3
           Netherlands    3
           Singapore      3
           Spain          3
           Sweden         3
           Switzerland    3
           United         6
Name: Year, dtype: int64

This is easily fixed by translation

In [214]:
temp["Order method type"] = temp["Revenue"]
temp = temp.drop(["Revenue"], axis=1)
temp.head()

,Year,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
17493,2004,United,States,159493,171697.68,45183.6,16137.0,2.80,10.64,114309.370000,7.891613,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone
17494,2004,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone
17495,2004,Mexico,32224.2,35005.6,9212.00,3290.0,2.8,10.64,23012.18,7.308571,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone
17496,2004,Brazil,10268.4,12012.6,3161.20,1129.0,2.8,10.64,7107.20,4.128000,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone
17497,2004,Japan,32314.7,35271.6,9282.00,3315.0,2.8,10.64,23032.65,7.292857,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone

In [215]:
temp.groupby(["Planned", "revenue"])["Year"].count()

Planned      revenue
Australia    14351.68     1
             18398.52     1
             72206.89     1
Austria      12105.36     1
             12414.96     1
                         ..
Switzerland  11356.35     1
             25314.3      1
             33003.92     1
United       Kingdom     18
             States      18
Name: Year, Length: 118, dtype: int64

So now we need to fix Retailer country with more than two words then fix it for those Retailer coutries with just one word

In [216]:
temp1 = copy.deepcopy(temp[temp["revenue"].isin(["Kingdom", "States"])])
temp1.head()

,Year,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
17493,2004,United,States,159493,171697.68,45183.6,16137.0,2.8,10.64,114309.37,7.891613,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone
17508,2004,United,Kingdom,66286.3,72362.64,19042.8,6801.0,2.8,10.64,47243.46,6.950000,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone
17535,2004,United,States,159041,167824.72,44164.4,15773.0,2.8,10.64,114876.32,9.286818,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Web
17550,2004,United,Kingdom,59938,62318.48,16399.6,5857.0,2.8,10.64,43538.37,10.240909,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Web
17556,2004,United,States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Special

In [217]:
temp1.groupby(["Planned", "revenue"])["Year"].count()

Planned  revenue
United   Kingdom    18
         States     18
Name: Year, dtype: int64

In [218]:
temp1["Retailer country"] = temp1["Planned"] + " " + temp1["revenue"]
temp1= temp1.drop(["Planned", "revenue"], axis=1)
temp1.head()

,Year,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type,Retailer country
17493,2004,159493,171697.68,45183.6,16137.0,2.8,10.64,114309.37,7.891613,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone,United States
17508,2004,66286.3,72362.64,19042.8,6801.0,2.8,10.64,47243.46,6.950000,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone,United Kingdom
17535,2004,159041,167824.72,44164.4,15773.0,2.8,10.64,114876.32,9.286818,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Web,United States
17550,2004,59938,62318.48,16399.6,5857.0,2.8,10.64,43538.37,10.240909,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Web,United Kingdom
17556,2004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Special,United States

Fix the rest by translation

In [219]:
temp1["Revenue"] = temp1["Product.3"]
temp1 = temp1.drop(["Product.3"], axis=1)

temp1["Planned revenue"] = temp1["cost"]
temp1 = temp1.drop(["cost"], axis=1)

temp1["Product cost"] = temp1["Quantity"]
temp1 = temp1.drop(["Quantity"], axis=1)

temp1["Quantity"] = temp1["Unit"]
temp1 = temp1.drop(["Unit"], axis=1)

temp1["Unit cost"] = temp1["cost.1"]
temp1 = temp1.drop(["cost.1"], axis=1)

temp1["Unit price"] = temp1["Unit.1"]
temp1 = temp1.drop(["Unit.1"], axis=1)

temp1["Gross profit"] = temp1["price"]
temp1 = temp1.drop(["price"], axis=1)

temp1["Unit sale price"] = temp1["Gross"]
temp1 = temp1.drop(["Gross", "profit", "Unit.2", "sale", "price.1"], axis=1)

temp1.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
17493,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone,United States,159493,171697.68,45183.6,16137.0,2.8,10.64,114309.37,7.891613
17508,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone,United Kingdom,66286.3,72362.64,19042.8,6801.0,2.8,10.64,47243.46,6.950000
17535,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Web,United States,159041,167824.72,44164.4,15773.0,2.8,10.64,114876.32,9.286818
17550,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Web,United Kingdom,59938,62318.48,16399.6,5857.0,2.8,10.64,43538.37,10.240909
17556,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Special,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Well structured, let's save this.

In [220]:
str3 = temp1

We need to solve for countries that just have one word now

In [221]:
temp2 = copy.deepcopy(temp[~temp.index.isin(temp1.index.values)])
temp2.head()

,Year,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
17494,2004,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone
17495,2004,Mexico,32224.2,35005.6,9212.0,3290.0,2.8,10.64,23012.18,7.308571,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone
17496,2004,Brazil,10268.4,12012.6,3161.2,1129.0,2.8,10.64,7107.20,4.128000,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone
17497,2004,Japan,32314.7,35271.6,9282.0,3315.0,2.8,10.64,23032.65,7.292857,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone
17498,2004,Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone

In [222]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp2.groupby(["Planned", "revenue"])["Year"].count())

Planned      revenue
Australia    14351.68     1
             18398.52     1
             72206.89     1
Austria      12105.36     1
             12414.96     1
             28380.00     1
             53965.97     1
             79007.25     1
Belgium      3560.40      1
             17956.80     1
             69039.45     1
             69272.28     1
Brazil       10268.40     1
             46289.46     1
             66488.85     1
             74829.65     1
Canada       5697.18      1
             6759.60      1
             6789.65      1
             10313.96     1
             34408.13     1
             46460.46     1
             78873.89     1
             83518.71     1
             187139.46    1
China        0.00         1
             10686.27     1
             36939.78     1
             40829.79     1
             48973.85     1
             54872.68     1
             62342.26     1
             66278.36     1
             110095.19    1
Denmark      3849.17      1
             9331.94      1
             11041.20     1
             31464.47     1
Finland      61168.11     1
             103840.28    1
             130181.38    1
France       5492.98      1
             10910.30     1
             11683.00     1
             15832.62     1
             19005.93     1
             42918.96     1
             53442.26     1
             64638.62     1
             133653.04    1
Germany      4484.90      1
             5036.16      1
             14354.45     1
             15952.32     1
             39955.71     1
             90981.09     1
             96008.00     1
             118719.96    1
Italy        10252.69     1
             26431.37     1
             36174.44     1
             41099.28     1
             77140.77     1
             119951.53    1
Japan        0.00         4
             10033.66     1
             11438.82     1
             32314.65     1
             35718.90     1
             105116.13    1
             131528.91    1
             150025.53    1
Korea        8433.46      1
             10700.08     1
             20684.98     1
             41541.19     1
             43249.56     1
             95183.63     1
             118264.32    1
Mexico       28714.89     1
             32224.18     1
             60578.40     1
             110676.88    1
Netherlands  7361.41      1
             9876.24      1
             13926.44     1
             40859.62     1
             47286.24     1
             58738.13     1
             115274.61    1
Singapore    8402.83      1
             10283.98     1
             11248.80     1
             14410.41     1
             19120.00     1
             30742.31     1
             31213.50     1
             87568.95     1
             91075.11     1
Spain        5584.87      1
             9896.88      1
             10304.84     1
             14244.89     1
             20593.99     1
             20862.29     1
             21908.67     1
             75315.36     1
             114286.84    1
Sweden       5995.92      1
             35922.91     1
             42570.22     1
             52653.79     1
Switzerland  6643.91      1
             11356.35     1
             25314.30     1
             33003.92     1
Name: Year, dtype: int64

In [223]:
temp2["Retailer country"] = temp2["Planned"]
temp2 = temp2.drop(["Planned"], axis=1)

temp2["Revenue"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Planned revenue"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Product cost"] = temp2["cost"]
temp2 = temp2.drop(["cost"], axis=1)

temp2["Unit cost"] = temp2["Unit"]
temp2 = temp2.drop(["Unit"], axis=1)

temp2["Unit price"] = temp2["cost.1"]
temp2 = temp2.drop(["cost.1"], axis=1)

temp2["Gross profit"] = temp2["Unit.1"]
temp2 = temp2.drop(["Unit.1"], axis=1)

temp2["Unit sale price"] = temp2["price"]
temp2 = temp2.drop(["price", "Gross", "profit", "Unit.2", "sale", "price.1"], axis=1)

temp2.head()

,Year,Quantity,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Unit cost,Unit price,Gross profit,Unit sale price
17494,2004,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17495,2004,3290.0,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone,Mexico,32224.2,35005.6,9212.0,2.8,10.64,23012.18,7.308571
17496,2004,1129.0,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone,Brazil,10268.4,12012.6,3161.2,2.8,10.64,7107.20,4.128000
17497,2004,3315.0,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone,Japan,32314.7,35271.6,9282.0,2.8,10.64,23032.65,7.292857
17498,2004,NaN,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone,Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [224]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
17494,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17495,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone,Mexico,32224.2,35005.6,9212.0,3290.0,2.8,10.64,23012.18,7.308571
17496,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone,Brazil,10268.4,12012.6,3161.2,1129.0,2.8,10.64,7107.20,4.128000
17497,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone,Japan,32314.7,35271.6,9282.0,3315.0,2.8,10.64,23032.65,7.292857
17498,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Telephone,Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [225]:
str4 = temp2

We now proceed to the second longest product and fix it

In [226]:
temp = copy.deepcopy(tmp5[~tmp5.index.isin(tmp6.index.values)])
temp.head()

,Year,Product.2,Order,method,type.1,Retailer,country,Revenue,Planned,revenue,...,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type
2793,2004,Hibernator,Self,0,Inflating,Mat,Telephone,United,States,901517,...,127.27,325573.610000,110.1644,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags
2794,2004,Hibernator,Self,0,Inflating,Mat,Telephone,Canada,57049.5,61344.1,...,23791.52,118.360000,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags
2795,2004,Hibernator,Self,0,Inflating,Mat,Telephone,Mexico,28879.8,31053.9,...,12043.84,118.360000,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags
2796,2004,Hibernator,Self,0,Inflating,Mat,Telephone,Brazil,19647.8,21126.8,...,8193.76,118.360000,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags
2797,2004,Hibernator,Self,0,Inflating,Mat,Telephone,Japan,423905,470263,...,168950.27,115.920833,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags

In [227]:
temp.groupby(["Product.2", "Order", "method", "type.1", "Retailer", "country"])["Year"].count()

Product.2   Order  method  type.1     Retailer  country
Hibernator  Self   0       Inflating  Mat       E-mail       63
                                                Fax          63
                                                Mail         63
                                                Sales        63
                                                Special      63
                                                Telephone    63
                                                Web          63
Name: Year, dtype: int64

Let's find a way of replacing the 0 value in the method column with a hyphen so that it can read "self-inflating"

In [228]:
def check(k):
    if k==0:
        return "-"
    else:
        return k

In [229]:
temp["Product"] = temp["Product.2"] + " " + temp["Order"] + " " + temp["method"].map(check) + " " + temp["type.1"] + " " + temp["Retailer"]
temp = temp.drop(["Product.2", "Order", "method", "type.1", "Retailer"], axis=1)
temp.head()

,Year,country,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
2793,2004,Telephone,United,States,901517,1.06232e+06,575943.0,8347.0,69.00,127.27,325573.610000,110.1644,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat
2794,2004,Telephone,Canada,57049.5,61344.1,33258,482.0,69.0,127.27,23791.52,118.360000,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat
2795,2004,Telephone,Mexico,28879.8,31053.9,16836,244.0,69.0,127.27,12043.84,118.360000,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat
2796,2004,Telephone,Brazil,19647.8,21126.8,11454,166.0,69.0,127.27,8193.76,118.360000,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat
2797,2004,Telephone,Japan,423905,470263,254955,3695.0,69.0,127.27,168950.27,115.920833,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat

Remember to solve the order method type we need to solve for the two-word and one-word method types and for retailer country we need to solve for two-word and one-word countries

In [230]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp.groupby(["country", "Revenue"])["Year"].count())

country    Revenue
E-mail     Australia       3
           Austria         3
           Belgium         3
           Brazil          3
           Canada          3
           China           3
           Denmark         3
           Finland         3
           France          3
           Germany         3
           Italy           3
           Japan           3
           Korea           3
           Mexico          3
           Netherlands     3
           Singapore       3
           Spain           3
           Sweden          3
           Switzerland     3
           United          6
Fax        Australia       3
           Austria         3
           Belgium         3
           Brazil          3
           Canada          3
           China           3
           Denmark         3
           Finland         3
           France          3
           Germany         3
           Italy           3
           Japan           3
           Korea           3
           Mexico          3
           Netherlands     3
           Singapore       3
           Spain           3
           Sweden          3
           Switzerland     3
           United          6
Mail       Australia       3
           Austria         3
           Belgium         3
           Brazil          3
           Canada          3
           China           3
           Denmark         3
           Finland         3
           France          3
           Germany         3
           Italy           3
           Japan           3
           Korea           3
           Mexico          3
           Netherlands     3
           Singapore       3
           Spain           3
           Sweden          3
           Switzerland     3
           United          6
Sales      visit          63
Special    Australia       3
           Austria         3
           Belgium         3
           Brazil          3
           Canada          3
           China           3
           Denmark         3
           Finland         3
           France          3
           Germany         3
           Italy           3
           Japan           3
           Korea           3
           Mexico          3
           Netherlands     3
           Singapore       3
           Spain           3
           Sweden          3
           Switzerland     3
           United          6
Telephone  Australia       3
           Austria         3
           Belgium         3
           Brazil          3
           Canada          3
           China           3
           Denmark         3
           Finland         3
           France          3
           Germany         3
           Italy           3
           Japan           3
           Korea           3
           Mexico          3
           Netherlands     3
           Singapore       3
           Spain           3
           Sweden          3
           Switzerland     3
           United          6
Web        Australia       3
           Austria         3
           Belgium         3
           Brazil          3
           Canada          3
           China           3
           Denmark         3
           Finland         3
           France          3
           Germany         3
           Italy           3
           Japan           3
           Korea           3
           Mexico          3
           Netherlands     3
           Singapore       3
           Spain           3
           Sweden          3
           Switzerland     3
           United          6
Name: Year, dtype: int64

In [231]:
temp1 = copy.deepcopy(temp[temp["Revenue"] == "visit"])
temp1.head()

,Year,country,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
2814,2004,Sales,visit,United,States,339693,365264.9,198030.0,2870.0,69.00,127.27,141663.200000,118.36,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat
2815,2004,Sales,visit,Canada,22370,24054,13041.0,189.0,69.0,127.27,9329.04,118.360000,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat
2816,2004,Sales,visit,Mexico,240871,268540,145590.0,2110.0,69.0,127.27,95280.79,115.107778,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat
2817,2004,Sales,visit,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat
2818,2004,Sales,visit,Japan,32193.9,34617.4,18768.0,272.0,69.0,127.27,13425.92,118.360000,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat

In [232]:
print(temp1.groupby(["country", "Revenue"])["Year"].count())

country  Revenue
Sales    visit      63
Name: Year, dtype: int64

In [233]:
temp1["Order method type"] = temp1["country"] + " " + temp1["Revenue"]
temp1 = temp1.drop(["country", "Revenue"], axis=1)
temp1.head()

,Year,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
2814,2004,United,States,339693,365264.9,198030.0,2870.0,69.00,127.27,141663.200000,118.36,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit
2815,2004,Canada,22370,24054,13041.0,189.0,69.0,127.27,9329.04,118.360000,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit
2816,2004,Mexico,240871,268540,145590.0,2110.0,69.0,127.27,95280.79,115.107778,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit
2817,2004,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit
2818,2004,Japan,32193.9,34617.4,18768.0,272.0,69.0,127.27,13425.92,118.360000,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit

Solving for countries with more than two words

In [234]:
temp1.groupby(["Planned", "revenue"])["Year"].count()

Planned      revenue
Australia    92254.33     1
             131545.96    1
Austria      11072.2      1
             96517.13     1
Belgium      17517.28     1
             117835.55    1
Canada       22370.04     1
             27275.64     1
             134331.01    1
China        62327.23     1
             355233.58    1
Denmark      30418.52     1
             31436.6      1
             71179.85     1
Finland      42827.54     1
             139138.96    1
France       77879.13     1
             104103.51    1
             195817.7     1
Germany      146546.75    1
             199791.68    1
Italy        66035.76     1
             196018.75    1
Japan        32193.92     1
Korea        185426.5     1
             355383.79    1
Mexico       81251.52     1
             240870.79    1
             303740.57    1
Netherlands  32060.84     1
             152867.28    1
Singapore    201023.15    1
Spain        24145.44     1
Switzerland  18423.02     1
             138804.68    1
United       Kingdom      3
             States       3
Name: Year, dtype: int64

In [235]:
temp2 = copy.deepcopy(temp1[temp1["revenue"].isin(["Kingdom", "States"])])
temp2.head()

,Year,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
2814,2004,United,States,339693,365264.90,198030.0,2870.0,69.00,127.27,141663.20,118.360,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit
2829,2004,United,Kingdom,22961.8,24690.38,13386.0,194.0,69.00,127.27,9575.84,118.360,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit
23982,2005,United,States,206481,219668.02,94153.3,1726.0,54.55,127.27,112328.08,119.630,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit
23997,2005,United,Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit
45150,2006,United,States,236268,264212.52,109093.8,2076.0,52.55,127.27,127174.02,115.818,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit

In [236]:
temp2.groupby(["Planned", "revenue", "Product.3"])["Year"].count()

Planned  revenue  Product.3
United   Kingdom  22961.84     1
                  42197.59     1
         States   206481.38    1
                  236267.82    1
                  339693.20    1
Name: Year, dtype: int64

In [237]:
temp2["Retailer country"] = temp2["Planned"] + " " + temp2["revenue"]
temp2 = temp2.drop(["Planned", "revenue"], axis=1)

temp2["Revenue"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Planned revenue"] = temp2["cost"]
temp2 = temp2.drop(["cost"], axis=1)

temp2["Product cost"] = temp2["Quantity"]
temp2 = temp2.drop(["Quantity"], axis=1)

temp2["Quantity"] = temp2["Unit"]
temp2 = temp2.drop(["Unit"], axis=1)

temp2["Unit cost"] = temp2["cost.1"]
temp2 = temp2.drop(["cost.1"], axis=1)

temp2["Unit price"] = temp2["Unit.1"]
temp2 = temp2.drop(["Unit.1"], axis=1)

temp2["Gross profit"] = temp2["price"]
temp2 = temp2.drop(["price"], axis=1)

temp2["Unit sale price"] = temp2["Gross"]
temp2 = temp2.drop(["Gross", "profit", "Unit.2", "sale", "price.1"], axis=1)

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
2814,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit,United States,339693,365264.90,198030.0,2870.0,69.00,127.27,141663.20,118.360
2829,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit,United Kingdom,22961.8,24690.38,13386.0,194.0,69.00,127.27,9575.84,118.360
23982,2005,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit,United States,206481,219668.02,94153.3,1726.0,54.55,127.27,112328.08,119.630
23997,2005,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit,United Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
45150,2006,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit,United States,236268,264212.52,109093.8,2076.0,52.55,127.27,127174.02,115.818

In [238]:
str5 = temp2

In [239]:
temp2 = copy.deepcopy(temp1[~temp1["revenue"].isin(["Kingdom", "States"])])
temp2.head()

,Year,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
2815,2004,Canada,22370,24054,13041.0,189.0,69.0,127.27,9329.04,118.360000,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit
2816,2004,Mexico,240871,268540,145590.0,2110.0,69.0,127.27,95280.79,115.107778,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit
2817,2004,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit
2818,2004,Japan,32193.9,34617.4,18768.0,272.0,69.0,127.27,13425.92,118.360000,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit
2819,2004,Korea,355384,397464,215487.0,3123.0,69.0,127.27,139896.79,114.701250,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit

In [240]:
temp2.groupby(["Planned", "revenue"])["Year"].count()

Planned      revenue
Australia    92254.33     1
             131545.96    1
Austria      11072.20     1
             96517.13     1
Belgium      17517.28     1
             117835.55    1
Canada       22370.04     1
             27275.64     1
             134331.01    1
China        62327.23     1
             355233.58    1
Denmark      30418.52     1
             31436.60     1
             71179.85     1
Finland      42827.54     1
             139138.96    1
France       77879.13     1
             104103.51    1
             195817.70    1
Germany      146546.75    1
             199791.68    1
Italy        66035.76     1
             196018.75    1
Japan        32193.92     1
Korea        185426.50    1
             355383.79    1
Mexico       81251.52     1
             240870.79    1
             303740.57    1
Netherlands  32060.84     1
             152867.28    1
Singapore    201023.15    1
Spain        24145.44     1
Switzerland  18423.02     1
             138804.68    1
Name: Year, dtype: int64

In [241]:
temp2["Retailer country"] = temp2["Planned"]
temp2 = temp2.drop(["Planned"], axis=1)

temp2["Revenue"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Planned revenue"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Product cost"] = temp2["cost"]
temp2 = temp2.drop(["cost"], axis=1)

temp2["Unit cost"] = temp2["Unit"]
temp2 = temp2.drop(["Unit"], axis=1)

temp2["Unit price"] = temp2["cost.1"]
temp2 = temp2.drop(["cost.1"], axis=1)

temp2["Gross profit"] = temp2["Unit.1"]
temp2 = temp2.drop(["Unit.1"], axis=1)

temp2["Unit sale price"] = temp2["price"]
temp2 = temp2.drop(["price", "Gross", "profit", "Unit.2", "sale", "price.1"], axis=1)

temp2.head()

,Year,Quantity,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Unit cost,Unit price,Gross profit,Unit sale price
2815,2004,189.0,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit,Canada,22370,24054,13041.0,69.0,127.27,9329.04,118.360000
2816,2004,2110.0,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit,Mexico,240871,268540,145590.0,69.0,127.27,95280.79,115.107778
2817,2004,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2818,2004,272.0,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit,Japan,32193.9,34617.4,18768.0,69.0,127.27,13425.92,118.360000
2819,2004,3123.0,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit,Korea,355384,397464,215487.0,69.0,127.27,139896.79,114.701250

In [242]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
2815,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit,Canada,22370,24054,13041.0,189.0,69.0,127.27,9329.04,118.360000
2816,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit,Mexico,240871,268540,145590.0,2110.0,69.0,127.27,95280.79,115.107778
2817,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2818,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit,Japan,32193.9,34617.4,18768.0,272.0,69.0,127.27,13425.92,118.360000
2819,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Sales visit,Korea,355384,397464,215487.0,3123.0,69.0,127.27,139896.79,114.701250

In [243]:
str6 = temp2

In [244]:
temp1 = copy.deepcopy(temp[temp["Revenue"] != "visit"])
temp1.head()

,Year,country,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
2793,2004,Telephone,United,States,901517,1.06232e+06,575943.0,8347.0,69.00,127.27,325573.610000,110.1644,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat
2794,2004,Telephone,Canada,57049.5,61344.1,33258,482.0,69.0,127.27,23791.52,118.360000,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat
2795,2004,Telephone,Mexico,28879.8,31053.9,16836,244.0,69.0,127.27,12043.84,118.360000,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat
2796,2004,Telephone,Brazil,19647.8,21126.8,11454,166.0,69.0,127.27,8193.76,118.360000,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat
2797,2004,Telephone,Japan,423905,470263,254955,3695.0,69.0,127.27,168950.27,115.920833,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat

In [245]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp1.groupby(["country", "Revenue"])["Year"].count())

country    Revenue
E-mail     Australia      3
           Austria        3
           Belgium        3
           Brazil         3
           Canada         3
           China          3
           Denmark        3
           Finland        3
           France         3
           Germany        3
           Italy          3
           Japan          3
           Korea          3
           Mexico         3
           Netherlands    3
           Singapore      3
           Spain          3
           Sweden         3
           Switzerland    3
           United         6
Fax        Australia      3
           Austria        3
           Belgium        3
           Brazil         3
           Canada         3
           China          3
           Denmark        3
           Finland        3
           France         3
           Germany        3
           Italy          3
           Japan          3
           Korea          3
           Mexico         3
           Netherlands    3
           Singapore      3
           Spain          3
           Sweden         3
           Switzerland    3
           United         6
Mail       Australia      3
           Austria        3
           Belgium        3
           Brazil         3
           Canada         3
           China          3
           Denmark        3
           Finland        3
           France         3
           Germany        3
           Italy          3
           Japan          3
           Korea          3
           Mexico         3
           Netherlands    3
           Singapore      3
           Spain          3
           Sweden         3
           Switzerland    3
           United         6
Special    Australia      3
           Austria        3
           Belgium        3
           Brazil         3
           Canada         3
           China          3
           Denmark        3
           Finland        3
           France         3
           Germany        3
           Italy          3
           Japan          3
           Korea          3
           Mexico         3
           Netherlands    3
           Singapore      3
           Spain          3
           Sweden         3
           Switzerland    3
           United         6
Telephone  Australia      3
           Austria        3
           Belgium        3
           Brazil         3
           Canada         3
           China          3
           Denmark        3
           Finland        3
           France         3
           Germany        3
           Italy          3
           Japan          3
           Korea          3
           Mexico         3
           Netherlands    3
           Singapore      3
           Spain          3
           Sweden         3
           Switzerland    3
           United         6
Web        Australia      3
           Austria        3
           Belgium        3
           Brazil         3
           Canada         3
           China          3
           Denmark        3
           Finland        3
           France         3
           Germany        3
           Italy          3
           Japan          3
           Korea          3
           Mexico         3
           Netherlands    3
           Singapore      3
           Spain          3
           Sweden         3
           Switzerland    3
           United         6
Name: Year, dtype: int64

In [246]:
temp1["Order method type"] = temp1["country"]
temp1 = temp1.drop(["country"], axis=1)
temp1.head()

,Year,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
2793,2004,United,States,901517,1.06232e+06,575943.0,8347.0,69.00,127.27,325573.610000,110.1644,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone
2794,2004,Canada,57049.5,61344.1,33258,482.0,69.0,127.27,23791.52,118.360000,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone
2795,2004,Mexico,28879.8,31053.9,16836,244.0,69.0,127.27,12043.84,118.360000,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone
2796,2004,Brazil,19647.8,21126.8,11454,166.0,69.0,127.27,8193.76,118.360000,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone
2797,2004,Japan,423905,470263,254955,3695.0,69.0,127.27,168950.27,115.920833,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone

In [247]:
temp1.groupby(["Revenue", "Planned"])["Year"].count()

Revenue      Planned
Australia    47880.36      1
             63882.42      1
             96997.07      1
             412686.39     1
Austria      60680.79      1
                          ..
Sweden       172236.54     1
Switzerland  186830.31     1
             219900.24     1
United       Kingdom      18
             States       18
Name: Year, Length: 126, dtype: int64

In [248]:
temp2 = copy.deepcopy(temp1[temp1["Planned"].isin(["Kingdom", "States"])])
temp2.head()

,Year,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
2793,2004,United,States,901517,1.06232e+06,575943.0,8347.0,69.0,127.27,325573.61,110.164400,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone
2808,2004,United,Kingdom,297037,352665,191199.0,2771.0,69.0,127.27,105838.17,109.579000,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone
2835,2004,United,States,411303,457027,247779.0,3591.0,69.0,127.27,163524.13,115.920833,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Web
2850,2004,United,Kingdom,317259,349356,189405.0,2745.0,69.0,127.27,127853.73,116.108462,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Web
2856,2004,United,States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Special

In [249]:
temp2.groupby(["Revenue", "Planned", "revenue"])["Year"].count()

Revenue  Planned  revenue
United   Kingdom  60173.89      1
                  297037.17     1
                  317258.73     1
                  639525.72     1
                  783749.89     1
         States   38760.12      1
                  39295.52      1
                  98335.86      1
                  411303.13     1
                  439524.68     1
                  901516.61     1
                  1147995.48    1
                  2157500.04    1
Name: Year, dtype: int64

In [250]:
temp2["Retailer country"] = temp2["Revenue"] + " " + temp2["Planned"]
temp2 = temp2.drop(["Revenue", "Planned"], axis=1)

temp2["Revenue"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Planned revenue"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Product cost"] = temp2["cost"]
temp2 = temp2.drop(["cost"], axis=1)

temp2["Unit cost"] = temp2["Unit"]
temp2 = temp2.drop(["Unit"], axis=1)

temp2["Unit price"] = temp2["cost.1"]
temp2 = temp2.drop(["cost.1"], axis=1)

temp2["Gross profit"] = temp2["Unit.1"]
temp2 = temp2.drop(["Unit.1"], axis=1)

temp2["Unit sale price"] = temp2["price"]
temp2 = temp2.drop(["price", "Gross", "profit", "Unit.2", "sale", "price.1"], axis=1)

temp2.head()

,Year,Quantity,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Unit cost,Unit price,Gross profit,Unit sale price
2793,2004,8347.0,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone,United States,901517,1.06232e+06,575943.0,69.0,127.27,325573.61,110.164400
2808,2004,2771.0,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone,United Kingdom,297037,352665,191199.0,69.0,127.27,105838.17,109.579000
2835,2004,3591.0,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Web,United States,411303,457027,247779.0,69.0,127.27,163524.13,115.920833
2850,2004,2745.0,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Web,United Kingdom,317259,349356,189405.0,69.0,127.27,127853.73,116.108462
2856,2004,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Special,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [251]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
2793,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone,United States,901517,1.06232e+06,575943.0,8347.0,69.0,127.27,325573.61,110.164400
2808,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone,United Kingdom,297037,352665,191199.0,2771.0,69.0,127.27,105838.17,109.579000
2835,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Web,United States,411303,457027,247779.0,3591.0,69.0,127.27,163524.13,115.920833
2850,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Web,United Kingdom,317259,349356,189405.0,2745.0,69.0,127.27,127853.73,116.108462
2856,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Special,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [252]:
str7 = temp2

In [253]:
temp2 = copy.deepcopy(temp1[~temp1["Planned"].isin(["Kingdom", "States"])])
temp2.head()

,Year,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
2794,2004,Canada,57049.5,61344.1,33258,482.0,69.0,127.27,23791.52,118.360000,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone
2795,2004,Mexico,28879.8,31053.9,16836,244.0,69.0,127.27,12043.84,118.360000,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone
2796,2004,Brazil,19647.8,21126.8,11454,166.0,69.0,127.27,8193.76,118.360000,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone
2797,2004,Japan,423905,470263,254955,3695.0,69.0,127.27,168950.27,115.920833,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone
2798,2004,Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone

In [254]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp2.groupby(["Revenue", "Planned"])["Year"].count())

Revenue      Planned
Australia    47880.36     1
             63882.42     1
             96997.07     1
             412686.39    1
Austria      60680.79     1
             126807.80    1
             137259.88    1
             182645.80    1
             336946.91    1
Belgium      10415.68     1
             10889.12     1
             49331.28     1
             80444.52     1
             175778.58    1
             337863.57    1
Brazil       17872.36     1
             19647.76     1
             219399.67    1
             321896.44    1
             450531.42    1
Canada       25241.93     1
             27993.42     1
             29234.92     1
             36635.73     1
             57049.52     1
             121030.91    1
             243510.38    1
             292556.05    1
             641166.05    1
             699937.20    1
China        61547.20     1
             62967.52     1
             161979.02    1
             551924.81    1
             605489.13    1
             731674.32    1
Denmark      62175.35     1
             78477.28     1
             110752.86    1
             123212.76    1
Finland      37401.76     1
             324303.41    1
             439127.59    1
             630565.91    1
France       26867.72     1
             44132.15     1
             71419.11     1
             101494.85    1
             145465.12    1
             149048.92    1
             179595.98    1
             320334.90    1
             630532.46    1
Germany      22011.92     1
             33975.71     1
             53321.31     1
             56812.80     1
             58641.35     1
             166772.04    1
             263803.30    1
             395800.78    1
             622883.48    1
Italy        24618.88     1
             33974.92     1
             45583.07     1
             50126.34     1
             60696.82     1
             124309.23    1
             297640.81    1
             655949.72    1
Japan        28471.94     1
             31128.68     1
             81051.93     1
             93584.34     1
             114366.28    1
             158060.26    1
             158859.00    1
             220240.25    1
             423905.27    1
             504507.90    1
             911571.33    1
Korea        76173.30     1
             175026.19    1
             418625.04    1
             621324.73    1
Mexico       28879.84     1
             42588.28     1
             56664.57     1
             158313.97    1
             712241.46    1
Netherlands  30146.76     1
             48199.51     1
             80484.80     1
             90201.02     1
             113469.86    1
             211494.46    1
             267724.77    1
             409823.09    1
Singapore    24524.15     1
             35547.54     1
             37085.30     1
             37638.48     1
             44266.64     1
             77052.36     1
             122680.52    1
             508784.10    1
             632576.55    1
Spain        21068.08     1
             27634.53     1
             49947.92     1
             65676.87     1
             96486.18     1
             204462.33    1
             292500.58    1
             591739.12    1
Sweden       31483.76     1
             37481.40     1
             65622.26     1
             69146.14     1
             83186.08     1
             116169.10    1
             172236.54    1
Switzerland  186830.31    1
             219900.24    1
Name: Year, dtype: int64

In [255]:
temp2["Retailer country"] = temp2["Revenue"]
temp2 = temp2.drop(["Revenue"], axis=1)

temp2["Revenue"] = temp2["Planned"]
temp2 = temp2.drop(["Planned"], axis=1)

temp2["Planned revenue"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Product cost"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Unit cost"] = temp2["Quantity"]
temp2 = temp2.drop(["Quantity"], axis=1)

temp2["Unit price"] = temp2["Unit"]
temp2 = temp2.drop(["Unit"], axis=1)

temp2["Quantity"] = temp2["cost"]
temp2 = temp2.drop(["cost"], axis=1)

temp2["Gross profit"] = temp2["cost.1"]
temp2 = temp2.drop(["cost.1"], axis=1)

temp2["Unit sale price"] = temp2["Unit.1"]
temp2 = temp2.drop(["Unit.1", "price", "Gross", "profit", "Unit.2", "sale", "price.1"], axis=1)

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Unit cost,Unit price,Quantity,Gross profit,Unit sale price
2794,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone,Canada,57049.5,61344.1,33258,69.0,127.27,482.0,23791.52,118.360000
2795,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone,Mexico,28879.8,31053.9,16836,69.0,127.27,244.0,12043.84,118.360000
2796,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone,Brazil,19647.8,21126.8,11454,69.0,127.27,166.0,8193.76,118.360000
2797,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone,Japan,423905,470263,254955,69.0,127.27,3695.0,168950.27,115.920833
2798,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone,Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [256]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]
temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
2794,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone,Canada,57049.5,61344.1,33258,482.0,69.0,127.27,23791.52,118.360000
2795,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone,Mexico,28879.8,31053.9,16836,244.0,69.0,127.27,12043.84,118.360000
2796,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone,Brazil,19647.8,21126.8,11454,166.0,69.0,127.27,8193.76,118.360000
2797,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone,Japan,423905,470263,254955,3695.0,69.0,127.27,168950.27,115.920833
2798,2004,Camping Equipment,Sleeping Bags,Hibernator Self - Inflating Mat,Telephone,Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [257]:
str8 = temp2

Let's handle products with four words

In [258]:
tmp4.groupby(["Product.2", "Order", "method", "type.1", "Retailer"])["Year"].count()

Product.2   Order   method  type.1     Retailer
Course      Pro     Golf    Bag        E-mail        63
                                       Fax           63
                                       Mail          63
                                       Sales         63
                                       Special       63
                                       Telephone     63
                                       Web           63
                            and        Tee          441
Deluxe      Family  Relief  Kit        E-mail        63
                                       Fax           63
                                       Mail          63
                                       Sales         63
                                       Special       63
                                       Telephone     63
                                       Web           63
Hibernator  Self    0       Inflating  Mat          441
TrailChef   Deluxe  Cook    Set        E-mail        84
                                       Fax           84
                                       Mail          84
                                       Sales         84
                                       Special       84
                                       Telephone     84
                                       Web           84
Name: Year, dtype: int64

In [259]:
temp = copy.deepcopy(tmp4[~tmp4.index.isin(tmp5.index.values)])
temp.head()

,Year,Product.2,Order,method,type.1,Retailer,country,Revenue,Planned,revenue,...,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type
735,2004,TrailChef,Deluxe,Cook,Set,Telephone,United,States,865351,930482,...,254856.69,120.64,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
736,2004,TrailChef,Deluxe,Cook,Set,Telephone,Canada,67799.7,72902.6,47831.8,...,120.64,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
737,2004,TrailChef,Deluxe,Cook,Set,Telephone,Mexico,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
738,2004,TrailChef,Deluxe,Cook,Set,Telephone,Brazil,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
739,2004,TrailChef,Deluxe,Cook,Set,Telephone,Japan,419827,451426,296183,...,120.64,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear

In [260]:
temp.groupby(["Product.2", "Order", "method", "type.1", "Retailer"])["Year"].count()

Product.2  Order   method  type.1  Retailer
Course     Pro     Golf    Bag     E-mail       63
                                   Fax          63
                                   Mail         63
                                   Sales        63
                                   Special      63
                                   Telephone    63
                                   Web          63
Deluxe     Family  Relief  Kit     E-mail       63
                                   Fax          63
                                   Mail         63
                                   Sales        63
                                   Special      63
                                   Telephone    63
                                   Web          63
TrailChef  Deluxe  Cook    Set     E-mail       84
                                   Fax          84
                                   Mail         84
                                   Sales        84
                                   Special      84
                                   Telephone    84
                                   Web          84
Name: Year, dtype: int64

In [261]:
temp["Product"] = temp["Product.2"] + " " + temp["Order"] + " " + temp["method"] + " " + temp["type.1"]
temp = temp.drop(["Product.2", "Order", "method", "type.1"], axis=1)
temp.head()

,Year,Retailer,country,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,...,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
735,2004,Telephone,United,States,865351,930482,610494,7173.00,85.11,129.72,...,120.64,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set
736,2004,Telephone,Canada,67799.7,72902.6,47831.8,562,85.11,129.72,19967.86,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set
737,2004,Telephone,Mexico,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set
738,2004,Telephone,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set
739,2004,Telephone,Japan,419827,451426,296183,3480,85.11,129.72,123644.40,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set

In [262]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp.groupby(["Retailer", "country"])["Year"].count())

Retailer   country
E-mail     Australia       10
           Austria         10
           Belgium         10
           Brazil          10
           Canada          10
           China           10
           Denmark         10
           Finland         10
           France          10
           Germany         10
           Italy           10
           Japan           10
           Korea           10
           Mexico          10
           Netherlands     10
           Singapore       10
           Spain           10
           Sweden          10
           Switzerland     10
           United          20
Fax        Australia       10
           Austria         10
           Belgium         10
           Brazil          10
           Canada          10
           China           10
           Denmark         10
           Finland         10
           France          10
           Germany         10
           Italy           10
           Japan           10
           Korea           10
           Mexico          10
           Netherlands     10
           Singapore       10
           Spain           10
           Sweden          10
           Switzerland     10
           United          20
Mail       Australia       10
           Austria         10
           Belgium         10
           Brazil          10
           Canada          10
           China           10
           Denmark         10
           Finland         10
           France          10
           Germany         10
           Italy           10
           Japan           10
           Korea           10
           Mexico          10
           Netherlands     10
           Singapore       10
           Spain           10
           Sweden          10
           Switzerland     10
           United          20
Sales      visit          210
Special    Australia       10
           Austria         10
           Belgium         10
           Brazil          10
           Canada          10
           China           10
           Denmark         10
           Finland         10
           France          10
           Germany         10
           Italy           10
           Japan           10
           Korea           10
           Mexico          10
           Netherlands     10
           Singapore       10
           Spain           10
           Sweden          10
           Switzerland     10
           United          20
Telephone  Australia       10
           Austria         10
           Belgium         10
           Brazil          10
           Canada          10
           China           10
           Denmark         10
           Finland         10
           France          10
           Germany         10
           Italy           10
           Japan           10
           Korea           10
           Mexico          10
           Netherlands     10
           Singapore       10
           Spain           10
           Sweden          10
           Switzerland     10
           United          20
Web        Australia       10
           Austria         10
           Belgium         10
           Brazil          10
           Canada          10
           China           10
           Denmark         10
           Finland         10
           France          10
           Germany         10
           Italy           10
           Japan           10
           Korea           10
           Mexico          10
           Netherlands     10
           Singapore       10
           Spain           10
           Sweden          10
           Switzerland     10
           United          20
Name: Year, dtype: int64

In [263]:
temp1 = copy.deepcopy(temp[temp["country"] == "visit"])
temp1.head()

,Year,Retailer,country,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,...,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
756,2004,Sales,visit,United,States,465791,500849,328609.71,3861.00,85.11,...,137181.33,120.64,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set
757,2004,Sales,visit,Canada,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set
758,2004,Sales,visit,Mexico,365177,392662,257628,3027.00,85.11,129.72,...,120.64,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set
759,2004,Sales,visit,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set
760,2004,Sales,visit,Japan,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set

In [264]:
temp1.groupby(["Retailer", "country", "Revenue"])["Year"].count()

Retailer  country  Revenue
Sales     visit    Australia      10
                   Austria        10
                   Belgium        10
                   Brazil         10
                   Canada         10
                   China          10
                   Denmark        10
                   Finland        10
                   France         10
                   Germany        10
                   Italy          10
                   Japan          10
                   Korea          10
                   Mexico         10
                   Netherlands    10
                   Singapore      10
                   Spain          10
                   Sweden         10
                   Switzerland    10
                   United         20
Name: Year, dtype: int64

In [265]:
temp1["Order method type"] = temp1["Retailer"] + " " + temp1["country"]
temp1 = temp1.drop(["Retailer", "country"], axis=1)
temp1.head()

,Year,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
756,2004,United,States,465791,500849,328609.71,3861.00,85.11,129.72,137181.33,120.64,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit
757,2004,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit
758,2004,Mexico,365177,392662,257628,3027.00,85.11,129.72,107549.31,120.64,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit
759,2004,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit
760,2004,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit

In [266]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp1.groupby(["Revenue", "Planned", "revenue"])["Year"].count())

Revenue      Planned    revenue
Australia    2503.9     2555.00      1
             26507.25   30555.00     1
             60182.16   64254.90     1
             66790.66   70308.24     1
             76306.67   79167.30     1
             133036.54  141524.52    1
Austria      2105.28    2631.60      1
             3207.75    4935.00      1
             5670       5670.00      1
             8772       8772.00      1
             11842.2    13158.00     1
             43376.96   45661.44     1
             54141.36   57595.68     1
             132841.94  139838.16    1
Belgium      6685.35    7175.00      1
             22318.4    23998.20     1
             29451.97   31003.08     1
             79748.76   89247.36     1
Canada       2625       2625.00      1
             22292.38   23465.10     1
             29265.6    31132.80     1
             175849.21  185110.44    1
China        9896.25    15225.00     1
             54387.4    56579.40     1
             106963.64  112596.96    1
             167789.44  210665.28    1
Denmark      8158       8772.00      1
             63818.56   68621.88     1
             131451.32  142951.44    1
Finland      8249.85    8505.00      1
             47105.1    49910.00     1
             51702.56   55001.28     1
             57969.98   64693.50     1
             131980.16  141913.68    1
France       2213.75    4025.00      1
             11131.56   11842.20     1
             24079.36   24561.60     1
             30363.06   34375.80     1
             32948.3    37345.00     1
             76893.55   85746.30     1
             91058.1    95515.00     1
             112632.22  118564.08    1
             173014.92  182126.88    1
             240194.24  258272.52    1
Germany      3361.4     3430.00      1
             11013.3    11842.20     1
             11749.98   12500.10     1
             199249.96  216632.40    1
             268424     288627.00    1
Italy        29042.08   33552.90     1
             46337.2    70178.52     1
             57262.8    60550.00     1
             219926.72  236479.56    1
Japan        1715       1715.00      1
             165744.35  174473.40    1
Korea        21262.5    23625.00     1
             120110.9   135816.84    1
             522853.76  562206.48    1
Mexico       6440       6440.00      1
             11184.3    11184.30     1
             30599.45   37065.00     1
             31443.3    33670.00     1
             46706.7    51754.80     1
             75855.45   82237.50     1
             365177.28  392662.44    1
             388135.02  456354.96    1
Netherlands  0          31132.80     1
             158227.32  166560.48    1
Singapore    2744       2800.00      1
             17743.65   19079.10     1
             46538.1    49840.00     1
             58534.25   61617.00     1
             75416.76   79388.64     1
             442990.08  476331.84    1
Spain        63956.37   67324.68     1
Sweden       32917.72   34649.40     1
Switzerland  2503.9     2555.00      1
             12284.3    12320.00     1
             23900.24   28668.12     1
             26048.42   28070.40     1
             82929.2    85307.70     1
             195812.47  206125.08    1
United       Kingdom    0.00         1
                        2170.00      1
                        59986.74     1
                        86630.69     1
             States     6210.75      1
                        6947.49      1
                        7910.00      1
                        19583.30     1
                        40004.86     1
                        107703.02    1
                        193840.79    1
                        368380.74    1
                        465791.04    1
Name: Year, dtype: int64

In [267]:
temp2 = copy.deepcopy(temp1[temp1["Planned"].isin(["Kingdom", "States"])])
temp2.head()

,Year,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
756,2004,United,States,465791,500849,328609.71,3861.0,85.11,129.72,137181.33,120.640000,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit
771,2004,United,Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit
15309,2004,United,States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Outdoor Protection,First Aid,Deluxe Family Relief Kit,Sales visit
15324,2004,United,Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Outdoor Protection,First Aid,Deluxe Family Relief Kit,Sales visit
17808,2004,United,States,40004.9,44517.9,16179.10,203.0,79.70,219.30,23825.76,194.446667,NaN,NaN,NaN,NaN,NaN,Golf Equipment,Golf Accessories,Course Pro Golf Bag,Sales visit

In [268]:
temp2.groupby(["Revenue", "Planned", "revenue"])["Year"].count()

Revenue  Planned  revenue
United   Kingdom  0.00         1
                  2170.00      1
                  59986.74     1
                  86630.69     1
         States   6210.75      1
                  6947.49      1
                  7910.00      1
                  19583.30     1
                  40004.86     1
                  107703.02    1
                  193840.79    1
                  368380.74    1
                  465791.04    1
Name: Year, dtype: int64

In [269]:
temp2["Retailer country"] = temp2["Revenue"] + " " + temp2["Planned"]
temp2 = temp2.drop(["Revenue", "Planned"], axis=1)

temp2["Revenue"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Planned revenue"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Product cost"] = temp2["cost"]
temp2 = temp2.drop(["cost"], axis=1)

temp2["Unit cost"] = temp2["Unit"]
temp2 = temp2.drop(["Unit"], axis=1)

temp2["Unit price"] = temp2["cost.1"]
temp2 = temp2.drop(["cost.1"], axis=1)

temp2["Gross profit"] = temp2["Unit.1"]
temp2 = temp2.drop(["Unit.1"], axis=1)

temp2["Unit sale price"] = temp2["price"]
temp2 = temp2.drop(["price", "Gross", "profit", "Unit.2", "sale", "price.1"], axis=1)

temp2.head()

,Year,Quantity,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Unit cost,Unit price,Gross profit,Unit sale price
756,2004,3861.0,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit,United States,465791,500849,328609.71,85.11,129.72,137181.33,120.640000
771,2004,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit,United Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15309,2004,NaN,Outdoor Protection,First Aid,Deluxe Family Relief Kit,Sales visit,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15324,2004,NaN,Outdoor Protection,First Aid,Deluxe Family Relief Kit,Sales visit,United Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17808,2004,203.0,Golf Equipment,Golf Accessories,Course Pro Golf Bag,Sales visit,United States,40004.9,44517.9,16179.10,79.70,219.30,23825.76,194.446667

In [270]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]
temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
756,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit,United States,465791,500849,328609.71,3861.0,85.11,129.72,137181.33,120.640000
771,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit,United Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15309,2004,Outdoor Protection,First Aid,Deluxe Family Relief Kit,Sales visit,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15324,2004,Outdoor Protection,First Aid,Deluxe Family Relief Kit,Sales visit,United Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17808,2004,Golf Equipment,Golf Accessories,Course Pro Golf Bag,Sales visit,United States,40004.9,44517.9,16179.10,203.0,79.70,219.30,23825.76,194.446667

In [271]:
str9 = temp2

In [272]:
temp2 = copy.deepcopy(temp1[~temp1["Planned"].isin(["Kingdom", "States"])])
temp2.head()

,Year,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
757,2004,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit
758,2004,Mexico,365177,392662,257628,3027.0,85.11,129.72,107549.31,120.64,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit
759,2004,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit
760,2004,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit
761,2004,Korea,522854,562206,368867,4334.0,85.11,129.72,153987.02,120.64,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit

In [273]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp2.groupby(["Revenue", "Planned", "revenue"])["Year"].count())

Revenue      Planned    revenue
Australia    2503.90    2555.00      1
             26507.25   30555.00     1
             60182.16   64254.90     1
             66790.66   70308.24     1
             76306.67   79167.30     1
             133036.54  141524.52    1
Austria      2105.28    2631.60      1
             3207.75    4935.00      1
             5670.00    5670.00      1
             8772.00    8772.00      1
             11842.20   13158.00     1
             43376.96   45661.44     1
             54141.36   57595.68     1
             132841.94  139838.16    1
Belgium      6685.35    7175.00      1
             22318.40   23998.20     1
             29451.97   31003.08     1
             79748.76   89247.36     1
Canada       2625.00    2625.00      1
             22292.38   23465.10     1
             29265.60   31132.80     1
             175849.21  185110.44    1
China        9896.25    15225.00     1
             54387.40   56579.40     1
             106963.64  112596.96    1
             167789.44  210665.28    1
Denmark      8158.00    8772.00      1
             63818.56   68621.88     1
             131451.32  142951.44    1
Finland      8249.85    8505.00      1
             47105.10   49910.00     1
             51702.56   55001.28     1
             57969.98   64693.50     1
             131980.16  141913.68    1
France       2213.75    4025.00      1
             11131.56   11842.20     1
             24079.36   24561.60     1
             30363.06   34375.80     1
             32948.30   37345.00     1
             76893.55   85746.30     1
             91058.10   95515.00     1
             112632.22  118564.08    1
             173014.92  182126.88    1
             240194.24  258272.52    1
Germany      3361.40    3430.00      1
             11013.30   11842.20     1
             11749.98   12500.10     1
             199249.96  216632.40    1
             268424.00  288627.00    1
Italy        29042.08   33552.90     1
             46337.20   70178.52     1
             57262.80   60550.00     1
             219926.72  236479.56    1
Japan        1715.00    1715.00      1
             165744.35  174473.40    1
Korea        21262.50   23625.00     1
             120110.90  135816.84    1
             522853.76  562206.48    1
Mexico       6440.00    6440.00      1
             11184.30   11184.30     1
             30599.45   37065.00     1
             31443.30   33670.00     1
             46706.70   51754.80     1
             75855.45   82237.50     1
             365177.28  392662.44    1
             388135.02  456354.96    1
Netherlands  0.00       31132.80     1
             158227.32  166560.48    1
Singapore    2744.00    2800.00      1
             17743.65   19079.10     1
             46538.10   49840.00     1
             58534.25   61617.00     1
             75416.76   79388.64     1
             442990.08  476331.84    1
Spain        63956.37   67324.68     1
Sweden       32917.72   34649.40     1
Switzerland  2503.90    2555.00      1
             12284.30   12320.00     1
             23900.24   28668.12     1
             26048.42   28070.40     1
             82929.20   85307.70     1
             195812.47  206125.08    1
Name: Year, dtype: int64

In [274]:
temp2["Retailer country"] = temp2["Revenue"]
temp2 = temp2.drop(["Revenue"], axis=1)

temp2["Revenue"] = temp2["Planned"]
temp2 = temp2.drop(["Planned"], axis=1)

temp2["Planned revenue"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Product cost"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Unit cost"] = temp2["Quantity"]
temp2 = temp2.drop(["Quantity"], axis=1)

temp2["Unit price"] = temp2["Unit"]
temp2 = temp2.drop(["Unit"], axis=1)

temp2["Quantity"] = temp2["cost"]
temp2 = temp2.drop(["cost"], axis=1)

temp2["Gross profit"] = temp2["cost.1"]
temp2 = temp2.drop(["cost.1"], axis=1)

temp2["Unit sale price"] = temp2["Unit.1"]
temp2 = temp2.drop(["Unit.1", "price", "Gross", "profit", "Unit.2", "sale", "price.1"], axis=1)

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Unit cost,Unit price,Quantity,Gross profit,Unit sale price
757,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
758,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit,Mexico,365177,392662,257628,85.11,129.72,3027.0,107549.31,120.64
759,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
760,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
761,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit,Korea,522854,562206,368867,85.11,129.72,4334.0,153987.02,120.64

In [275]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]
temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
757,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
758,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit,Mexico,365177,392662,257628,3027.0,85.11,129.72,107549.31,120.64
759,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
760,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
761,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Sales visit,Korea,522854,562206,368867,4334.0,85.11,129.72,153987.02,120.64

In [276]:
str10 = temp2

In [277]:
temp1 = copy.deepcopy(temp[temp["country"] != "visit"])
temp1.head()

,Year,Retailer,country,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,...,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
735,2004,Telephone,United,States,865351,930482,610494,7173.00,85.11,129.72,...,120.64,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set
736,2004,Telephone,Canada,67799.7,72902.6,47831.8,562,85.11,129.72,19967.86,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set
737,2004,Telephone,Mexico,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set
738,2004,Telephone,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set
739,2004,Telephone,Japan,419827,451426,296183,3480,85.11,129.72,123644.40,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set

In [278]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp1.groupby(["Retailer", "country"])["Year"].count())

Retailer   country
E-mail     Australia      10
           Austria        10
           Belgium        10
           Brazil         10
           Canada         10
           China          10
           Denmark        10
           Finland        10
           France         10
           Germany        10
           Italy          10
           Japan          10
           Korea          10
           Mexico         10
           Netherlands    10
           Singapore      10
           Spain          10
           Sweden         10
           Switzerland    10
           United         20
Fax        Australia      10
           Austria        10
           Belgium        10
           Brazil         10
           Canada         10
           China          10
           Denmark        10
           Finland        10
           France         10
           Germany        10
           Italy          10
           Japan          10
           Korea          10
           Mexico         10
           Netherlands    10
           Singapore      10
           Spain          10
           Sweden         10
           Switzerland    10
           United         20
Mail       Australia      10
           Austria        10
           Belgium        10
           Brazil         10
           Canada         10
           China          10
           Denmark        10
           Finland        10
           France         10
           Germany        10
           Italy          10
           Japan          10
           Korea          10
           Mexico         10
           Netherlands    10
           Singapore      10
           Spain          10
           Sweden         10
           Switzerland    10
           United         20
Special    Australia      10
           Austria        10
           Belgium        10
           Brazil         10
           Canada         10
           China          10
           Denmark        10
           Finland        10
           France         10
           Germany        10
           Italy          10
           Japan          10
           Korea          10
           Mexico         10
           Netherlands    10
           Singapore      10
           Spain          10
           Sweden         10
           Switzerland    10
           United         20
Telephone  Australia      10
           Austria        10
           Belgium        10
           Brazil         10
           Canada         10
           China          10
           Denmark        10
           Finland        10
           France         10
           Germany        10
           Italy          10
           Japan          10
           Korea          10
           Mexico         10
           Netherlands    10
           Singapore      10
           Spain          10
           Sweden         10
           Switzerland    10
           United         20
Web        Australia      10
           Austria        10
           Belgium        10
           Brazil         10
           Canada         10
           China          10
           Denmark        10
           Finland        10
           France         10
           Germany        10
           Italy          10
           Japan          10
           Korea          10
           Mexico         10
           Netherlands    10
           Singapore      10
           Spain          10
           Sweden         10
           Switzerland    10
           United         20
Name: Year, dtype: int64

In [279]:
temp1["Order method type"] = temp1["Retailer"]
temp1 = temp1.drop(["Retailer"], axis=1)
temp1.head()

,Year,country,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
735,2004,United,States,865351,930482,610494,7173.00,85.11,129.72,254856.69,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone
736,2004,Canada,67799.7,72902.6,47831.8,562,85.11,129.72,19967.86,120.64,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone
737,2004,Mexico,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone
738,2004,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone
739,2004,Japan,419827,451426,296183,3480,85.11,129.72,123644.40,120.64,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone

In [280]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp1.groupby(["country", "Revenue", "Planned"])["Year"].count())

country      Revenue     Planned
Australia    2485        2485.00       1
             3118.5      5670.00       1
             10977.75    14490.00      1
             19178.6     21385.00      1
             27004.34    28728.30      1
             28412.02    30224.76      1
             39013.17    41886.30      1
             56458.22    76794.24      1
             116330.76   131276.64     1
             141837.73   149307.72     1
             164434.36   171492.60     1
             411588.2    433264.80     1
             513252.95   540283.80     1
Austria      3549        5460.00       1
             15430.8     16660.00      1
             19467       24885.00      1
             28214.2     30275.00      1
             29506.89    32017.80      1
             38414.87    41228.40      1
             53926.08    57984.84      1
             57834.12    63816.30      1
             64323       67445.00      1
             118281.8    131276.64     1
             118736.64   126316.80     1
             178520.16   205606.20     1
             179391.68   192893.64     1
             195498.57   203510.40     1
             295259.08   310809.12     1
             389160.34   409655.76     1
Belgium      3393.6      3535.00       1
             4254.4      4386.00       1
             20763.75    25095.00      1
             23162.88    24906.24      1
             31831.8     33390.00      1
             36106.39    38007.96      1
             41826.4     49385.00      1
             51147.42    54605.70      1
             88067.2     94695.60      1
             162949.78   174562.80     1
             172734.65   179606.70     1
             294519.7    310030.80     1
             322409.36   365291.52     1
             349110.59   367496.76     1
Brazil       23390.5     28525.00      1
             29097.6     30310.00      1
             38866.45    45535.00      1
             51373.47    59211.00      1
             62231.4     66255.00      1
             64542.4     69400.20      1
             87902.45    94518.30      1
             154971.83   165790.80     1
             201167.56   209212.20     1
             282780.16   304063.68     1
             305240.71   321316.44     1
             365332.24   422627.76     1
             382875.61   403040.04     1
Canada       3920        3920.00       1
             4072.25     6265.00       1
             4893        7350.00       1
             7852.95     10255.00      1
             7862.4      8190.00       1
             10809.35    11622.90      1
             23230.2     25025.00      1
             27289.8     30263.40      1
             33126.06    34868.70      1
             34012.65    35035.00      1
             36460.06    38786.28      1
             36780.45    40110.00      1
             40670.35    43925.00      1
             49784.92    52406.88      1
             65060.05    69956.70      1
             67799.68    72902.64      1
             68885.44    74070.12      1
             80728.05    85746.30      1
             108282.72   118045.20     1
             137647.91   144897.24     1
             183283.45   192605.00     1
             203934.55   222808.80     1
             221133.12   237776.76     1
             240668.19   253343.16     1
             245833.16   262721.40     1
             385340.02   402854.10     1
             400374.27   421460.28     1
             421878.08   453630.84     1
             662987.78   731361.36     1
             751210.08   790773.12     1
China        33751.08    35526.60      1
             46908.5     50439.00      1
             53390.26    56798.70      1
             55953.1     68215.00      1
             71418.88    76794.24      1
             73773.7     83928.84      1
             78316.8     84211.20      1
             90729.8     104020.00     1
             101832.82   103728.90     1
             111153.85   120834.30     1
             198306.68   210966.60     1
             205044.05   229826.40     1
             234850      250005.00     1
             248976.96   261405.60     1
             735683.1    774428.40     1
             746638.62   810620.28     1
             770648.32   828651.36     1
             1149612.67  1210157.88    1
Denmark      0           5967.12       1
             8662.5      9625.00       1
             9381.7      10087.80      1
             20724.9     27195.00      1
             24007.36    25814.28      1
             28109.12    30224.76      1
             34098.75    38675.00      1
             34837.66    37061.70      1
             36845.77    38786.28      1
             58781.28    66228.60      1
             61898.4     64035.60      1
             67714.85    71050.00      1
             142577.11   150086.04     1
             181641.02   191207.28     1
Finland      21302.4     22190.00      1
             39331.6     47530.00      1
             43430.4     46699.20      1
             52501.75    63455.00      1
             70795.2     74900.00      1
             146330.74   160746.90     1
             244421.01   261844.20     1
             325052.64   338599.20     1
             344427.2    370350.60     1
             534584.96   610073.16     1
             544553.37   573232.68     1
             666551.07   701655.48     1
France       3945.9      3990.00       1
             5027.75     7735.00       1
             8434.65     11235.00      1
             8769.85     9429.90       1
             23750.76    25000.20      1
             34952.75    41615.00      1
             36303.1     39035.40      1
             38939.25    44485.00      1
             46581.08    49553.04      1
             53842.8     57895.20      1
             56901.6     61320.00      1
             91066.97    95863.08      1
             93438.45    98910.00      1
             117744.64   126606.72     1
             126329.84   150215.76     1
             132596.43   141229.20     1
             133981.85   149124.00     1
             177403.63   190791.00     1
             195195.52   209886.96     1
             275059.2    295761.60     1
             284755.1    296493.60     1
             503517.78   530035.92     1
             596652.42   672338.76     1
             633278.97   666631.08     1
Germany      1365        1365.00       1
             3640        5600.00       1
             6475        6475.00       1
             13261.5     14735.00      1
             14710.5     16345.00      1
             25750.4     26316.00      1
             25892.65    34965.00      1
             35220.5     44135.00      1
             35950.72    38656.56      1
             37092.23    39045.72      1
             40296.21    42418.44      1
             46882.85    50330.00      1
             49605.88    54167.10      1
             59018.96    74459.28      1
             59140.9     82242.48      1
             64903.45    69298.80      1
             65034.56    67544.40      1
             87739.76    92360.64      1
             102650.59   108056.76     1
             194844.3    205310.00     1
             211964.48   227918.04     1
             223175.93   246931.80     1
             245449.81   263160.00     1
             256671.48   267765.30     1
             267217.6    287329.80     1
             459469.92   503832.48     1
             502285.48   528738.72     1
             716459.22   754192.08     1
Italy        2310        2310.00       1
             4947.25     8995.00       1
             19359.9     20860.00      1
             22230.55    23903.70      1
             28248.5     31430.00      1
             36153.6     37660.00      1
             54053.3     64050.00      1
             61245.31    64470.84      1
             73814.77    77702.28      1
             74683.56    76755.00      1
             102737.01   110965.80     1
             103091.19   112720.20     1
             117794.04   125309.52     1
             164191.04   176548.92     1
             177425.24   189255.90     1
             252605.82   263817.90     1
             407644.84   429113.76     1
             476297.64   516026.16     1
             679736.68   715535.52     1
Japan        0           2853.84       1
             1330        1330.00       1
             5263.2      5263.20       1
             6513.21     7236.90       1
             10214.4     10640.00      1
             11929.75    15190.00      1
             12368.4     13158.00      1
             24066.1     25877.40      1
             25672.5     27965.00      1
             29164.85    31359.90      1
             29666.8     32456.40      1
             29682.52    30263.40      1
             36560.65    45185.00      1
             38484.16    41380.68      1
             42299.25    50820.00      1
             44573.3     45833.70      1
             46946.9     49942.20      1
             48654.06    51758.28      1
             51879.83    54612.12      1
             55453.5     58374.00      1
             55822.59    59649.60      1
             59520.09    62654.76      1
             60968.6     70280.00      1
             73469.76    78999.48      1
             76727.04    82501.92      1
             84382.48    100533.00     1
             102515.7    108535.00     1
             122192.7    128065.00     1
             135837.15   150659.10     1
             182543.98   201756.00     1
             292210.32   312283.20     1
             292310.72   314311.56     1
             363683.55   380046.90     1
             419827.2    451425.60     1
             526192.1    553904.40     1
             898819.74   1005200.28    1
             1147887.45  1208341.80    1
Korea        2240        2240.00       1
             38131.8     46375.00      1
             41020.23    45395.10      1
             44346.05    46375.00      1
             61851.64    67763.70      1
             70499.88    75000.60      1
             74554.15    78480.60      1
             76381.55    90475.00      1
             107731.52   115839.96     1
             110226.2    116725.00     1
             133036.54   141524.52     1
             150863.67   166448.70     1
             233649.2    250879.20     1
             296718.4    308774.40     1
             505807.12   580756.44     1
             513499.41   540543.24     1
             811962.47   854725.08     1
Mexico       27848.45    31885.00      1
             33055.36    35543.28      1
             35168       44870.00      1
             35750.4     37240.00      1
             47556.6     50590.80      1
             50912.4     53760.00      1
             57222.11    65790.00      1
             76889.15    82676.10      1
             139743.24   159036.72     1
             141824.32   150878.40     1
             342947.86   357239.70     1
             445846.14   469326.96     1
             734450.8    773131.20     1
Netherlands  12282.55    12635.00      1
             14049       15610.00      1
             15908.1     17105.40      1
             16614.07    17982.60      1
             32245.5     34545.00      1
             39049.5     47670.00      1
             39566.3     42544.20      1
             39625.25    48650.00      1
             42706.56    45920.88      1
             44751.98    52796.04      1
             45763.08    48684.60      1
             50980.89    55921.50      1
             76212.5     81075.00      1
             80472       83825.00      1
             90621.65    102193.80     1
             159003.52   170970.96     1
             171569.58   192893.64     1
             173666.71   186405.00     1
             221321.1    240760.32     1
             271440      291870.00     1
             333473.72   346932.60     1
             479611.16   504870.24     1
             513869.1    540932.40     1
Singapore    5364.1      5530.00       1
             15523.2     16170.00      1
             20234.2     20860.00      1
             21042.34    22149.30      1
             26482.76    29824.80      1
             28007       34370.00      1
             37057.65    47845.00      1
             42052.56    44737.20      1
             51030.72    54871.56      1
             55970.46    59541.48      1
             65875.85    70833.90      1
             95305.6     102478.80     1
             110721.52   117785.76     1
             111692      118475.00     1
             119032.1    132895.80     1
             120354.78   128033.64     1
             212469.31   227852.70     1
             260445.52   271054.80     1
             410725.59   432356.76     1
             454226.5    525495.72     1
             662607.71   697504.44     1
Spain        3734.5      3850.00       1
             4725        4725.00       1
             8158        8772.00       1
             8467.2      8820.00       1
             8965.25     12635.00      1
             11710.3     14840.00      1
             18233.25    21210.00      1
             19375.25    20833.50      1
             19377.16    20614.20      1
             21459.02    22587.90      1
             26006.4     27090.00      1
             31004.48    33338.04      1
             31363.85    36225.00      1
             52003.06    54741.84      1
             55576.73    58503.72      1
             55721.99    64254.90      1
             59716.8     64211.40      1
             65060.05    69956.70      1
             70144.83    75658.50      1
             77733.6     82705.00      1
             158868.3    169738.20     1
             275059.2    295761.60     1
             291674.3    303291.90     1
             383738.22   403948.08     1
             551823.94   580886.16     1
             555314.76   628363.68     1
Sweden       3571.75     5495.00       1
             5880        5880.00       1
             8611.75     9065.00       1
             10401.45    11184.30      1
             10584       11760.00      1
             28179.97    30921.30      1
             34143.2     39305.16      1
             34265.14    36451.32      1
             42021.43    44234.52      1
             46167.24    50439.00      1
             77388.44    81464.16      1
             99741.11    106360.50     1
             102061.44   109743.12     1
             103513.2    108964.80     1
             121001.92   130109.16     1
             131439.82   136623.90     1
             188031.48   219875.40     1
             216268.65   227658.60     1
Switzerland  5839.4      6020.00       1
             8047.55     12250.00      1
             20335.35    25375.00      1
             21827.26    23219.88      1
             41916.82    44517.90      1
             48620.64    51974.10      1
             87294.36    91667.40      1
             188418.67   198341.88     1
             229125.26   260996.64     1
             337034.05   354784.20     1
United       Kingdom     0.00          1
                         18114.95      1
                         43366.75      1
                         55798.30      1
                         67328.10      1
                         69760.25      1
                         114823.85     1
                         153011.60     1
                         192116.28     1
                         225984.76     1
                         306425.60     1
                         393437.50     1
                         476648.64     1
                         647820.11     1
                         770310.73     1
                         804438.18     1
             States      840.00        1
                         6051.50       1
                         10877.28      1
                         13647.90      1
                         16699.20      1
                         17083.88      1
                         20407.86      1
                         27115.20      1
                         35895.20      1
                         37338.69      1
                         50483.16      1
                         65359.84      1
                         88718.70      1
                         93408.34      1
                         94512.60      1
                         105924.35     1
                         123891.04     1
                         124946.50     1
                         152085.69     1
                         300460.16     1
                         368517.74     1
                         407822.95     1
                         431585.35     1
                         689609.55     1
                         749656.96     1
                         865350.72     1
                         1108588.10    1
                         1332682.26    1
                         1593610.36    1
                         2091213.10    1
Name: Year, dtype: int64

In [281]:
temp2 = copy.deepcopy(temp1[temp1["Revenue"].isin(["Kingdom", "States"])])
temp2.head()

,Year,country,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
735,2004,United,States,865351,930482,610494,7173.0,85.11,129.72,254856.69,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone
750,2004,United,Kingdom,306426,329489,216179,2540.0,85.11,129.72,90246.20,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone
777,2004,United,States,749657,806080,528874,6214.0,85.11,129.72,220783.42,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Web
792,2004,United,Kingdom,476649,512524,336270,3951.0,85.11,129.72,140379.03,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Web
798,2004,United,States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Special

In [282]:
temp2.groupby(["country", "Revenue", "Planned"])["Year"].count()

country  Revenue  Planned
United   Kingdom  0.00          1
                  18114.95      1
                  43366.75      1
                  55798.30      1
                  67328.10      1
                  69760.25      1
                  114823.85     1
                  153011.60     1
                  192116.28     1
                  225984.76     1
                  306425.60     1
                  393437.50     1
                  476648.64     1
                  647820.11     1
                  770310.73     1
                  804438.18     1
         States   840.00        1
                  6051.50       1
                  10877.28      1
                  13647.90      1
                  16699.20      1
                  17083.88      1
                  20407.86      1
                  27115.20      1
                  35895.20      1
                  37338.69      1
                  50483.16      1
                  65359.84      1
                  88718.70      1
                  93408.34      1
                  94512.60      1
                  105924.35     1
                  123891.04     1
                  124946.50     1
                  152085.69     1
                  300460.16     1
                  368517.74     1
                  407822.95     1
                  431585.35     1
                  689609.55     1
                  749656.96     1
                  865350.72     1
                  1108588.10    1
                  1332682.26    1
                  1593610.36    1
                  2091213.10    1
Name: Year, dtype: int64

In [283]:
temp2["Retailer country"] = temp2["country"] + " " + temp2["Revenue"]
temp2 = temp2.drop(["country", "Revenue"], axis=1)

temp2["Revenue"] = temp2["Planned"]
temp2 = temp2.drop(["Planned"], axis=1)

temp2["Planned revenue"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Product cost"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Unit cost"] = temp2["Quantity"]
temp2 = temp2.drop(["Quantity"], axis=1)

temp2["Unit price"] = temp2["Unit"]
temp2 = temp2.drop(["Unit"], axis=1)

temp2["Quantity"] = temp2["cost"]
temp2 = temp2.drop(["cost"], axis=1)

temp2["Gross profit"] = temp2["cost.1"]
temp2 = temp2.drop(["cost.1"], axis=1)

temp2["Unit sale price"] = temp2["Unit.1"]
temp2 = temp2.drop(["Unit.1", "price", "Gross", "profit", "Unit.2", "sale", "price.1"], axis=1)

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Unit cost,Unit price,Quantity,Gross profit,Unit sale price
735,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone,United States,865351,930482,610494,85.11,129.72,7173.0,254856.69,120.64
750,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone,United Kingdom,306426,329489,216179,85.11,129.72,2540.0,90246.20,120.64
777,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Web,United States,749657,806080,528874,85.11,129.72,6214.0,220783.42,120.64
792,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Web,United Kingdom,476649,512524,336270,85.11,129.72,3951.0,140379.03,120.64
798,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Special,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [284]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]
temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
735,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone,United States,865351,930482,610494,7173.0,85.11,129.72,254856.69,120.64
750,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone,United Kingdom,306426,329489,216179,2540.0,85.11,129.72,90246.20,120.64
777,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Web,United States,749657,806080,528874,6214.0,85.11,129.72,220783.42,120.64
792,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Web,United Kingdom,476649,512524,336270,3951.0,85.11,129.72,140379.03,120.64
798,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Special,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [285]:
str11 = temp2

In [286]:
temp2 = copy.deepcopy(temp1[~temp1["Revenue"].isin(["Kingdom", "States"])])
temp2.head()

,Year,country,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
736,2004,Canada,67799.7,72902.6,47831.8,562,85.11,129.72,19967.86,120.64,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone
737,2004,Mexico,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone
738,2004,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone
739,2004,Japan,419827,451426,296183,3480,85.11,129.72,123644.40,120.64,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone
740,2004,Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone

In [287]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp2.groupby(["country", "Revenue", "Planned"])["Year"].count())

country      Revenue     Planned
Australia    2485.00     2485.00       1
             3118.50     5670.00       1
             10977.75    14490.00      1
             19178.60    21385.00      1
             27004.34    28728.30      1
             28412.02    30224.76      1
             39013.17    41886.30      1
             56458.22    76794.24      1
             116330.76   131276.64     1
             141837.73   149307.72     1
             164434.36   171492.60     1
             411588.20   433264.80     1
             513252.95   540283.80     1
Austria      3549.00     5460.00       1
             15430.80    16660.00      1
             19467.00    24885.00      1
             28214.20    30275.00      1
             29506.89    32017.80      1
             38414.87    41228.40      1
             53926.08    57984.84      1
             57834.12    63816.30      1
             64323.00    67445.00      1
             118281.80   131276.64     1
             118736.64   126316.80     1
             178520.16   205606.20     1
             179391.68   192893.64     1
             195498.57   203510.40     1
             295259.08   310809.12     1
             389160.34   409655.76     1
Belgium      3393.60     3535.00       1
             4254.40     4386.00       1
             20763.75    25095.00      1
             23162.88    24906.24      1
             31831.80    33390.00      1
             36106.39    38007.96      1
             41826.40    49385.00      1
             51147.42    54605.70      1
             88067.20    94695.60      1
             162949.78   174562.80     1
             172734.65   179606.70     1
             294519.70   310030.80     1
             322409.36   365291.52     1
             349110.59   367496.76     1
Brazil       23390.50    28525.00      1
             29097.60    30310.00      1
             38866.45    45535.00      1
             51373.47    59211.00      1
             62231.40    66255.00      1
             64542.40    69400.20      1
             87902.45    94518.30      1
             154971.83   165790.80     1
             201167.56   209212.20     1
             282780.16   304063.68     1
             305240.71   321316.44     1
             365332.24   422627.76     1
             382875.61   403040.04     1
Canada       3920.00     3920.00       1
             4072.25     6265.00       1
             4893.00     7350.00       1
             7852.95     10255.00      1
             7862.40     8190.00       1
             10809.35    11622.90      1
             23230.20    25025.00      1
             27289.80    30263.40      1
             33126.06    34868.70      1
             34012.65    35035.00      1
             36460.06    38786.28      1
             36780.45    40110.00      1
             40670.35    43925.00      1
             49784.92    52406.88      1
             65060.05    69956.70      1
             67799.68    72902.64      1
             68885.44    74070.12      1
             80728.05    85746.30      1
             108282.72   118045.20     1
             137647.91   144897.24     1
             183283.45   192605.00     1
             203934.55   222808.80     1
             221133.12   237776.76     1
             240668.19   253343.16     1
             245833.16   262721.40     1
             385340.02   402854.10     1
             400374.27   421460.28     1
             421878.08   453630.84     1
             662987.78   731361.36     1
             751210.08   790773.12     1
China        33751.08    35526.60      1
             46908.50    50439.00      1
             53390.26    56798.70      1
             55953.10    68215.00      1
             71418.88    76794.24      1
             73773.70    83928.84      1
             78316.80    84211.20      1
             90729.80    104020.00     1
             101832.82   103728.90     1
             111153.85   120834.30     1
             198306.68   210966.60     1
             205044.05   229826.40     1
             234850.00   250005.00     1
             248976.96   261405.60     1
             735683.10   774428.40     1
             746638.62   810620.28     1
             770648.32   828651.36     1
             1149612.67  1210157.88    1
Denmark      0.00        5967.12       1
             8662.50     9625.00       1
             9381.70     10087.80      1
             20724.90    27195.00      1
             24007.36    25814.28      1
             28109.12    30224.76      1
             34098.75    38675.00      1
             34837.66    37061.70      1
             36845.77    38786.28      1
             58781.28    66228.60      1
             61898.40    64035.60      1
             67714.85    71050.00      1
             142577.11   150086.04     1
             181641.02   191207.28     1
Finland      21302.40    22190.00      1
             39331.60    47530.00      1
             43430.40    46699.20      1
             52501.75    63455.00      1
             70795.20    74900.00      1
             146330.74   160746.90     1
             244421.01   261844.20     1
             325052.64   338599.20     1
             344427.20   370350.60     1
             534584.96   610073.16     1
             544553.37   573232.68     1
             666551.07   701655.48     1
France       3945.90     3990.00       1
             5027.75     7735.00       1
             8434.65     11235.00      1
             8769.85     9429.90       1
             23750.76    25000.20      1
             34952.75    41615.00      1
             36303.10    39035.40      1
             38939.25    44485.00      1
             46581.08    49553.04      1
             53842.80    57895.20      1
             56901.60    61320.00      1
             91066.97    95863.08      1
             93438.45    98910.00      1
             117744.64   126606.72     1
             126329.84   150215.76     1
             132596.43   141229.20     1
             133981.85   149124.00     1
             177403.63   190791.00     1
             195195.52   209886.96     1
             275059.20   295761.60     1
             284755.10   296493.60     1
             503517.78   530035.92     1
             596652.42   672338.76     1
             633278.97   666631.08     1
Germany      1365.00     1365.00       1
             3640.00     5600.00       1
             6475.00     6475.00       1
             13261.50    14735.00      1
             14710.50    16345.00      1
             25750.40    26316.00      1
             25892.65    34965.00      1
             35220.50    44135.00      1
             35950.72    38656.56      1
             37092.23    39045.72      1
             40296.21    42418.44      1
             46882.85    50330.00      1
             49605.88    54167.10      1
             59018.96    74459.28      1
             59140.90    82242.48      1
             64903.45    69298.80      1
             65034.56    67544.40      1
             87739.76    92360.64      1
             102650.59   108056.76     1
             194844.30   205310.00     1
             211964.48   227918.04     1
             223175.93   246931.80     1
             245449.81   263160.00     1
             256671.48   267765.30     1
             267217.60   287329.80     1
             459469.92   503832.48     1
             502285.48   528738.72     1
             716459.22   754192.08     1
Italy        2310.00     2310.00       1
             4947.25     8995.00       1
             19359.90    20860.00      1
             22230.55    23903.70      1
             28248.50    31430.00      1
             36153.60    37660.00      1
             54053.30    64050.00      1
             61245.31    64470.84      1
             73814.77    77702.28      1
             74683.56    76755.00      1
             102737.01   110965.80     1
             103091.19   112720.20     1
             117794.04   125309.52     1
             164191.04   176548.92     1
             177425.24   189255.90     1
             252605.82   263817.90     1
             407644.84   429113.76     1
             476297.64   516026.16     1
             679736.68   715535.52     1
Japan        0.00        2853.84       1
             1330.00     1330.00       1
             5263.20     5263.20       1
             6513.21     7236.90       1
             10214.40    10640.00      1
             11929.75    15190.00      1
             12368.40    13158.00      1
             24066.10    25877.40      1
             25672.50    27965.00      1
             29164.85    31359.90      1
             29666.80    32456.40      1
             29682.52    30263.40      1
             36560.65    45185.00      1
             38484.16    41380.68      1
             42299.25    50820.00      1
             44573.30    45833.70      1
             46946.90    49942.20      1
             48654.06    51758.28      1
             51879.83    54612.12      1
             55453.50    58374.00      1
             55822.59    59649.60      1
             59520.09    62654.76      1
             60968.60    70280.00      1
             73469.76    78999.48      1
             76727.04    82501.92      1
             84382.48    100533.00     1
             102515.70   108535.00     1
             122192.70   128065.00     1
             135837.15   150659.10     1
             182543.98   201756.00     1
             292210.32   312283.20     1
             292310.72   314311.56     1
             363683.55   380046.90     1
             419827.20   451425.60     1
             526192.10   553904.40     1
             898819.74   1005200.28    1
             1147887.45  1208341.80    1
Korea        2240.00     2240.00       1
             38131.80    46375.00      1
             41020.23    45395.10      1
             44346.05    46375.00      1
             61851.64    67763.70      1
             70499.88    75000.60      1
             74554.15    78480.60      1
             76381.55    90475.00      1
             107731.52   115839.96     1
             110226.20   116725.00     1
             133036.54   141524.52     1
             150863.67   166448.70     1
             233649.20   250879.20     1
             296718.40   308774.40     1
             505807.12   580756.44     1
             513499.41   540543.24     1
             811962.47   854725.08     1
Mexico       27848.45    31885.00      1
             33055.36    35543.28      1
             35168.00    44870.00      1
             35750.40    37240.00      1
             47556.60    50590.80      1
             50912.40    53760.00      1
             57222.11    65790.00      1
             76889.15    82676.10      1
             139743.24   159036.72     1
             141824.32   150878.40     1
             342947.86   357239.70     1
             445846.14   469326.96     1
             734450.80   773131.20     1
Netherlands  12282.55    12635.00      1
             14049.00    15610.00      1
             15908.10    17105.40      1
             16614.07    17982.60      1
             32245.50    34545.00      1
             39049.50    47670.00      1
             39566.30    42544.20      1
             39625.25    48650.00      1
             42706.56    45920.88      1
             44751.98    52796.04      1
             45763.08    48684.60      1
             50980.89    55921.50      1
             76212.50    81075.00      1
             80472.00    83825.00      1
             90621.65    102193.80     1
             159003.52   170970.96     1
             171569.58   192893.64     1
             173666.71   186405.00     1
             221321.10   240760.32     1
             271440.00   291870.00     1
             333473.72   346932.60     1
             479611.16   504870.24     1
             513869.10   540932.40     1
Singapore    5364.10     5530.00       1
             15523.20    16170.00      1
             20234.20    20860.00      1
             21042.34    22149.30      1
             26482.76    29824.80      1
             28007.00    34370.00      1
             37057.65    47845.00      1
             42052.56    44737.20      1
             51030.72    54871.56      1
             55970.46    59541.48      1
             65875.85    70833.90      1
             95305.60    102478.80     1
             110721.52   117785.76     1
             111692.00   118475.00     1
             119032.10   132895.80     1
             120354.78   128033.64     1
             212469.31   227852.70     1
             260445.52   271054.80     1
             410725.59   432356.76     1
             454226.50   525495.72     1
             662607.71   697504.44     1
Spain        3734.50     3850.00       1
             4725.00     4725.00       1
             8158.00     8772.00       1
             8467.20     8820.00       1
             8965.25     12635.00      1
             11710.30    14840.00      1
             18233.25    21210.00      1
             19375.25    20833.50      1
             19377.16    20614.20      1
             21459.02    22587.90      1
             26006.40    27090.00      1
             31004.48    33338.04      1
             31363.85    36225.00      1
             52003.06    54741.84      1
             55576.73    58503.72      1
             55721.99    64254.90      1
             59716.80    64211.40      1
             65060.05    69956.70      1
             70144.83    75658.50      1
             77733.60    82705.00      1
             158868.30   169738.20     1
             275059.20   295761.60     1
             291674.30   303291.90     1
             383738.22   403948.08     1
             551823.94   580886.16     1
             555314.76   628363.68     1
Sweden       3571.75     5495.00       1
             5880.00     5880.00       1
             8611.75     9065.00       1
             10401.45    11184.30      1
             10584.00    11760.00      1
             28179.97    30921.30      1
             34143.20    39305.16      1
             34265.14    36451.32      1
             42021.43    44234.52      1
             46167.24    50439.00      1
             77388.44    81464.16      1
             99741.11    106360.50     1
             102061.44   109743.12     1
             103513.20   108964.80     1
             121001.92   130109.16     1
             131439.82   136623.90     1
             188031.48   219875.40     1
             216268.65   227658.60     1
Switzerland  5839.40     6020.00       1
             8047.55     12250.00      1
             20335.35    25375.00      1
             21827.26    23219.88      1
             41916.82    44517.90      1
             48620.64    51974.10      1
             87294.36    91667.40      1
             188418.67   198341.88     1
             229125.26   260996.64     1
             337034.05   354784.20     1
Name: Year, dtype: int64

In [288]:
temp2["Retailer country"] = temp2["country"]
temp2 = temp2.drop(["country"], axis=1)

temp2["Revenue"] = temp2["Revenue"]

temp2["Planned revenue"] = temp2["Planned"]
temp2 = temp2.drop(["Planned"], axis=1)

temp2["Product cost"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Unit cost"] = temp2["cost"]
temp2 = temp2.drop(["cost"], axis=1)

temp2["Unit price"] = temp2["Quantity"]
temp2 = temp2.drop(["Quantity"], axis=1)

temp2["Quantity"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Gross profit"] = temp2["Unit"]
temp2 = temp2.drop(["Unit"], axis=1)

temp2["Unit sale price"] = temp2["cost.1"]
temp2 = temp2.drop(["cost.1","Unit.1", "price", "Gross", "profit", "Unit.2", "sale", "price.1"], axis=1)

temp2.head()

,Year,Revenue,Product line,Product type,Product,Order method type,Retailer country,Planned revenue,Product cost,Unit cost,Unit price,Quantity,Gross profit,Unit sale price
736,2004,67799.7,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone,Canada,72902.6,47831.8,85.11,129.72,562,19967.86,120.64
737,2004,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone,Mexico,NaN,NaN,NaN,NaN,NaN,NaN,NaN
738,2004,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN
739,2004,419827,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone,Japan,451426,296183,85.11,129.72,3480,123644.40,120.64
740,2004,NaN,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone,Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [289]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]
temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
736,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone,Canada,67799.7,72902.6,47831.8,562,85.11,129.72,19967.86,120.64
737,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone,Mexico,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
738,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
739,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone,Japan,419827,451426,296183,3480,85.11,129.72,123644.40,120.64
740,2004,Camping Equipment,Cooking Gear,TrailChef Deluxe Cook Set,Telephone,Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [290]:
str12 = temp2

In [300]:
temp = copy.deepcopy(tmp3[~tmp3.index.isin(tmp4.index.values)])
temp.head()

,Year,Product.2,Order,method,type.1,Retailer,country,Revenue,Planned,revenue,...,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type
0,2004,TrailChef,Water,Bag,Telephone,United,States,315044,437477,158372,...,5.195714,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
1,2004,TrailChef,Water,Bag,Telephone,Canada,13444.7,14313.5,6298.8,2172,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
2,2004,TrailChef,Water,Bag,Telephone,Mexico,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
3,2004,TrailChef,Water,Bag,Telephone,Brazil,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
4,2004,TrailChef,Water,Bag,Telephone,Japan,181120,235237,89413.1,35696,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear

In [301]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp.groupby(["Product.2", "Order", "method", "type.1", ])["Year"].count())

Product.2   Order         method    type.1
BugShield   Lotion        Lite      E-mail       63
                                    Fax          63
                                    Mail         63
                                    Sales        63
                                    Special      63
                                    Telephone    63
                                    Web          63
Compact     Relief        Kit       E-mail       63
                                    Fax          63
                                    Mail         63
                                    Sales        63
                                    Special      63
                                    Telephone    63
                                    Web          63
Course      Pro           Gloves    E-mail       63
                                    Fax          63
                                    Mail         63
                                    Sales        63
                                    Special      63
                                    Telephone    63
                                    Web          63
                          Umbrella  E-mail       63
                                    Fax          63
                                    Mail         63
                                    Sales        63
                                    Special      63
                                    Telephone    63
                                    Web          63
Firefly     Climbing      Lamp      E-mail       63
                                    Fax          63
                                    Mail         63
                                    Sales        63
                                    Special      63
                                    Telephone    63
                                    Web          63
            Rechargeable  Battery   E-mail       63
                                    Fax          63
                                    Mail         63
                                    Sales        63
                                    Special      63
                                    Telephone    63
                                    Web          63
Granite     Chalk         Bag       E-mail       63
                                    Fax          63
                                    Mail         63
                                    Sales        63
                                    Special      63
                                    Telephone    63
                                    Web          63
Hibernator  Camp          Cot       E-mail       63
                                    Fax          63
                                    Mail         63
                                    Sales        63
                                    Special      63
                                    Telephone    63
                                    Web          63
Insect      Bite          Relief    E-mail       63
                                    Fax          63
                                    Mail         63
                                    Sales        63
                                    Special      63
                                    Telephone    63
                                    Web          63
TrailChef   Cook          Set       E-mail       84
                                    Fax          84
                                    Mail         84
                                    Sales        84
                                    Special      84
                                    Telephone    84
                                    Web          84
            Double        Flame     E-mail       84
                                    Fax          84
                                    Mail         84
                                    Sales        84
                                    Special      84
                                    Telephone    84
                                    Web          84
            Kitchen       Kit       E-mail       84
                                    Fax          84
                                    Mail         84
                                    Sales        84
                                    Special      84
                                    Telephone    84
                                    Web          84
            Single        Flame     E-mail       84
                                    Fax          84
                                    Mail         84
                                    Sales        84
                                    Special      84
                                    Telephone    84
                                    Web          84
            Water         Bag       E-mail       84
                                    Fax          84
                                    Mail         84
                                    Sales        84
                                    Special      84
                                    Telephone    84
                                    Web          84
Name: Year, dtype: int64

In [302]:
temp["Product"] = temp["Product.2"] + " " + temp["Order"] + " " + temp["method"]
temp = temp.drop(["Product.2", "Order", "method"], axis=1)
temp.head()

,Year,type.1,Retailer,country,Revenue,Planned,revenue,Product.3,cost,Quantity,...,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
0,2004,Telephone,United,States,315044,437477,158372,66385,2.552857,6.59,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag
1,2004,Telephone,Canada,13444.7,14313.5,6298.8,2172,2.9,6.590000,7145.88,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag
2,2004,Telephone,Mexico,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag
3,2004,Telephone,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag
4,2004,Telephone,Japan,181120,235237,89413.1,35696,2.657,6.590000,91707.18,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag

In [306]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp.groupby(["type.1", "Retailer"])["Year"].count())

type.1     Retailer
E-mail     Australia       47
           Austria         47
           Belgium         47
           Brazil          47
           Canada          47
           China           47
           Denmark         47
           Finland         47
           France          47
           Germany         47
           Italy           47
           Japan           47
           Korea           47
           Mexico          47
           Netherlands     47
           Singapore       47
           Spain           47
           Sweden          47
           Switzerland     47
           United          94
Fax        Australia       47
           Austria         47
           Belgium         47
           Brazil          47
           Canada          47
           China           47
           Denmark         47
           Finland         47
           France          47
           Germany         47
           Italy           47
           Japan           47
           Korea           47
           Mexico          47
           Netherlands     47
           Singapore       47
           Spain           47
           Sweden          47
           Switzerland     47
           United          94
Mail       Australia       47
           Austria         47
           Belgium         47
           Brazil          47
           Canada          47
           China           47
           Denmark         47
           Finland         47
           France          47
           Germany         47
           Italy           47
           Japan           47
           Korea           47
           Mexico          47
           Netherlands     47
           Singapore       47
           Spain           47
           Sweden          47
           Switzerland     47
           United          94
Sales      visit          987
Special    Australia       47
           Austria         47
           Belgium         47
           Brazil          47
           Canada          47
           China           47
           Denmark         47
           Finland         47
           France          47
           Germany         47
           Italy           47
           Japan           47
           Korea           47
           Mexico          47
           Netherlands     47
           Singapore       47
           Spain           47
           Sweden          47
           Switzerland     47
           United          94
Telephone  Australia       47
           Austria         47
           Belgium         47
           Brazil          47
           Canada          47
           China           47
           Denmark         47
           Finland         47
           France          47
           Germany         47
           Italy           47
           Japan           47
           Korea           47
           Mexico          47
           Netherlands     47
           Singapore       47
           Spain           47
           Sweden          47
           Switzerland     47
           United          94
Web        Australia       47
           Austria         47
           Belgium         47
           Brazil          47
           Canada          47
           China           47
           Denmark         47
           Finland         47
           France          47
           Germany         47
           Italy           47
           Japan           47
           Korea           47
           Mexico          47
           Netherlands     47
           Singapore       47
           Spain           47
           Sweden          47
           Switzerland     47
           United          94
Name: Year, dtype: int64

In [307]:
temp1 = copy.deepcopy(temp[temp["Retailer"] == "visit"])
temp1.head()

,Year,type.1,Retailer,country,Revenue,Planned,revenue,Product.3,cost,Quantity,...,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
21,2004,Sales,visit,United,States,181288,222735,88348.1,33799.00,2.72,...,5.652222,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag
22,2004,Sales,visit,Canada,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag
23,2004,Sales,visit,Mexico,133617,169943,65215.1,25788,2.72,6.59,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag
24,2004,Sales,visit,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag
25,2004,Sales,visit,Japan,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag

In [308]:
temp1.groupby(["type.1", "Retailer", "country"])["Year"].count()

type.1  Retailer  country
Sales   visit     Australia      47
                  Austria        47
                  Belgium        47
                  Brazil         47
                  Canada         47
                  China          47
                  Denmark        47
                  Finland        47
                  France         47
                  Germany        47
                  Italy          47
                  Japan          47
                  Korea          47
                  Mexico         47
                  Netherlands    47
                  Singapore      47
                  Spain          47
                  Sweden         47
                  Switzerland    47
                  United         94
Name: Year, dtype: int64

In [309]:
temp1["Order method type"] = temp1["type.1"] + " " + temp1["Retailer"]
temp1 = temp1.drop(["type.1", "Retailer"], axis=1)
temp1.head()

,Year,country,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
21,2004,United,States,181288,222735,88348.1,33799.00,2.72,6.59,92939.600000,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit
22,2004,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit
23,2004,Mexico,133617,169943,65215.1,25788,2.72,6.59,68402.21,5.723333,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit
24,2004,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit
25,2004,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit

In [311]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp1.groupby(["country", "Revenue", "Planned"])["Year"].count())

country      Revenue    Planned
Australia    0          1191.33      1
             1886       1886.00      1
             1956       1956.00      1
             2790       2790.00      1
             4104       4104.00      1
             7521       7521.00      1
             7602.86    7758.06      1
             8057       8057.00      1
             8785       8785.00      1
             12714.48   12870.00     1
             18805.5    19181.61     1
             24850.6    32215.68     1
             27674.11   31552.11     1
             29500.6    30884.91     1
             30713.22   31882.42     1
             32669.14   34755.33     1
             33784.24   35941.12     1
             35259.84   35985.60     1
             36652      38520.00     1
             37295.9    62222.78     1
             45371.54   52360.65     1
             64072.99   65640.40     1
             64221.22   67598.56     1
             82051.2    84592.20     1
             82205.28   86533.92     1
             84977.04   90406.58     1
             87539.04   90249.99     1
Austria      0          153.72       1
                        512.40       1
                        522.40       1
                        768.60       1
             126        126.00       1
             300        300.00       1
             770        770.00       1
             1771       1771.00      1
             2438       2438.00      1
             9883.33    10189.00     1
             11368.89   12224.16     1
             12233.36   12743.76     1
             12562.35   13507.53     1
             13266      13266.00     1
             15338.7    16492.19     1
             28053.72   29846.19     1
             30890.41   32516.99     1
             33744.04   34438.60     1
             42203.14   58216.06     1
             42677.28   62730.06     1
             48292.56   51822.08     1
             48824.95   55226.19     1
             57239.46   60252.69     1
             64227.73   84925.33     1
             67892.96   68768.00     1
             111834.72  115298.07    1
             113235.16  128397.42    1
             140624.31  148029.09    1
             167938.56  173139.36    1
Belgium      313.44     626.88       1
             816        816.00       1
             1296       1296.00      1
             2275.62    2346.00      1
             2499       2499.00      1
             3948       3948.00      1
             7434       7434.00      1
             9439.2     10149.04     1
             9548.68    9660.00      1
             12791.86   13185.20     1
             12843.9    13245.90     1
             13807.82   14232.40     1
             13973.85   15025.23     1
             20376.16   20792.00     1
             22508.28   22932.00     1
             22573.44   23034.24     1
             22985.41   23455.11     1
             36172.78   39549.60     1
             39882.06   44548.86     1
             51281.44   53552.00     1
             59060.34   74625.16     1
             66347.78   69841.42     1
             69041.63   73971.84     1
             75884.83   87571.29     1
             81274.2    86467.15     1
             82767.22   87723.06     1
Brazil       25415.86   26476.26     1
Canada       1449       1449.00      1
             4163       4209.00      1
             6205.5     6329.61      1
             10178.28   10386.00     1
             10899.99   11237.19     1
             13362.25   13770.75     1
             13596.72   14313.48     1
             13997.04   14368.00     1
             15948      15948.00     1
             31882.08   33919.16     1
             37073.74   37830.54     1
             44384.64   45168.00     1
             59601.31   62249.14     1
             64788.48   66794.88     1
             68687.92   72300.16     1
             73387.62   77250.93     1
             104786.36  110304.04    1
China        1878       1878.00      1
             2645       2645.00      1
             5705       5705.00      1
             8085       8246.70      1
             11249.1    11597.10     1
             17057.88   17406.00     1
             17107.86   17457.00     1
             26839.84   28574.24     1
             33650.82   37389.80     1
             38861.99   41030.43     1
             46114.64   48216.00     1
             47533.64   50568.32     1
             53217.77   56020.03     1
             53898.18   56732.64     1
             65433.72   68882.22     1
             102470.29  145698.31    1
             114181.45  118928.60    1
             129536.64  137813.28    1
             136502.34  142815.57    1
Denmark      768        768.00       1
             3960       3960.00      1
             4456.02    4508.00      1
             5817       5817.00      1
             7546       7546.00      1
             7673.4     7830.00      1
             8504.23    8677.83      1
             10795.68   11016.00     1
             12469.92   13127.28     1
             13177.3    13871.95     1
             14023.68   20033.64     1
             14337.45   14926.35     1
             15660.81   16314.21     1
             18033.29   18587.80     1
             21277.76   23000.00     1
             22256.01   27153.21     1
             27394.2    28836.30     1
             27401.94   29463.36     1
             27758.88   28618.53     1
             27894.17   29057.97     1
             28388.36   29881.28     1
             36248.78   37247.00     1
             36949.5    39728.15     1
             44300.58   46896.93     1
             73554.72   78254.44     1
Finland      1368       1368.00      1
             2610       2610.00      1
             2877       2877.00      1
             8061.48    8226.00      1
             8942.1     10299.24     1
             14403.06   14697.00     1
             14535.08   15463.04     1
             15889.73   16916.53     1
             17028.81   17555.61     1
             17781.07   18331.00     1
             17817.41   25457.67     1
             24369.6    27672.00     1
             28606.27   29491.00     1
             31483.08   33851.52     1
             43465.5    54359.20     1
             52098      54264.00     1
             60973.24   75733.23     1
             72891.83   78361.69     1
             146051.82  157539.24    1
             191348.76  207454.39    1
France       532        532.00       1
             1398       1398.00      1
             1680       1680.00      1
             1887.48    1926.00      1
             1978       1978.00      1
             3995.37    4118.97      1
             4361.95    6049.00      1
             4605.3     4605.30      1
             5699.68    5816.00      1
             6376.59    6571.53      1
             6384       6511.68      1
             8439.97    9569.07      1
             9180       9180.00      1
             11478      11478.00     1
             13426      13426.00     1
             16432.62   16715.82     1
             21900.73   27910.26     1
             24255.3    25649.13     1
             25691.68   25904.00     1
             32162.73   33483.79     1
             38640.24   40674.36     1
             38887.12   40937.08     1
             45356.23   46759.00     1
             45820.8    47239.80     1
             47564.6    50740.41     1
             49543.65   53271.27     1
             50556.24   77913.57     1
             53027.48   55819.72     1
             55135.01   56042.00     1
             57769.32   60807.36     1
             59653.59   67449.20     1
             60515.4    61761.00     1
             86207.04   88876.74     1
             96009.15   114692.36    1
             101646.9   106997.85    1
             102236.61  111375.68    1
             132430.72  141719.40    1
             132727.54  140562.80    1
             154743.6   168839.68    1
             210080.16  221142.24    1
             265697.37  287111.00    1
Germany      750        750.00       1
             3615.72    3727.08      1
             3664.5     3737.79      1
             6378       6378.00      1
             6778.56    6831.00      1
             7159.68    7378.56      1
             11660.04   11898.00     1
             14749      14749.00     1
             19067.96   20073.14     1
             20041.02   21096.03     1
             21507.99   24134.88     1
             23532.32   23765.00     1
             24974.32   25894.40     1
             29516.67   32511.87     1
             35569.8    38246.04     1
             35807.55   36915.00     1
             39090.24   39888.00     1
             39427.2    40648.20     1
             41356.36   43534.04     1
             48832.08   49837.20     1
             52763.31   56732.64     1
             66653.28   68717.43     1
             73146.81   90744.30     1
             91345.04   96829.26     1
             137602.28  169692.50    1
             173509.78  182422.53    1
             185865.3   199842.61    1
             202903.08  215867.41    1
Italy        336        336.00       1
             3833.91    3951.99      1
             5076       5076.00      1
             6167.61    6358.41      1
             8272.16    8528.00      1
             12644.94   12903.00     1
             15744      17421.60     1
             15978.28   16469.60     1
             23860.06   24598.00     1
             29497.12   31052.08     1
             36533.38   38894.18     1
             44776.17   46161.00     1
             62961.29   68210.80     1
             74651.29   77858.01     1
             88781.84   94449.92     1
             98821.89   106256.16    1
             100357.65  107908.47    1
             103089.33  131865.90    1
             112654.2   119852.15    1
             113580.42  118319.22    1
             129995.86  139412.34    1
             200572.98  216935.73    1
Japan        258        258.00       1
             9136.4     9325.68      1
             18242.7    26061.00     1
             42768.88   43649.20     1
             52190.16   53264.40     1
             80612.64   88657.02     1
             84298.47   88737.33     1
             102858.06  108280.29    1
Korea        438        438.00       1
             6250.24    6511.68      1
             13579.68   13728.00     1
             16950.08   17296.00     1
             18047.82   18606.00     1
             22643.62   23724.12     1
             25119.36   25632.00     1
             27569.46   28417.20     1
             35646      37128.00     1
             51066.46   53726.58     1
             55967.67   65303.67     1
             58152.72   60216.00     1
             79622.3    82944.30     1
             84931.91   113802.71    1
             85639.12   92151.36     1
             87048.12   92609.99     1
             121061.65  125189.00    1
             160628.7   172714.26    1
             186539.97  205512.16    1
             186696.56  238492.10    1
             223747.84  239604.66    1
             407409.48  440147.84    1
Mexico       630        630.00       1
             4347       4347.00      1
             6237       6237.00      1
             6402       6402.00      1
             11169.25   11513.25     1
             11413.08   11646.00     1
             16814      16814.00     1
             17140.97   18318.30     1
             19521.9    19620.00     1
             19812.1    20335.00     1
             19880.28   20286.00     1
             20340      20340.00     1
             21374.61   27535.41     1
             25446.24   26233.44     1
             26178.92   26713.32     1
             31121.46   32985.75     1
             32623.92   33888.00     1
             33661.78   43696.80     1
             39649.5    41736.75     1
             40279.68   41527.08     1
             44089.18   46413.37     1
             47445.31   51009.42     1
             48115.42   50027.60     1
             48462.94   49718.20     1
             56689.71   58443.00     1
             59410.56   61248.00     1
             116013.47  122122.33    1
             126357.98  133003.04    1
             133045.3   144228.00    1
             133617.26  169942.92    1
             146031.63  178140.88    1
             147977.04  161944.00    1
             207041.99  237671.82    1
             211269.68  221972.13    1
             219597.56  234975.52    1
             253684.03  316341.87    1
             256629.6   277095.50    1
             267686.15  281533.35    1
             374991     398950.75    1
Netherlands  1794       1794.00      1
             2751.84    2808.00      1
             4950       4950.00      1
             6865.83    7078.23      1
             7308       7454.16      1
             9102.48    9384.00      1
             10620.49   10837.29     1
             12794.06   14209.28     1
             16323.03   17377.83     1
             26545.46   27234.06     1
             28168.8    29040.00     1
             29317.88   30541.08     1
             36424.8    36424.80     1
             39682.14   41774.01     1
             40668.48   43266.96     1
             60888.52   62141.80     1
             66387.07   69156.87     1
             118107.21  137048.31    1
             123054.2   129533.80    1
             127872     131832.00    1
Singapore    1671.68    3343.36      1
             6384       6511.68      1
             21020.7    21892.29     1
             21779.34   22236.00     1
             23133.44   23609.60     1
             25033.74   26353.41     1
             26263.72   27076.00     1
             30347.46   46770.57     1
             69722.89   72128.00     1
             89412.05   93129.40     1
             118193.46  161665.88    1
             154087.54  165613.95    1
             189314.4   207706.24    1
             208250.25  236305.89    1
             342187.02  369839.03    1
Spain        5564.98    5678.58      1
             5814       5814.00      1
             6983.03    7199.00      1
             13036.14   13878.54     1
             14309.44   14752.00     1
             24864.72   26175.48     1
             24902.1    26774.77     1
             40370.4    42495.60     1
             43277.36   45553.28     1
             44527.86   46872.54     1
             46266.86   47457.20     1
             47952      49437.00     1
             51619.96   54341.14     1
             87373.08   91972.62     1
             105975.35  109860.00    1
Sweden       732        732.00       1
             2960.1     5382.00      1
             17281.35   17639.37     1
             20050.52   21104.96     1
             20125.16   20539.40     1
             23587.59   37827.72     1
             38063.52   40067.28     1
             41927.23   44134.97     1
             49656.96   51194.76     1
Switzerland  0          5108.49      1
             1194       1194.00      1
             1652       1652.00      1
             2254       2254.00      1
             2268       2268.00      1
             4557       4557.00      1
             5281.5     5387.13      1
             7625.64    7782.60      1
             11407.95   12323.22     1
             17774.93   18667.71     1
             22059.54   23220.81     1
             22195.46   24030.40     1
             26554.98   28976.22     1
             28998.72   29131.20     1
             36869.76   38011.56     1
             53032.2    56420.65     1
             53889.86   77999.24     1
             60300.16   75205.08     1
             62841.43   63831.60     1
             96350.1    101763.52    1
             100663.41  105963.99    1
             107856.16  112167.06    1
United       Kingdom    1817.00      1
                        2910.60      1
                        5711.36      1
                        6090.03      1
                        6807.08      1
                        7284.96      1
                        9968.86      1
                        11637.34     1
                        12186.00     1
                        17428.34     1
                        18967.80     1
                        21201.79     1
                        21482.82     1
                        22361.57     1
                        25691.12     1
                        32133.12     1
                        37069.19     1
                        39000.96     1
                        48172.53     1
                        58248.72     1
                        72881.07     1
                        90822.90     1
                        109733.90    1
             States     1204.00      1
                        2136.00      1
                        3024.00      1
                        4305.00      1
                        5197.50      1
                        7268.00      1
                        15246.06     1
                        17481.38     1
                        18574.20     1
                        20160.88     1
                        22032.00     1
                        37189.44     1
                        38032.56     1
                        39246.20     1
                        40239.28     1
                        44846.39     1
                        47363.12     1
                        48107.48     1
                        53418.63     1
                        55097.36     1
                        62339.49     1
                        65635.98     1
                        66474.27     1
                        68503.92     1
                        69334.67     1
                        74314.61     1
                        82531.05     1
                        90288.06     1
                        96725.24     1
                        98760.51     1
                        113738.60    1
                        144180.00    1
                        163588.34    1
                        167825.52    1
                        174067.25    1
                        181287.73    1
                        186802.29    1
                        192573.48    1
                        204329.24    1
                        302116.23    1
                        327489.51    1
Name: Year, dtype: int64

In [312]:
temp2 = copy.deepcopy(temp1[temp1["Revenue"].isin(["Kingdom", "States"])])
temp2.head()

,Year,country,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
21,2004,United,States,181288,222735,88348.1,33799.0,2.72,6.59,92939.60,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit
36,2004,United,Kingdom,11637.3,12250.8,5391.1,1859.0,2.90,6.59,6246.24,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit
315,2004,United,States,96725.2,102887,68865.4,4323.0,15.93,23.80,27859.85,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Kitchen Kit,Sales visit
330,2004,United,Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Kitchen Kit,Sales visit
609,2004,United,States,302116,322549,205344,5872.0,34.97,54.93,96772.39,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Cook Set,Sales visit

In [313]:
temp2.groupby(["country", "Revenue", "Planned"])["Year"].count()

country  Revenue  Planned
United   Kingdom  1817.00      1
                  2910.60      1
                  5711.36      1
                  6090.03      1
                  6807.08      1
                              ..
         States   186802.29    1
                  192573.48    1
                  204329.24    1
                  302116.23    1
                  327489.51    1
Name: Year, Length: 64, dtype: int64

In [314]:
temp2.columns

Index(['Year', 'country', 'Revenue', 'Planned', 'revenue', 'Product.3', 'cost',
       'Quantity', 'Unit', 'cost.1', 'Unit.1', 'price', 'Gross', 'profit',
       'Unit.2', 'sale', 'price.1', 'Product line', 'Product type', 'Product',
       'Order method type'],
      dtype='object')

In [316]:
temp2["Retailer country"] = temp2["country"] + " " + temp2["Revenue"]
temp2 = temp2.drop(["country", "Revenue"], axis=1)

temp2["Revenue"] = temp2["Planned"]
temp2 = temp2.drop(["Planned"], axis=1)

temp2["Planned revenue"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Product cost"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Unit cost"] = temp2["Quantity"]
temp2 = temp2.drop(["Quantity"], axis=1)

temp2["Quantity"] = temp2["cost"]
temp2 = temp2.drop(["cost"], axis=1)

temp2["Unit price"] = temp2["Unit"]
temp2 = temp2.drop(["Unit"], axis=1)

temp2["Gross profit"] = temp2["cost.1"]
temp2 = temp2.drop(["cost.1"], axis=1)

temp2["Unit sale price"] = temp2["Unit.1"]
temp2 = temp2.drop(['Unit.1', 'price', 'Gross', 'profit', 'Unit.2', 'sale', 'price.1'], axis=1)

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Unit cost,Quantity,Unit price,Gross profit,Unit sale price
21,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit,United States,181288,222735,88348.1,2.72,33799.0,6.59,92939.60,5.652222
36,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit,United Kingdom,11637.3,12250.8,5391.1,2.90,1859.0,6.59,6246.24,6.260000
315,2004,Camping Equipment,Cooking Gear,TrailChef Kitchen Kit,Sales visit,United States,96725.2,102887,68865.4,15.93,4323.0,23.80,27859.85,22.612000
330,2004,Camping Equipment,Cooking Gear,TrailChef Kitchen Kit,Sales visit,United Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
609,2004,Camping Equipment,Cooking Gear,TrailChef Cook Set,Sales visit,United States,302116,322549,205344,34.97,5872.0,54.93,96772.39,42.792727

In [317]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
21,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit,United States,181288,222735,88348.1,33799.0,2.72,6.59,92939.60,5.652222
36,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit,United Kingdom,11637.3,12250.8,5391.1,1859.0,2.90,6.59,6246.24,6.260000
315,2004,Camping Equipment,Cooking Gear,TrailChef Kitchen Kit,Sales visit,United States,96725.2,102887,68865.4,4323.0,15.93,23.80,27859.85,22.612000
330,2004,Camping Equipment,Cooking Gear,TrailChef Kitchen Kit,Sales visit,United Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
609,2004,Camping Equipment,Cooking Gear,TrailChef Cook Set,Sales visit,United States,302116,322549,205344,5872.0,34.97,54.93,96772.39,42.792727

In [318]:
str13 = temp2

In [319]:
temp2 = copy.deepcopy(temp1[~temp1["Revenue"].isin(["Kingdom", "States"])])
temp2.head()

,Year,country,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,cost.1,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
22,2004,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit
23,2004,Mexico,133617,169943,65215.1,25788,2.7200,6.59,68402.21,5.723333,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit
24,2004,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit
25,2004,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit
26,2004,Korea,186697,238492,91891.4,36190,2.6975,6.59,94805.19,5.585000,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit

In [320]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp2.groupby(["country", "Revenue", "Planned"])["Year"].count())

country      Revenue    Planned
Australia    0.00       1191.33      1
             1886.00    1886.00      1
             1956.00    1956.00      1
             2790.00    2790.00      1
             4104.00    4104.00      1
             7521.00    7521.00      1
             7602.86    7758.06      1
             8057.00    8057.00      1
             8785.00    8785.00      1
             12714.48   12870.00     1
             18805.50   19181.61     1
             24850.60   32215.68     1
             27674.11   31552.11     1
             29500.60   30884.91     1
             30713.22   31882.42     1
             32669.14   34755.33     1
             33784.24   35941.12     1
             35259.84   35985.60     1
             36652.00   38520.00     1
             37295.90   62222.78     1
             45371.54   52360.65     1
             64072.99   65640.40     1
             64221.22   67598.56     1
             82051.20   84592.20     1
             82205.28   86533.92     1
             84977.04   90406.58     1
             87539.04   90249.99     1
Austria      0.00       153.72       1
                        512.40       1
                        522.40       1
                        768.60       1
             126.00     126.00       1
             300.00     300.00       1
             770.00     770.00       1
             1771.00    1771.00      1
             2438.00    2438.00      1
             9883.33    10189.00     1
             11368.89   12224.16     1
             12233.36   12743.76     1
             12562.35   13507.53     1
             13266.00   13266.00     1
             15338.70   16492.19     1
             28053.72   29846.19     1
             30890.41   32516.99     1
             33744.04   34438.60     1
             42203.14   58216.06     1
             42677.28   62730.06     1
             48292.56   51822.08     1
             48824.95   55226.19     1
             57239.46   60252.69     1
             64227.73   84925.33     1
             67892.96   68768.00     1
             111834.72  115298.07    1
             113235.16  128397.42    1
             140624.31  148029.09    1
             167938.56  173139.36    1
Belgium      313.44     626.88       1
             816.00     816.00       1
             1296.00    1296.00      1
             2275.62    2346.00      1
             2499.00    2499.00      1
             3948.00    3948.00      1
             7434.00    7434.00      1
             9439.20    10149.04     1
             9548.68    9660.00      1
             12791.86   13185.20     1
             12843.90   13245.90     1
             13807.82   14232.40     1
             13973.85   15025.23     1
             20376.16   20792.00     1
             22508.28   22932.00     1
             22573.44   23034.24     1
             22985.41   23455.11     1
             36172.78   39549.60     1
             39882.06   44548.86     1
             51281.44   53552.00     1
             59060.34   74625.16     1
             66347.78   69841.42     1
             69041.63   73971.84     1
             75884.83   87571.29     1
             81274.20   86467.15     1
             82767.22   87723.06     1
Brazil       25415.86   26476.26     1
Canada       1449.00    1449.00      1
             4163.00    4209.00      1
             6205.50    6329.61      1
             10178.28   10386.00     1
             10899.99   11237.19     1
             13362.25   13770.75     1
             13596.72   14313.48     1
             13997.04   14368.00     1
             15948.00   15948.00     1
             31882.08   33919.16     1
             37073.74   37830.54     1
             44384.64   45168.00     1
             59601.31   62249.14     1
             64788.48   66794.88     1
             68687.92   72300.16     1
             73387.62   77250.93     1
             104786.36  110304.04    1
China        1878.00    1878.00      1
             2645.00    2645.00      1
             5705.00    5705.00      1
             8085.00    8246.70      1
             11249.10   11597.10     1
             17057.88   17406.00     1
             17107.86   17457.00     1
             26839.84   28574.24     1
             33650.82   37389.80     1
             38861.99   41030.43     1
             46114.64   48216.00     1
             47533.64   50568.32     1
             53217.77   56020.03     1
             53898.18   56732.64     1
             65433.72   68882.22     1
             102470.29  145698.31    1
             114181.45  118928.60    1
             129536.64  137813.28    1
             136502.34  142815.57    1
Denmark      768.00     768.00       1
             3960.00    3960.00      1
             4456.02    4508.00      1
             5817.00    5817.00      1
             7546.00    7546.00      1
             7673.40    7830.00      1
             8504.23    8677.83      1
             10795.68   11016.00     1
             12469.92   13127.28     1
             13177.30   13871.95     1
             14023.68   20033.64     1
             14337.45   14926.35     1
             15660.81   16314.21     1
             18033.29   18587.80     1
             21277.76   23000.00     1
             22256.01   27153.21     1
             27394.20   28836.30     1
             27401.94   29463.36     1
             27758.88   28618.53     1
             27894.17   29057.97     1
             28388.36   29881.28     1
             36248.78   37247.00     1
             36949.50   39728.15     1
             44300.58   46896.93     1
             73554.72   78254.44     1
Finland      1368.00    1368.00      1
             2610.00    2610.00      1
             2877.00    2877.00      1
             8061.48    8226.00      1
             8942.10    10299.24     1
             14403.06   14697.00     1
             14535.08   15463.04     1
             15889.73   16916.53     1
             17028.81   17555.61     1
             17781.07   18331.00     1
             17817.41   25457.67     1
             24369.60   27672.00     1
             28606.27   29491.00     1
             31483.08   33851.52     1
             43465.50   54359.20     1
             52098.00   54264.00     1
             60973.24   75733.23     1
             72891.83   78361.69     1
             146051.82  157539.24    1
             191348.76  207454.39    1
France       532.00     532.00       1
             1398.00    1398.00      1
             1680.00    1680.00      1
             1887.48    1926.00      1
             1978.00    1978.00      1
             3995.37    4118.97      1
             4361.95    6049.00      1
             4605.30    4605.30      1
             5699.68    5816.00      1
             6376.59    6571.53      1
             6384.00    6511.68      1
             8439.97    9569.07      1
             9180.00    9180.00      1
             11478.00   11478.00     1
             13426.00   13426.00     1
             16432.62   16715.82     1
             21900.73   27910.26     1
             24255.30   25649.13     1
             25691.68   25904.00     1
             32162.73   33483.79     1
             38640.24   40674.36     1
             38887.12   40937.08     1
             45356.23   46759.00     1
             45820.80   47239.80     1
             47564.60   50740.41     1
             49543.65   53271.27     1
             50556.24   77913.57     1
             53027.48   55819.72     1
             55135.01   56042.00     1
             57769.32   60807.36     1
             59653.59   67449.20     1
             60515.40   61761.00     1
             86207.04   88876.74     1
             96009.15   114692.36    1
             101646.90  106997.85    1
             102236.61  111375.68    1
             132430.72  141719.40    1
             132727.54  140562.80    1
             154743.60  168839.68    1
             210080.16  221142.24    1
             265697.37  287111.00    1
Germany      750.00     750.00       1
             3615.72    3727.08      1
             3664.50    3737.79      1
             6378.00    6378.00      1
             6778.56    6831.00      1
             7159.68    7378.56      1
             11660.04   11898.00     1
             14749.00   14749.00     1
             19067.96   20073.14     1
             20041.02   21096.03     1
             21507.99   24134.88     1
             23532.32   23765.00     1
             24974.32   25894.40     1
             29516.67   32511.87     1
             35569.80   38246.04     1
             35807.55   36915.00     1
             39090.24   39888.00     1
             39427.20   40648.20     1
             41356.36   43534.04     1
             48832.08   49837.20     1
             52763.31   56732.64     1
             66653.28   68717.43     1
             73146.81   90744.30     1
             91345.04   96829.26     1
             137602.28  169692.50    1
             173509.78  182422.53    1
             185865.30  199842.61    1
             202903.08  215867.41    1
Italy        336.00     336.00       1
             3833.91    3951.99      1
             5076.00    5076.00      1
             6167.61    6358.41      1
             8272.16    8528.00      1
             12644.94   12903.00     1
             15744.00   17421.60     1
             15978.28   16469.60     1
             23860.06   24598.00     1
             29497.12   31052.08     1
             36533.38   38894.18     1
             44776.17   46161.00     1
             62961.29   68210.80     1
             74651.29   77858.01     1
             88781.84   94449.92     1
             98821.89   106256.16    1
             100357.65  107908.47    1
             103089.33  131865.90    1
             112654.20  119852.15    1
             113580.42  118319.22    1
             129995.86  139412.34    1
             200572.98  216935.73    1
Japan        258.00     258.00       1
             9136.40    9325.68      1
             18242.70   26061.00     1
             42768.88   43649.20     1
             52190.16   53264.40     1
             80612.64   88657.02     1
             84298.47   88737.33     1
             102858.06  108280.29    1
Korea        438.00     438.00       1
             6250.24    6511.68      1
             13579.68   13728.00     1
             16950.08   17296.00     1
             18047.82   18606.00     1
             22643.62   23724.12     1
             25119.36   25632.00     1
             27569.46   28417.20     1
             35646.00   37128.00     1
             51066.46   53726.58     1
             55967.67   65303.67     1
             58152.72   60216.00     1
             79622.30   82944.30     1
             84931.91   113802.71    1
             85639.12   92151.36     1
             87048.12   92609.99     1
             121061.65  125189.00    1
             160628.70  172714.26    1
             186539.97  205512.16    1
             186696.56  238492.10    1
             223747.84  239604.66    1
             407409.48  440147.84    1
Mexico       630.00     630.00       1
             4347.00    4347.00      1
             6237.00    6237.00      1
             6402.00    6402.00      1
             11169.25   11513.25     1
             11413.08   11646.00     1
             16814.00   16814.00     1
             17140.97   18318.30     1
             19521.90   19620.00     1
             19812.10   20335.00     1
             19880.28   20286.00     1
             20340.00   20340.00     1
             21374.61   27535.41     1
             25446.24   26233.44     1
             26178.92   26713.32     1
             31121.46   32985.75     1
             32623.92   33888.00     1
             33661.78   43696.80     1
             39649.50   41736.75     1
             40279.68   41527.08     1
             44089.18   46413.37     1
             47445.31   51009.42     1
             48115.42   50027.60     1
             48462.94   49718.20     1
             56689.71   58443.00     1
             59410.56   61248.00     1
             116013.47  122122.33    1
             126357.98  133003.04    1
             133045.30  144228.00    1
             133617.26  169942.92    1
             146031.63  178140.88    1
             147977.04  161944.00    1
             207041.99  237671.82    1
             211269.68  221972.13    1
             219597.56  234975.52    1
             253684.03  316341.87    1
             256629.60  277095.50    1
             267686.15  281533.35    1
             374991.00  398950.75    1
Netherlands  1794.00    1794.00      1
             2751.84    2808.00      1
             4950.00    4950.00      1
             6865.83    7078.23      1
             7308.00    7454.16      1
             9102.48    9384.00      1
             10620.49   10837.29     1
             12794.06   14209.28     1
             16323.03   17377.83     1
             26545.46   27234.06     1
             28168.80   29040.00     1
             29317.88   30541.08     1
             36424.80   36424.80     1
             39682.14   41774.01     1
             40668.48   43266.96     1
             60888.52   62141.80     1
             66387.07   69156.87     1
             118107.21  137048.31    1
             123054.20  129533.80    1
             127872.00  131832.00    1
Singapore    1671.68    3343.36      1
             6384.00    6511.68      1
             21020.70   21892.29     1
             21779.34   22236.00     1
             23133.44   23609.60     1
             25033.74   26353.41     1
             26263.72   27076.00     1
             30347.46   46770.57     1
             69722.89   72128.00     1
             89412.05   93129.40     1
             118193.46  161665.88    1
             154087.54  165613.95    1
             189314.40  207706.24    1
             208250.25  236305.89    1
             342187.02  369839.03    1
Spain        5564.98    5678.58      1
             5814.00    5814.00      1
             6983.03    7199.00      1
             13036.14   13878.54     1
             14309.44   14752.00     1
             24864.72   26175.48     1
             24902.10   26774.77     1
             40370.40   42495.60     1
             43277.36   45553.28     1
             44527.86   46872.54     1
             46266.86   47457.20     1
             47952.00   49437.00     1
             51619.96   54341.14     1
             87373.08   91972.62     1
             105975.35  109860.00    1
Sweden       732.00     732.00       1
             2960.10    5382.00      1
             17281.35   17639.37     1
             20050.52   21104.96     1
             20125.16   20539.40     1
             23587.59   37827.72     1
             38063.52   40067.28     1
             41927.23   44134.97     1
             49656.96   51194.76     1
Switzerland  0.00       5108.49      1
             1194.00    1194.00      1
             1652.00    1652.00      1
             2254.00    2254.00      1
             2268.00    2268.00      1
             4557.00    4557.00      1
             5281.50    5387.13      1
             7625.64    7782.60      1
             11407.95   12323.22     1
             17774.93   18667.71     1
             22059.54   23220.81     1
             22195.46   24030.40     1
             26554.98   28976.22     1
             28998.72   29131.20     1
             36869.76   38011.56     1
             53032.20   56420.65     1
             53889.86   77999.24     1
             60300.16   75205.08     1
             62841.43   63831.60     1
             96350.10   101763.52    1
             100663.41  105963.99    1
             107856.16  112167.06    1
Name: Year, dtype: int64

In [322]:
temp2["Retailer country"] = temp2["country"]
temp2 = temp2.drop(["country"], axis=1)

temp2["Planned revenue"] = temp2["Planned"]
temp2 = temp2.drop(["Planned"], axis=1)

temp2["Product cost"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Unit cost"] = temp2["cost"]
temp2 = temp2.drop(["cost"], axis=1)

temp2["Unit price"] = temp2["Quantity"]
temp2 = temp2.drop(["Quantity"], axis=1)

temp2["Quantity"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Gross profit"] = temp2["Unit"]
temp2 = temp2.drop(["Unit"], axis=1)

temp2["Unit sale price"] = temp2["cost.1"]
temp2 = temp2.drop(['cost.1', 'Unit.1', 'price', 'Gross', 'profit', 'Unit.2', 'sale', 'price.1'], axis=1)

temp2.head()

,Year,Revenue,Product line,Product type,Product,Order method type,Retailer country,Planned revenue,Product cost,Unit cost,Unit price,Quantity,Gross profit,Unit sale price
22,2004,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23,2004,133617,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit,Mexico,169943,65215.1,2.7200,6.59,25788,68402.21,5.723333
24,2004,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25,2004,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26,2004,186697,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit,Korea,238492,91891.4,2.6975,6.59,36190,94805.19,5.585000

In [323]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
22,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit,Mexico,133617,169943,65215.1,25788,2.7200,6.59,68402.21,5.723333
24,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Sales visit,Korea,186697,238492,91891.4,36190,2.6975,6.59,94805.19,5.585000

In [324]:
str14 = temp2

In [325]:
temp1 = copy.deepcopy(temp[temp["Retailer"] != "visit"])
temp1.head()

,Year,type.1,Retailer,country,Revenue,Planned,revenue,Product.3,cost,Quantity,...,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
0,2004,Telephone,United,States,315044,437477,158372,66385,2.552857,6.59,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag
1,2004,Telephone,Canada,13444.7,14313.5,6298.8,2172,2.9,6.590000,7145.88,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag
2,2004,Telephone,Mexico,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag
3,2004,Telephone,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag
4,2004,Telephone,Japan,181120,235237,89413.1,35696,2.657,6.590000,91707.18,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag

In [327]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp1.groupby(["type.1", "Retailer"])["Year"].count())

type.1     Retailer
E-mail     Australia      47
           Austria        47
           Belgium        47
           Brazil         47
           Canada         47
           China          47
           Denmark        47
           Finland        47
           France         47
           Germany        47
           Italy          47
           Japan          47
           Korea          47
           Mexico         47
           Netherlands    47
           Singapore      47
           Spain          47
           Sweden         47
           Switzerland    47
           United         94
Fax        Australia      47
           Austria        47
           Belgium        47
           Brazil         47
           Canada         47
           China          47
           Denmark        47
           Finland        47
           France         47
           Germany        47
           Italy          47
           Japan          47
           Korea          47
           Mexico         47
           Netherlands    47
           Singapore      47
           Spain          47
           Sweden         47
           Switzerland    47
           United         94
Mail       Australia      47
           Austria        47
           Belgium        47
           Brazil         47
           Canada         47
           China          47
           Denmark        47
           Finland        47
           France         47
           Germany        47
           Italy          47
           Japan          47
           Korea          47
           Mexico         47
           Netherlands    47
           Singapore      47
           Spain          47
           Sweden         47
           Switzerland    47
           United         94
Special    Australia      47
           Austria        47
           Belgium        47
           Brazil         47
           Canada         47
           China          47
           Denmark        47
           Finland        47
           France         47
           Germany        47
           Italy          47
           Japan          47
           Korea          47
           Mexico         47
           Netherlands    47
           Singapore      47
           Spain          47
           Sweden         47
           Switzerland    47
           United         94
Telephone  Australia      47
           Austria        47
           Belgium        47
           Brazil         47
           Canada         47
           China          47
           Denmark        47
           Finland        47
           France         47
           Germany        47
           Italy          47
           Japan          47
           Korea          47
           Mexico         47
           Netherlands    47
           Singapore      47
           Spain          47
           Sweden         47
           Switzerland    47
           United         94
Web        Australia      47
           Austria        47
           Belgium        47
           Brazil         47
           Canada         47
           China          47
           Denmark        47
           Finland        47
           France         47
           Germany        47
           Italy          47
           Japan          47
           Korea          47
           Mexico         47
           Netherlands    47
           Singapore      47
           Spain          47
           Sweden         47
           Switzerland    47
           United         94
Name: Year, dtype: int64

In [328]:
temp1["Order method type"] = temp1["type.1"]
temp1 = temp1.drop(["type.1"], axis=1)
temp1.head()

,Year,Retailer,country,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
0,2004,United,States,315044,437477,158372,66385,2.552857,6.59,156672.570,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone
1,2004,Canada,13444.7,14313.5,6298.8,2172,2.9,6.590000,7145.88,6.190,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone
2,2004,Mexico,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone
3,2004,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone
4,2004,Japan,181120,235237,89413.1,35696,2.657,6.590000,91707.18,5.488,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone

In [329]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp1.groupby(["Retailer", "country", "Revenue"])["Year"].count())

6572.42      1
             76153.92   83304.00      1
             85140      95285.76      1
             87558.04   92172.54      1
             93235.4    131583.06     1
             97534.43   104853.49     1
             100345.12  145613.16     1
             106352.82  117570.60     1
             112448.96  124196.73     1
             117431.1   126262.07     1
             125140.74  132122.34     1
             125414.17  133420.96     1
             129256.56  132912.00     1
             135474.43  142408.77     1
             143364.09  154914.20     1
             148678.44  158178.13     1
             176506.43  182450.80     1
             182692.85  233846.15     1
             209527.16  279442.36     1
             216808.9   248162.60     1
             228141.83  245736.96     1
             235074.65  242831.40     1
             283422.51  340755.72     1
             299461.86  315226.29     1
             315521.15  344466.03     1
             335861.85  353547.15     1
             411061.72  434114.40     1
             431223.96  458776.67     1
             445929.16  471245.85     1
             472730.31  522847.65     1
             499905.27  588190.44     1
             559406.18  579566.43     1
             596622.58  628038.62     1
Spain        348        348.00        1
             750        750.00        1
             1056       1056.00       1
             1614       1614.00       1
             2184       2184.00       1
             2262       2262.00       1
             2268       2268.00       1
             2298       2298.00       1
             2310       2310.00       1
             2700       2700.00       1
             3414       3414.00       1
             3418.31    3523.59       1
             3571.54    3682.00       1
             3730.01    3844.89       1
             3836       3836.00       1
             3944.5     4025.00       1
             3965.36    4088.00       1
             4137       4137.00       1
             4254       4254.00       1
             4997.44    5152.00       1
             6269.11    6463.00       1
             6573       6573.00       1
             6998.7     9133.53       1
             7156.59    11920.23      1
             7266       7411.32       1
             7768.75    8006.25       1
             7908.9     8236.83       1
             8066.52    8316.00       1
             8168.37    8421.00       1
             10453.63   12195.12      1
             10656      10656.00      1
             12191.58   12692.34      1
             14010.65   23374.73      1
             14022      14603.40      1
             15294      15294.00      1
             15839.74   16326.80      1
             15890.51   16332.75      1
             17199.09   18492.96      1
             17296.26   18597.44      1
             17723.2    18088.00      1
             18056.23   19223.03      1
             18462.63   24129.63      1
             20166.99   20788.11      1
             20293      20293.00      1
             20824.76   21253.40      1
             21219.71   21872.20      1
             21238.2    22835.34      1
             21440.58   21903.00      1
             21900.83   23299.04      1
             23054.08   32934.09      1
             23097.75   28221.00      1
             24313.77   25061.40      1
             25270.92   45421.11      1
             26962.74   28684.53      1
             27324      29378.80      1
             27749.54   39902.45      1
             28896.04   30101.64      1
             29041.18   29555.00      1
             30403.78   31333.26      1
             33008.98   34386.18      1
             33939.36   34632.00      1
             34668.13   36881.44      1
             34747.38   36576.57      1
             34840.26   36672.48      1
             35621.46   39579.40      1
             36045      37942.50      1
             36981.3    39763.74      1
             38893.38   40943.67      1
             41340.32   43065.12      1
             43069.81   43949.01      1
             44010      44010.00      1
             44915.04   46305.99      1
             46726.56   48173.61      1
             51756.2    59166.80      1
             52028.57   53930.10      1
             52524.76   65909.34      1
             55908.86   57638.00      1
             58415.12   60560.00      1
             72520.58   76132.98      1
             74136.06   81339.66      1
             84223.92   89605.34      1
             85852.4    96455.88      1
             87278.11   90225.80      1
             90689.83   93034.20      1
             97047.9    102158.10     1
             98896.64   104536.00     1
             101229.04  104248.00     1
             108368.09  127219.95     1
             117619.6   158690.07     1
             120928.15  126345.03     1
             130171.28  137822.79     1
             140631.43  154247.80     1
             143941.57  192118.27     1
             160328.16  168768.24     1
             171049.1   191989.05     1
             171424.95  190049.12     1
             197054     201110.00     1
             215373.43  230266.56     1
             218095.49  273979.25     1
             226175     285366.77     1
             226707.66  244845.59     1
             234485.28  255589.29     1
             234820.11  252423.68     1
             314041.93  330578.27     1
             333747.7   393683.31     1
             342167.52  364030.04     1
             342315.36  361364.37     1
             356285.63  395816.16     1
             380632.32  392419.92     1
             390018.56  412904.96     1
             436969.27  459978.53     1
Sweden       0          2636.64       1
             300        300.00        1
             1512       1512.00       1
             2002       2002.00       1
             2310.84    2358.00       1
             2628       2628.00       1
             3252       3252.00       1
             3393.6     3535.00       1
             3490.71    3490.71       1
             3978       3978.00       1
             4068       4068.00       1
             4375       4375.00       1
             5940       11877.03      1
             6164       6164.00       1
             6603.76    6808.00       1
             6877       6877.00       1
             7283.98    8800.47       1
             7314.72    7464.00       1
             9101.34    9180.00       1
             9525.6     9720.00       1
             10348.62   10396.00      1
             11249.1    11597.10      1
             12807.11   13634.71      1
             13093.05   13637.40      1
             13461.76   13688.00      1
             14923.84   15710.56      1
             14951.46   15565.58      1
             15440.86   15756.06      1
             17145.18   17675.58      1
             17490.6    18806.40      1
             18474.15   30821.43      1
             19494      19494.00      1
             21019.04   21448.00      1
             21031.35   22613.73      1
             21510.77   22300.60      1
             21596.08   22264.00      1
             22462.98   24883.29      1
             22697.28   23400.18      1
             27105.84   28532.76      1
             27865.44   29645.88      1
             28229.38   29717.13      1
             28526.93   29717.13      1
             30718.4    32856.00      1
             31863.78   33541.17      1
             35075.05   35791.05      1
             35133.08   41672.61      1
             40063.47   41589.49      1
             41238.72   42515.82      1
             41413.9    43349.04      1
             41560.14   43751.01      1
             42447.65   44218.65      1
             43639.84   45937.76      1
             47730.06   50777.28      1
             48169.06   51573.06      1
             48323.11   60104.52      1
             48419.84   49408.00      1
             48877.02   51450.03      1
             48912.85   81603.97      1
             49298.46   63224.46      1
             49442.58   55792.32      1
             54184.4    56530.53      1
             54691.44   76411.05      1
             55247.53   58156.67      1
             55396.83   72977.94      1
             57435.84   59214.54      1
             60485.85   61975.20      1
             61558.64   64384.30      1
             61577.67   66762.72      1
             61631.35   69258.00      1
             61967.51   73911.99      1
             62434.54   65717.92      1
             62542.88   63593.60      1
             63727.56   67082.34      1
             67794.58   71359.84      1
             69379.38   74598.72      1
             72800.41   106948.71     1
             73962.6    79527.48      1
             78394.98   85332.06      1
             80319.34   86295.03      1
             84136.97   86185.17      1
             97062.3    104361.51     1
             111595.32  117469.98     1
             140344.67  147823.98     1
             143224.94  150766.66     1
             158531.76  168661.02     1
             202785.71  213463.69     1
Switzerland  162        162.00        1
             432        432.00        1
             980.98     1001.00       1
             1476       1476.00       1
             1495       1495.00       1
             1626       1626.00       1
             2520       2520.00       1
             3174.39    3239.19       1
             4319.84    4408.00       1
             4431       4431.00       1
             8768.32    8948.80       1
             10704.89   11388.32      1
             12435.06   12828.20      1
             12489      15594.00      1
             12767.3    13582.40      1
             13492.5    13580.00      1
             14002.14   14329.98      1
             14088.6    14831.10      1
             16398      16398.00      1
             18653      18653.00      1
             18914.4    19500.15      1
             23338.18   23980.32      1
             26309.18   43418.34      1
             29001.72   30231.60      1
             35225.54   38630.34      1
             36504      36504.00      1
             40519.45   67205.25      1
             45478.4    47856.00      1
             63703.58   65471.91      1
             65256.01   68134.01      1
             67935.84   78682.80      1
             76410.11   78397.20      1
             77694.23   84018.99      1
             104014.05  119147.20     1
             104632.96  106448.00     1
             106754.27  114405.60     1
             122745.56  126140.00     1
             142960.46  151913.92     1
             145626.28  184249.81     1
             162046.32  172400.14     1
             164414.67  173624.88     1
             172864.08  197308.56     1
             191646.05  196649.40     1
             207907.56  218852.34     1
             217501.47  228954.33     1
             224548.84  243724.41     1
             228594.58  252848.82     1
             270909.53  285174.67     1
United       Kingdom    366.00        1
                        1817.00       1
                        2328.48       1
                        2840.04       1
                        2857.68       1
                        4410.00       1
                        4518.00       1
                        5624.55       1
                        6439.14       1
                        7818.00       1
                        8380.80       1
                        8411.60       1
                        9444.79       1
                        10512.09      1
                        11595.36      1
                        12716.48      1
                        13211.38      1
                        13478.96      1
                        15630.00      1
                        16186.85      1
                        19803.18      1
                        20382.56      1
                        22491.00      1
                        22768.22      1
                        30077.10      1
                        30150.47      1
                        30430.44      1
                        30604.77      1
                        32191.41      1
                        35759.91      1
                        38291.40      1
                        38336.40      1
                        41610.08      1
                        47576.88      1
                        49078.32      1
                        49124.16      1
                        51370.28      1
                        51822.68      1
                        53398.14      1
                        60689.64      1
                        60912.00      1
                        61623.73      1
                        62655.37      1
                        62661.77      1
                        63050.82      1
                        79585.25      1
                        87275.80      1
                        88031.30      1
                        89181.61      1
                        99703.91      1
                        122655.36     1
                        133778.60     1
                        146928.49     1
                        148556.38     1
                        159922.95     1
                        160227.13     1
                        168290.41     1
                        189143.04     1
                        191675.23     1
                        209004.60     1
                        214068.45     1
                        214539.87     1
                        221563.32     1
                        234305.84     1
                        258097.89     1
                        260749.54     1
                        262603.84     1
                        264009.17     1
                        329589.19     1
                        340057.60     1
                        361130.37     1
                        380298.99     1
                        389141.82     1
                        412266.06     1
                        415910.51     1
                        437329.13     1
                        462097.44     1
                        469008.56     1
                        482779.25     1
                        507265.33     1
                        510518.08     1
                        547518.24     1
                        589899.00     1
                        638697.99     1
             States     0.00          1
                        234.00        1
                        1151.15       1
                        1158.00       1
                        1392.00       1
                        1938.00       1
                        2070.00       1
                        3561.32       1
                        3967.04       1
                        4057.20       1
                        4163.04       1
                        4494.00       1
                        4500.00       1
                        5828.79       1
                        6654.00       1
                        7250.75       1
                        8999.28       1
                        9131.27       1
                        9251.52       1
                        10422.09      1
                        10606.68      1
                        10750.20      1
                        11013.38      1
                        11500.32      1
                        12199.18      1
                        12435.30      1
                        12983.64      1
                        13316.16      1
                        14269.62      1
                        14803.60      1
                        17761.08      1
                        19756.56      1
                        20550.50      1
                        20631.27      1
                        20838.00      1
                        21076.95      1
                        22007.99      1
                        22137.07      1
                        22199.33      1
                        22757.64      1
                        23068.80      1
                        25719.12      1
                        26337.18      1
                        27842.88      1
                        30317.04      1
                        32881.15      1
                        34907.26      1
                        35850.20      1
                        35950.32      1
                        37446.30      1
                        38877.06      1
                        40129.02      1
                        41837.46      1
                        46745.73      1
                        47265.19      1
                        47445.64      1
                        47605.20      1
                        48205.04      1
                        48387.96      1
                        48696.75      1
                        49025.34      1
                        49848.21      1
                        50700.94      1
                        51086.64      1
                        51686.46      1
                        52374.24      1
                        54692.62      1
                        54726.00      1
                        57269.06      1
                        57481.12      1
                        58265.62      1
                        58741.22      1
                        59690.52      1
                        63421.65      1
                        65371.75      1
                        65714.68      1
                        72425.08      1
                        72429.36      1
                        72838.08      1
                        74768.40      1
                        78696.00      1
                        79746.52      1
                        86995.65      1
                        87531.44      1
                        100092.54     1
                        109375.35     1
                        122721.12     1
                        127382.37     1
                        136079.25     1
                        141785.91     1
                        159276.89     1
                        161991.99     1
                        165452.08     1
                        170879.04     1
                        178351.24     1
                        220003.68     1
                        231176.54     1
                        253305.72     1
                        255807.34     1
                        262228.81     1
                        264171.60     1
                        279923.16     1
                        315044.33     1
                        330846.18     1
                        340867.26     1
                        360482.81     1
                        387928.35     1
                        422398.66     1
                        433644.30     1
                        434382.83     1
                        437082.50     1
                        450719.93     1
                        467558.24     1
                        473273.16     1
                        500254.76     1
                        519314.78     1
                        535609.64     1
                        554967.43     1
                        556584.92     1
                        570362.22     1
                        589548.06     1
                        605057.27     1
                        622279.58     1
                        647105.44     1
                        776608.27     1
                        855310.89     1
                        885236.58     1
                        900648.63     1
                        925061.09     1
                        932556.24     1
                        1049370.24    1
                        1123278.48    1
                        1159013.35    1
                        1222803.54    1
                        1277590.76    1
                        1299690.94    1
                        1657838.21    1
                        1681973.31    1
Name: Year, dtype: int64

In [334]:
temp2 = copy.deepcopy(temp1[temp1["country"].isin(["Kingdom", "States"])])
temp2.head()

,Year,Retailer,country,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
0,2004,United,States,315044,437477,158372,66385,2.552857,6.59,156672.57,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone
15,2004,United,Kingdom,160227,220996,80307.1,33535,2.576000,6.59,79920.02,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone
42,2004,United,States,340867,407124,164590,61779,2.778500,6.59,176276.82,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Web
57,2004,United,Kingdom,168290,199446,80612.1,30265,2.775385,6.59,87678.26,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Web
63,2004,United,States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Special

In [335]:
temp2.groupby(["Retailer", "country", "Revenue"])["Year"].count()

Retailer  country  Revenue
United    Kingdom  366.00        1
                   1817.00       1
                   2328.48       1
                   2840.04       1
                   2857.68       1
                                ..
          States   1222803.54    1
                   1277590.76    1
                   1299690.94    1
                   1657838.21    1
                   1681973.31    1
Name: Year, Length: 222, dtype: int64

In [337]:
temp2["Retailer country"] = temp2["Retailer"] + " " + temp2["country"]
temp2 = temp2.drop(["Retailer", "country"], axis=1)

temp2["Planned revenue"] = temp2["Planned"]
temp2 = temp2.drop(["Planned"], axis=1)

temp2["Product cost"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Unit price"] = temp2["Quantity"]
temp2 = temp2.drop(["Quantity"], axis=1)

temp2["Quantity"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Unit cost"] = temp2["cost"]
temp2 = temp2.drop(["cost"], axis=1)

temp2["Gross profit"] = temp2["Unit"]
temp2 = temp2.drop(["Unit"], axis=1)

temp2["Unit sale price"] = temp2["cost.1"]
temp2 = temp2.drop(['cost.1', 'Unit.1', 'price', 'Gross', 'profit', 'Unit.2', 'sale', 'price.1'], axis=1)

temp2.head()

,Year,Revenue,Product line,Product type,Product,Order method type,Retailer country,Planned revenue,Product cost,Unit price,Quantity,Unit cost,Gross profit,Unit sale price
0,2004,315044,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone,United States,437477,158372,6.59,66385,2.552857,156672.57,5.195714
15,2004,160227,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone,United Kingdom,220996,80307.1,6.59,33535,2.576000,79920.02,5.270000
42,2004,340867,Camping Equipment,Cooking Gear,TrailChef Water Bag,Web,United States,407124,164590,6.59,61779,2.778500,176276.82,5.838000
57,2004,168290,Camping Equipment,Cooking Gear,TrailChef Water Bag,Web,United Kingdom,199446,80612.1,6.59,30265,2.775385,87678.26,5.877692
63,2004,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Special,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [338]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
0,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone,United States,315044,437477,158372,66385,2.552857,6.59,156672.57,5.195714
15,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone,United Kingdom,160227,220996,80307.1,33535,2.576000,6.59,79920.02,5.270000
42,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Web,United States,340867,407124,164590,61779,2.778500,6.59,176276.82,5.838000
57,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Web,United Kingdom,168290,199446,80612.1,30265,2.775385,6.59,87678.26,5.877692
63,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Special,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [339]:
str15 = temp2

In [345]:
temp2 = copy.deepcopy(temp1[~temp1["country"].isin(["Kingdom", "States"])])
temp2.head()

,Year,Retailer,country,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
1,2004,Canada,13444.7,14313.5,6298.8,2172,2.9,6.59,7145.88,6.190,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone
2,2004,Mexico,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone
3,2004,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone
4,2004,Japan,181120,235237,89413.1,35696,2.657,6.59,91707.18,5.488,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone
5,2004,Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone

In [346]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp2.groupby(["Retailer", "country"])["Year"].count())

00       1
             1050.00      1
             1794.00      1
             1818.00      1
             2250.00      1
             3338.94      1
             3546.00      1
             3657.00      1
             4270.29      1
             4781.07      1
             4812.00      1
             5365.50      1
             6018.18      1
             6156.36      1
             6348.78      1
             6603.76      1
             6797.00      1
             7411.88      1
             7452.00      1
             7956.00      1
             8130.00      1
             8376.30      1
             9139.34      1
             9173.34      1
             9913.80      1
             10529.04     1
             12399.33     1
             13234.22     1
             13408.31     1
             13636.70     1
             13884.17     1
             13997.34     1
             14186.82     1
             14761.73     1
             16406.30     1
             16520.00     1
             16548.56     1
             18717.18     1
             19412.73     1
             21710.92     1
             21735.00     1
             21910.14     1
             24384.99     1
             25609.08     1
             25625.98     1
             27248.06     1
             28112.00     1
             28304.76     1
             28757.59     1
             29530.41     1
             29549.95     1
             30199.40     1
             30319.75     1
             32042.40     1
             33378.09     1
             33395.55     1
             33493.52     1
             33576.60     1
             33594.75     1
             34747.38     1
             35595.00     1
             35612.46     1
             35643.10     1
             35932.12     1
             36745.40     1
             37848.36     1
             38172.53     1
             40439.52     1
             40631.47     1
             41292.93     1
             41675.08     1
             43094.50     1
             44744.55     1
             46498.97     1
             47144.10     1
             50945.37     1
             53802.88     1
             54275.40     1
             54775.49     1
             57155.54     1
             57820.13     1
             59976.71     1
             60048.26     1
             64370.58     1
             66291.12     1
             69328.99     1
             72181.72     1
             78716.63     1
             80392.80     1
             80748.27     1
             84798.00     1
             87879.09     1
             94555.00     1
             101671.20    1
             110520.36    1
             123781.71    1
             126085.66    1
             133805.13    1
             137828.88    1
             152462.80    1
             153637.98    1
             159534.90    1
             162269.08    1
             162962.07    1
             165096.46    1
             168487.05    1
             168736.00    1
             169706.88    1
             171352.08    1
             177089.03    1
             181120.24    1
             181634.81    1
             183221.18    1
             184090.59    1
             188723.82    1
             195191.28    1
             210742.84    1
             210848.13    1
             216995.34    1
             226462.59    1
             252560.40    1
             308696.88    1
             317350.22    1
             334976.90    1
             384632.52    1
             423600.84    1
             440013.91    1
             461564.64    1
             467654.34    1
             473765.04    1
             569044.92    1
             573491.48    1
             600761.00    1
             660444.48    1
             781124.61    1
             931786.70    1
             955680.19    1
Korea        402.00       1
             2928.00      1
             7752.00      1
             8753.08      1
             10404.00     1
             10560.00     1
             13050.27     1
             13837.36     1
             15547.00     1
             16596.90     1
             18356.55     1
             18756.64     1
             18772.60     1
             20909.43     1
             24250.26     1
             24378.96     1
             25948.44     1
             26531.10     1
             29135.25     1
             30557.60     1
             34275.29     1
             34495.35     1
             34809.04     1
             35703.36     1
             37070.74     1
             37896.30     1
             38734.56     1
             39521.54     1
             39834.04     1
             41709.43     1
             42107.16     1
             45395.10     1
             46389.00     1
             48870.00     1
             51616.44     1
             55120.59     1
             63553.14     1
             69799.68     1
             74254.93     1
             74878.30     1
             79035.72     1
             80667.90     1
             83939.68     1
             91577.01     1
             94162.79     1
             96580.82     1
             97717.32     1
             100604.28    1
             113190.78    1
             121297.53    1
             136855.20    1
             137204.06    1
             149974.10    1
             156876.96    1
             158569.27    1
             171356.10    1
             203579.92    1
             220639.70    1
             238524.44    1
             246428.66    1
             297206.77    1
             307900.56    1
             315177.48    1
             316991.85    1
             328807.08    1
             378633.20    1
             396498.81    1
             413563.60    1
             440619.00    1
             466511.40    1
             527071.08    1
             645465.96    1
             693797.34    1
Mexico       1056.00      1
             3268.30      1
             3408.00      1
             3528.00      1
             3719.10      1
             3969.00      1
             6366.00      1
             7514.64      1
             8339.85      1
             12040.00     1
             12303.36     1
             12541.13     1
             12937.96     1
             14518.43     1
             15240.89     1
             15741.54     1
             18076.14     1
             18291.00     1
             20358.30     1
             20368.80     1
             21031.35     1
             21891.24     1
             23232.40     1
             25688.70     1
             25689.30     1
             26152.75     1
             26235.90     1
             26259.54     1
             26350.90     1
             26937.00     1
             28311.39     1
             28696.54     1
             29909.40     1
             35459.40     1
             35601.73     1
             37028.40     1
             41517.40     1
             42174.00     1
             47009.70     1
             47945.64     1
             50091.26     1
             50223.06     1
             51132.35     1
             60063.81     1
             60597.84     1
             60630.50     1
             67025.70     1
             70489.54     1
             74400.22     1
             74928.04     1
             109986.96    1
             114189.12    1
             123253.55    1
             124035.65    1
             165788.74    1
             169310.70    1
             176012.74    1
             212041.70    1
             230273.11    1
             287819.71    1
             292829.58    1
             357196.38    1
             381975.46    1
             416897.10    1
             454995.95    1
             481814.28    1
             543411.67    1
Netherlands  432.00       1
             1032.00      1
             2081.52      1
             2238.00      1
             3313.38      1
             4056.00      1
             4080.00      1
             4884.00      1
             4915.96      1
             5442.00      1
             5652.16      1
             6070.80      1
             6536.83      1
             6804.00      1
             6990.40      1
             7742.00      1
             7893.18      1
             7965.82      1
             8216.40      1
             8749.56      1
             9102.00      1
             13853.00     1
             14784.16     1
             14867.01     1
             15805.44     1
             15846.05     1
             15862.41     1
             16564.10     1
             16987.32     1
             17551.80     1
             18192.73     1
             18208.35     1
             18592.65     1
             20491.80     1
             22929.83     1
             23366.00     1
             24365.74     1
             25251.90     1
             25361.37     1
             25394.60     1
             25715.15     1
             28350.67     1
             28480.90     1
             28792.56     1
             29855.84     1
             30333.78     1
             31349.23     1
             32416.20     1
             34030.80     1
             34751.88     1
             34894.56     1
             40491.39     1
             41523.76     1
             42597.61     1
             43780.60     1
             44167.77     1
             48078.00     1
             49351.03     1
             49645.68     1
             49816.08     1
             51591.36     1
             57277.99     1
             61573.80     1
             62348.40     1
             66863.07     1
             67705.32     1
             67793.85     1
             70758.73     1
             74321.18     1
             75625.30     1
             92534.31     1
             96053.54     1
             96692.34     1
             106127.16    1
             108102.60    1
             115759.55    1
             118989.45    1
             126510.11    1
             128519.52    1
             132413.01    1
             145239.36    1
             152135.23    1
             156494.83    1
             172690.75    1
             174449.54    1
             178038.16    1
             184073.48    1
             189255.35    1
             217423.74    1
             225784.79    1
             227124.34    1
             232174.18    1
             243697.08    1
             250795.38    1
             289074.07    1
             318870.06    1
             328009.50    1
             343061.38    1
             378714.24    1
             386225.27    1
             424600.42    1
Singapore    936.00       1
             1536.00      1
             1704.00      1
             3538.78      1
             3852.00      1
             4500.00      1
             5814.00      1
             5962.40      1
             6702.00      1
             7948.50      1
             8290.20      1
             8856.94      1
             9550.08      1
             10240.29     1
             10616.34     1
             10820.35     1
             13015.24     1
             13127.38     1
             13735.15     1
             14270.56     1
             16163.00     1
             16834.86     1
             17421.46     1
             18510.94     1
             18963.00     1
             19919.85     1
             22209.95     1
             23320.80     1
             24212.16     1
             25603.40     1
             25829.23     1
             26177.76     1
             28963.90     1
             28980.69     1
             30940.35     1
             31194.15     1
             31978.24     1
             34158.30     1
             35467.53     1
             36229.90     1
             38688.30     1
             40147.65     1
             41100.12     1
             41228.74     1
             41415.48     1
             41852.30     1
             42370.16     1
             43100.97     1
             44685.55     1
             45756.00     1
             47171.01     1
             49777.12     1
             50013.20     1
             51955.20     1
             55564.68     1
             60323.12     1
             63905.56     1
             69869.25     1
             72738.92     1
             76153.92     1
             85140.00     1
             87558.04     1
             93235.40     1
             97534.43     1
             100345.12    1
             106352.82    1
             112448.96    1
             117431.10    1
             125140.74    1
             125414.17    1
             129256.56    1
             135474.43    1
             143364.09    1
             148678.44    1
             176506.43    1
             182692.85    1
             209527.16    1
             216808.90    1
             228141.83    1
             235074.65    1
             283422.51    1
             299461.86    1
             315521.15    1
             335861.85    1
             411061.72    1
             431223.96    1
             445929.16    1
             472730.31    1
             499905.27    1
             559406.18    1
             596622.58    1
Spain        348.00       1
             750.00       1
             1056.00      1
             1614.00      1
             2184.00      1
             2262.00      1
             2268.00      1
             2298.00      1
             2310.00      1
             2700.00      1
             3414.00      1
             3418.31      1
             3571.54      1
             3730.01      1
             3836.00      1
             3944.50      1
             3965.36      1
             4137.00      1
             4254.00      1
             4997.44      1
             6269.11      1
             6573.00      1
             6998.70      1
             7156.59      1
             7266.00      1
             7768.75      1
             7908.90      1
             8066.52      1
             8168.37      1
             10453.63     1
             10656.00     1
             12191.58     1
             14010.65     1
             14022.00     1
             15294.00     1
             15839.74     1
             15890.51     1
             17199.09     1
             17296.26     1
             17723.20     1
             18056.23     1
             18462.63     1
             20166.99     1
             20293.00     1
             20824.76     1
             21219.71     1
             21238.20     1
             21440.58     1
             21900.83     1
             23054.08     1
             23097.75     1
             24313.77     1
             25270.92     1
             26962.74     1
             27324.00     1
             27749.54     1
             28896.04     1
             29041.18     1
             30403.78     1
             33008.98     1
             33939.36     1
             34668.13     1
             34747.38     1
             34840.26     1
             35621.46     1
             36045.00     1
             36981.30     1
             38893.38     1
             41340.32     1
             43069.81     1
             44010.00     1
             44915.04     1
             46726.56     1
             51756.20     1
             52028.57     1
             52524.76     1
             55908.86     1
             58415.12     1
             72520.58     1
             74136.06     1
             84223.92     1
             85852.40     1
             87278.11     1
             90689.83     1
             97047.90     1
             98896.64     1
             101229.04    1
             108368.09    1
             117619.60    1
             120928.15    1
             130171.28    1
             140631.43    1
             143941.57    1
             160328.16    1
             171049.10    1
             171424.95    1
             197054.00    1
             215373.43    1
             218095.49    1
             226175.00    1
             226707.66    1
             234485.28    1
             234820.11    1
             314041.93    1
             333747.70    1
             342167.52    1
             342315.36    1
             356285.63    1
             380632.32    1
             390018.56    1
             436969.27    1
Sweden       0.00         1
             300.00       1
             1512.00      1
             2002.00      1
             2310.84      1
             2628.00      1
             3252.00      1
             3393.60      1
             3490.71      1
             3978.00      1
             4068.00      1
             4375.00      1
             5940.00      1
             6164.00      1
             6603.76      1
             6877.00      1
             7283.98      1
             7314.72      1
             9101.34      1
             9525.60      1
             10348.62     1
             11249.10     1
             12807.11     1
             13093.05     1
             13461.76     1
             14923.84     1
             14951.46     1
             15440.86     1
             17145.18     1
             17490.60     1
             18474.15     1
             19494.00     1
             21019.04     1
             21031.35     1
             21510.77     1
             21596.08     1
             22462.98     1
             22697.28     1
             27105.84     1
             27865.44     1
             28229.38     1
             28526.93     1
             30718.40     1
             31863.78     1
             35075.05     1
             35133.08     1
             40063.47     1
             41238.72     1
             41413.90     1
             41560.14     1
             42447.65     1
             43639.84     1
             47730.06     1
             48169.06     1
             48323.11     1
             48419.84     1
             48877.02     1
             48912.85     1
             49298.46     1
             49442.58     1
             54184.40     1
             54691.44     1
             55247.53     1
             55396.83     1
             57435.84     1
             60485.85     1
             61558.64     1
             61577.67     1
             61631.35     1
             61967.51     1
             62434.54     1
             62542.88     1
             63727.56     1
             67794.58     1
             69379.38     1
             72800.41     1
             73962.60     1
             78394.98     1
             80319.34     1
             84136.97     1
             97062.30     1
             111595.32    1
             140344.67    1
             143224.94    1
             158531.76    1
             202785.71    1
Switzerland  162.00       1
             432.00       1
             980.98       1
             1476.00      1
             1495.00      1
             1626.00      1
             2520.00      1
             3174.39      1
             4319.84      1
             4431.00      1
             8768.32      1
             10704.89     1
             12435.06     1
             12489.00     1
             12767.30     1
             13492.50     1
             14002.14     1
             14088.60     1
             16398.00     1
             18653.00     1
             18914.40     1
             23338.18     1
             26309.18     1
             29001.72     1
             35225.54     1
             36504.00     1
             40519.45     1
             45478.40     1
             63703.58     1
             65256.01     1
             67935.84     1
             76410.11     1
             77694.23     1
             104014.05    1
             104632.96    1
             106754.27    1
             122745.56    1
             142960.46    1
             145626.28    1
             162046.32    1
             164414.67    1
             172864.08    1
             191646.05    1
             207907.56    1
             217501.47    1
             224548.84    1
             228594.58    1
             270909.53    1
Name: Year, dtype: int64

In [347]:
temp2.columns

Index(['Year', 'Retailer', 'country', 'Revenue', 'Planned', 'revenue',
       'Product.3', 'cost', 'Quantity', 'Unit', 'cost.1', 'Unit.1', 'price',
       'Gross', 'profit', 'Unit.2', 'sale', 'price.1', 'Product line',
       'Product type', 'Product', 'Order method type'],
      dtype='object')

In [348]:
temp2["Retailer country"] = temp2["Retailer"]
temp2 = temp2.drop(["Retailer"], axis=1)

temp2["Planned revenue"] = temp2["Revenue"]
temp2 = temp2.drop(["Revenue"], axis=1)

temp2["Revenue"] = temp2["country"]
temp2 = temp2.drop(["country"], axis=1)

temp2["Product cost"] = temp2["Planned"]
temp2 = temp2.drop(["Planned"], axis=1)

temp2["Gross profit"] = temp2["Quantity"]
temp2 = temp2.drop(["Quantity"], axis=1)

temp2["Quantity"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Unit cost"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Unit price"] = temp2["cost"]
temp2 = temp2.drop(["cost"], axis=1)

temp2["Unit sale price"] = temp2["Unit"]
temp2 = temp2.drop(['Unit', 'cost.1', 'Unit.1', 'price', 'Gross', 'profit', 'Unit.2', 'sale', 'price.1'], axis=1)

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Planned revenue,Revenue,Product cost,Gross profit,Quantity,Unit cost,Unit price,Unit sale price
1,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone,Canada,14313.5,13444.7,6298.8,7145.88,2172,2.9,6.59,6.190
2,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone,Mexico,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone,Japan,235237,181120,89413.1,91707.18,35696,2.657,6.59,5.488
5,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone,Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [349]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
1,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone,Canada,13444.7,14313.5,6298.8,2172,2.9,6.59,7145.88,6.190
2,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone,Mexico,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone,Japan,181120,235237,89413.1,35696,2.657,6.59,91707.18,5.488
5,2004,Camping Equipment,Cooking Gear,TrailChef Water Bag,Telephone,Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [350]:
str16 = temp2

In [353]:
temp = copy.deepcopy(tmp2[~tmp2.index.isin(tmp3.index.values)])
temp.head()

,Year,Product.2,Order,method,type.1,Retailer,country,Revenue,Planned,revenue,...,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type
147,2004,TrailChef,Canteen,Telephone,United,States,209592,235238,124284,18774,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
148,2004,TrailChef,Canteen,Telephone,Canada,8489.36,12129,6408.16,968,6.62,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
149,2004,TrailChef,Canteen,Telephone,Mexico,11962.3,17090.9,9029.68,1364,6.62,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
150,2004,TrailChef,Canteen,Telephone,Brazil,7919.31,11314.6,5977.86,903,6.62,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear
151,2004,TrailChef,Canteen,Telephone,Japan,107959,124486,65769.7,9935,6.62,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear

In [357]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp.groupby(["Product.2", "Order", "method"])["Year"].count())

Product.2   Order      method
Aloe        Relief     E-mail       63
                       Fax          63
                       Mail         63
                       Sales        63
                       Special      63
                       Telephone    63
                       Web          63
BugShield   Extreme    E-mail       63
                       Fax          63
                       Mail         63
                       Sales        63
                       Special      63
                       Telephone    63
                       Web          63
            Lotion     E-mail       63
                       Fax          63
                       Mail         63
                       Sales        63
                       Special      63
                       Telephone    63
                       Web          63
            Natural    E-mail       63
                       Fax          63
                       Mail         63
                       Sales        63
                       Special      63
                       Telephone    63
                       Web          63
            Spray      E-mail       63
                       Fax          63
                       Mail         63
                       Sales        63
                       Special      63
                       Telephone    63
                       Web          63
Calamine    Relief     E-mail       63
                       Fax          63
                       Mail         63
                       Sales        63
                       Special      63
                       Telephone    63
                       Web          63
Firefly     Charger    E-mail       63
                       Fax          63
                       Mail         63
                       Sales        63
                       Special      63
                       Telephone    63
                       Web          63
Granite     Belay      E-mail       63
                       Fax          63
                       Mail         63
                       Sales        63
                       Special      63
                       Telephone    63
                       Web          63
            Carabiner  E-mail       63
                       Fax          63
                       Mail         63
                       Sales        63
                       Special      63
                       Telephone    63
                       Web          63
            Pulley     E-mail       63
                       Fax          63
                       Mail         63
                       Sales        63
                       Special      63
                       Telephone    63
                       Web          63
Hibernator  Extreme    E-mail       63
                       Fax          63
                       Mail         63
                       Sales        63
                       Special      63
                       Telephone    63
                       Web          63
            Lite       E-mail       63
                       Fax          63
                       Mail         63
                       Sales        63
                       Special      63
                       Telephone    63
                       Web          63
            Pad        E-mail       63
                       Fax          63
                       Mail         63
                       Sales        63
                       Special      63
                       Telephone    63
                       Web          63
            Pillow     E-mail       63
                       Fax          63
                       Mail         63
                       Sales        63
                       Special      63
                       Telephone    63
                       Web          63
TrailChef   Canteen    E-mail       84
                       Fax          84
                       Mail         84
                       Sales        84
                       Special      84
                       Telephone    84
                       Web          84
            Cup        E-mail       84
                       Fax          84
                       Mail         84
                       Sales        84
                       Special      84
                       Telephone    84
                       Web          84
            Kettle     E-mail       84
                       Fax          84
                       Mail         84
                       Sales        84
                       Special      84
                       Telephone    84
                       Web          84
            Utensils   E-mail       84
                       Fax          84
                       Mail         84
                       Sales        84
                       Special      84
                       Telephone    84
                       Web          84
Name: Year, dtype: int64

In [358]:
temp["Product"] = temp["Product.2"] + " " + ["Order"]
temp = temp.drop(["Product.2", "Order"], axis=1)
temp.head()

,Year,method,type.1,Retailer,country,Revenue,Planned,revenue,Product.3,cost,...,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
147,2004,Telephone,United,States,209592,235238,124284,18774,6.62,12.53,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order
148,2004,Telephone,Canada,8489.36,12129,6408.16,968,6.62,12.53,2081.20,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order
149,2004,Telephone,Mexico,11962.3,17090.9,9029.68,1364,6.62,12.53,2932.60,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order
150,2004,Telephone,Brazil,7919.31,11314.6,5977.86,903,6.62,12.53,1941.45,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order
151,2004,Telephone,Japan,107959,124486,65769.7,9935,6.62,12.53,42189.47,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order

In [360]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp.groupby(["method", "type.1"])["Year"].count())

method     type.1
E-mail     Australia        58
           Austria          58
           Belgium          58
           Brazil           58
           Canada           58
           China            58
           Denmark          58
           Finland          58
           France           58
           Germany          58
           Italy            58
           Japan            58
           Korea            58
           Mexico           58
           Netherlands      58
           Singapore        58
           Spain            58
           Sweden           58
           Switzerland      58
           United          116
Fax        Australia        58
           Austria          58
           Belgium          58
           Brazil           58
           Canada           58
           China            58
           Denmark          58
           Finland          58
           France           58
           Germany          58
           Italy            58
           Japan            58
           Korea            58
           Mexico           58
           Netherlands      58
           Singapore        58
           Spain            58
           Sweden           58
           Switzerland      58
           United          116
Mail       Australia        58
           Austria          58
           Belgium          58
           Brazil           58
           Canada           58
           China            58
           Denmark          58
           Finland          58
           France           58
           Germany          58
           Italy            58
           Japan            58
           Korea            58
           Mexico           58
           Netherlands      58
           Singapore        58
           Spain            58
           Sweden           58
           Switzerland      58
           United          116
Sales      visit          1218
Special    Australia        58
           Austria          58
           Belgium          58
           Brazil           58
           Canada           58
           China            58
           Denmark          58
           Finland          58
           France           58
           Germany          58
           Italy            58
           Japan            58
           Korea            58
           Mexico           58
           Netherlands      58
           Singapore        58
           Spain            58
           Sweden           58
           Switzerland      58
           United          116
Telephone  Australia        58
           Austria          58
           Belgium          58
           Brazil           58
           Canada           58
           China            58
           Denmark          58
           Finland          58
           France           58
           Germany          58
           Italy            58
           Japan            58
           Korea            58
           Mexico           58
           Netherlands      58
           Singapore        58
           Spain            58
           Sweden           58
           Switzerland      58
           United          116
Web        Australia        58
           Austria          58
           Belgium          58
           Brazil           58
           Canada           58
           China            58
           Denmark          58
           Finland          58
           France           58
           Germany          58
           Italy            58
           Japan            58
           Korea            58
           Mexico           58
           Netherlands      58
           Singapore        58
           Spain            58
           Sweden           58
           Switzerland      58
           United          116
Name: Year, dtype: int64

In [365]:
temp1 = copy.deepcopy(temp[temp["type.1"] == "visit"])
temp1.head()

,Year,method,type.1,Retailer,country,Revenue,Planned,revenue,Product.3,cost,...,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
168,2004,Sales,visit,United,States,58425.6,66045.6,34894,5271,6.62,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order
169,2004,Sales,visit,Canada,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order
170,2004,Sales,visit,Mexico,54227.7,58853.4,31094.1,4697,6.62,12.53,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order
171,2004,Sales,visit,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order
172,2004,Sales,visit,Japan,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order

In [366]:
temp1.groupby(["method", "type.1", "Retailer"])["Year"].count()

method  type.1  Retailer
Sales   visit   Australia       58
                Austria         58
                Belgium         58
                Brazil          58
                Canada          58
                China           58
                Denmark         58
                Finland         58
                France          58
                Germany         58
                Italy           58
                Japan           58
                Korea           58
                Mexico          58
                Netherlands     58
                Singapore       58
                Spain           58
                Sweden          58
                Switzerland     58
                United         116
Name: Year, dtype: int64

In [367]:
temp1["Order method type"] = temp1["method"] + " " + temp1["type.1"]
temp1 = temp1.drop(["method", "type.1"], axis=1)
temp1.head()

,Year,Retailer,country,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
168,2004,United,States,58425.6,66045.6,34894,5271,6.62,12.53,23531.5700,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit
169,2004,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit
170,2004,Mexico,54227.7,58853.4,31094.1,4697,6.62,12.53,23133.53,11.6375,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit
171,2004,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit
172,2004,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit

In [368]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp1.groupby(["Retailer", "country", "Revenue"])["Year"].count())

8    1
             478081.62  502705.44    1
Belgium      0          203.00       1
             186        186.00       1
             372        372.00       1
             444        444.00       1
             831.57     831.57       1
             1610.68    1610.68      1
             2214       2214.00      1
             2298.48    2298.48      1
             2566.27    2566.27      1
             4493.2     5842.15      1
             4860       5012.00      1
             5851.7     5965.80      1
             7084       7084.00      1
             7095.62    7175.00      1
             10207.74   10207.74     1
             10350.12   12276.30     1
             10754.12   12619.75     1
             13612.98   14034.00     1
             14282.07   17729.95     1
             15063.5    15533.50     1
             15205.68   15516.00     1
             15248.65   15721.35     1
             16152.96   16872.00     1
             18542.73   18827.04     1
             23039.5    24774.75     1
             28730.16   29930.08     1
             32103.12   33369.00     1
             33027.48   33701.64     1
             33769.49   34702.71     1
             40964      41800.00     1
             47747      50260.00     1
             61598.6    64316.00     1
             61982.84   64688.00     1
             66421.72   68476.00     1
             69042.4    74239.20     1
             76657      81550.00     1
             78519.65   80650.78     1
             85932.36   90450.36     1
             86966.36   92522.43     1
             169899.78  178439.22    1
             398020.31  423428.58    1
Canada       234        234.00       1
             2664       2664.00      1
             6390.36    6588.00      1
             6510.71    6679.50      1
             8448.64    8620.64      1
             8800.8     9264.00      1
             9325.58    9614.00      1
             15319.36   16513.00     1
             17472.53   17813.22     1
             18312.2    19276.00     1
             19565.14   23421.55     1
             21548.1    23170.00     1
             21690.8    22361.78     1
             23359      24850.00     1
             24195.66   24827.16     1
             30569.48   32522.49     1
             49984.55   52997.00     1
             50477.28   51503.55     1
             55496.34   56519.70     1
             75090.78   76623.54     1
             79426.72   83380.00     1
             85884.18   87856.00     1
             102433.53  108972.54    1
             116907     123060.00    1
             410458.8   430057.08    1
China        618        618.00       1
             1716       1716.00      1
             1736.36    1736.36      1
             4515       4515.00      1
             5493.14    5493.14      1
             6395.22    6668.52      1
             8650       8825.00      1
             10875      11437.50     1
             21942.72   22854.72     1
             24897.6    26208.00     1
             25186      25965.10     1
             31037.4    32327.40     1
             35465.8    36940.35     1
             80784.72   85945.86     1
             108165.82  115070.76    1
             149364.84  157228.02    1
             156891.34  202318.88    1
             228182.94  240179.94    1
Denmark      738        738.00       1
             852.49     852.49       1
             1038       1038.00      1
             2810.97    2865.78      1
             3341.97    3341.97      1
             3587.78    3661.00      1
             3676.16    3747.84      1
             6548.85    6753.67      1
             6620.25    6825.00      1
             6755.83    6893.47      1
             7711.86    7861.08      1
             8477.45    8739.75      1
             15007.77   15314.11     1
             15670.2    15990.00     1
             16087.68   16416.00     1
             16939.5    17399.58     1
             18221      19180.00     1
             22318.08   23248.00     1
             25253.76   26306.00     1
             25827.4    27477.45     1
             34521.2    37119.60     1
             35729.4    38010.00     1
             37743.63   46759.14     1
             41467.5    42750.00     1
             41555.83   43163.30     1
             45128.19   46260.27     1
             64733.16   68140.98     1
             125611.92  133630.56    1
Finland      534        534.00       1
             1302.27    1302.27      1
             1674       1674.00      1
             4784.13    4988.58      1
             4863.9     4863.90      1
             5755.54    5873.00      1
             6591.2     6795.25      1
             8721.75    9084.25      1
             9930.54    10132.86     1
             11141.2    11366.60     1
             14782.74   15397.62     1
             18122.64   18792.00     1
             20548.96   21764.00     1
             23327.04   24816.00     1
             28109.76   29281.00     1
             28965.28   30169.56     1
             28989.03   31171.00     1
             29572.5    30487.50     1
             35053.86   36138.00     1
             41519.8    44170.00     1
             41861.96   44534.00     1
             42308.9    45495.45     1
             46944.19   47902.96     1
             48691      51801.75     1
             63991.3    73617.15     1
             83492.05   88821.90     1
             98507.56   104371.90    1
             128714.76  138403.08    1
France       230.12     1077.38      1
             330        330.00       1
             384        384.00       1
             1106       1106.00      1
             1394.32    2367.94      1
             2060.62    2060.62      1
             3295.6     5482.68      1
             4411.56    4548.00      1
             5182.16    5287.66      1
             7440       7440.00      1
             8429.6     8690.36      1
             8588.38    8854.00      1
             8895.6     8895.60      1
             9672.6     10290.00     1
             9846       9846.00      1
             10891.01   14698.56     1
             11035.68   11260.05     1
             12689.97   12891.45     1
             14069.12   23456.64     1
             17740.71   18376.86     1
             17761.08   17761.08     1
             17792.46   19005.00     1
             19474.3    24631.80     1
             20836.98   21707.24     1
             24127.06   26333.80     1
             27954.02   30886.45     1
             28026.6    28532.00     1
             30085.36   31528.00     1
             30384.45   31981.95     1
             30591.02   31158.12     1
             31373.94   32252.88     1
             35750.4    36480.00     1
             38173.83   50173.29     1
             39408.73   56013.14     1
             42056.65   51936.85     1
             46581.81   54988.77     1
             47003.39   48674.99     1
             49281.28   52455.80     1
             52734.5    55510.00     1
             67599.54   71202.00     1
             69521.76   79999.20     1
             80993.08   83979.00     1
             87372.66   90817.32     1
             93666.66   124096.14    1
             139552.64  148468.32    1
             140218.06  155811.45    1
             170670.8   191994.06    1
             173771.1   181090.62    1
             209543.88  225316.00    1
             287512.28  309153.24    1
             342660.2   368468.10    1
Germany      1188       1188.00      1
             2479.02    2479.02      1
             3252.4     3318.20      1
             5658       5658.00      1
             9218.09    9439.14      1
             9935.79    10140.09     1
             10500.17   10873.86     1
             10706.08   10787.00     1
             11339.3    11690.00     1
             12502.45   12699.13     1
             12729.82   12729.82     1
             15044.96   15352.00     1
             15554.2    17385.25     1
             19612.92   20160.77     1
             29262.44   30169.56     1
             34698.4    35772.00     1
             36158.61   44218.37     1
             37792.56   39089.04     1
             40658.84   42357.30     1
             41160      42000.00     1
             44687.76   46760.00     1
             45337.8    46740.00     1
             51029.79   53305.00     1
             52478.35   54049.80     1
             53692.8    57120.00     1
             68351.94   71700.00     1
             83552.82   86789.30     1
             87566.92   100908.26    1
             92424.53   96102.78     1
             161360.28  173513.34    1
             178166.72  189549.36    1
             247822.68  266476.00    1
             287112.96  305441.28    1
             421405.22  453124.26    1
Italy        611.91     611.91       1
             1644       1644.00      1
             5188.16    5188.16      1
             5508       5508.00      1
             5536       5648.00      1
             10473.3    10800.86     1
             11574.04   11932.00     1
             11592.42   11951.10     1
             11976.2    12346.67     1
             13319.6    13732.32     1
             16333.83   16840.17     1
             16947.82   17560.68     1
             25376.46   26431.98     1
             25859.12   28416.50     1
             31613.61   32788.00     1
             41831.92   44504.46     1
             42125.16   44814.00     1
             43504.5    44850.00     1
             55090.8    58266.00     1
             56161.63   61610.01     1
             58284.48   60532.02     1
             58608.04   61056.30     1
             92950.6    108575.86    1
             107994.39  116123.00    1
             139568.8   148478.40    1
             203082.72  218378.16    1
             342746.2   368544.60    1
Japan        216        216.00       1
             611.91     611.91       1
             5616.6     9343.98      1
             6394.64    6394.64      1
             7305.9     7455.00      1
             7749.72    11066.55     1
             9500.76    9895.77      1
             10965.95   11305.74     1
             20824.29   21694.02     1
             37563.06   44357.31     1
             38177.16   40614.00     1
             39361.26   39968.88     1
Korea        702        702.00       1
             862.95     862.95       1
             6188.13    6452.58      1
             6577.2     6712.92      1
             11744.32   12107.90     1
             12096      12096.00     1
             12133.6    12133.60     1
             14961.62   21376.18     1
             17191.48   17723.40     1
             17282.31   18131.64     1
             22483.65   23667.00     1
             30078.72   31332.00     1
             30689.67   32640.18     1
             40392.54   42514.74     1
             42141.6    43902.00     1
             48606.32   51711.66     1
             79294.15   88273.85     1
             82959.6    85525.86     1
             100470.96  106884.00    1
             108648.96  115584.00    1
             118961.28  122854.00    1
             124999.99  130709.04    1
             135284.8   143920.00    1
             146764.26  172706.08    1
             200711.34  215658.00    1
             310153.56  333513.18    1
             378458.85  406945.00    1
             437398.65  465320.70    1
             689437.68  741331.44    1
Mexico       432        432.00       1
             460.24     2730.06      1
             3885       3885.00      1
             3943.42    3943.42      1
             5880       5880.00      1
             7055.1     7356.60      1
             8029.28    8277.85      1
             8524.95    8524.95      1
             8534.2     11142.54     1
             9654.58    9654.58      1
             12672      12672.00     1
             13286.52   16614.78     1
             19964.2    20368.10     1
             23381.99   24105.45     1
             25902      25902.00     1
             26221.44   27316.80     1
             26476.8    27580.00     1
             28764      30600.00     1
             30954.06   32171.40     1
             34874      37100.00     1
             38256.16   43524.72     1
             40541.2    41517.00     1
             43880.85   44776.55     1
             49244.96   50768.00     1
             49909.4    51453.29     1
             51683.8    54404.00     1
             53192.59   54276.31     1
             54227.67   58853.41     1
             54378.42   56154.00     1
             61963.55   93054.96     1
             61996.16   65253.92     1
             63620.36   65588.00     1
             65469.73   68087.29     1
             71953      75740.00     1
             73934.35   78295.00     1
             76443.06   88560.78     1
             81481.68   85765.68     1
             93266.89   111502.95    1
             96505.26   101694.00    1
             100056.55  108397.03    1
             108380.94  112518.57    1
             114770.37  118691.37    1
             139561.43  146305.74    1
             225703.32  242702.46    1
             225708.21  242697.00    1
             230722.08  242868.24    1
             429049.2   461343.60    1
             455155     484233.75    1
             614850.41  654100.38    1
Netherlands  2226       2226.00      1
             2712       2712.00      1
             3987.53    4068.77      1
             4906.1     5058.12      1
             4907.53    5003.22      1
             10189.6    10840.00     1
             11525.45   11525.45     1
             12716.7    13110.00     1
             13158.4    13565.44     1
             14659.82   15351.00     1
             16055.2    17080.00     1
             20802.32   21225.82     1
             21395.16   21831.88     1
             21415.66   22078.00     1
             24327.6    25608.00     1
             30318.24   30934.65     1
             39368      41440.00     1
             57821.36   61512.48     1
             86571.05   88618.26     1
             162963.36  171531.36    1
             246073.68  258246.36    1
Singapore    8113.7     8277.85      1
             10728      10728.00     1
             12117.91   12117.91     1
             12927.6    13331.92     1
             18648      19425.00     1
             21175.77   22183.26     1
             24348.48   25365.60     1
             28146.06   46910.10     1
             28737.28   30247.36     1
             30712.88   34205.70     1
             37548.55   62596.70     1
             58962.18   63090.00     1
             70615.75   73965.07     1
             75814.41   79378.35     1
             77432.45   86820.37     1
             134695.09  143357.68    1
             137838.22  148213.26    1
             145860.98  156846.69    1
             211223.46  227122.00    1
Spain        5270.12    5372.88      1
             16177.28   17027.36     1
             25634.96   26982.02     1
             47589.94   51172.02     1
             56636.59   58776.63     1
Sweden       491.62     491.62       1
             774        774.00       1
             3318       3318.00      1
             5630.35    5630.35      1
             6574.94    6574.94      1
             8404       13981.20     1
             11186      11186.00     1
             24853.41   41422.35     1
             26078.65   32623.99     1
             29729.7    30343.17     1
             40317.59   55087.74     1
             49620.36   52232.58     1
Switzerland  313.8      313.80       1
             972        972.00       1
             1206       1206.00      1
             1265.66    1265.66      1
             2478       2478.00      1
             5158.54    6442.25      1
             5401.2     5401.20      1
             5684       5684.00      1
             6954.36    7140.66      1
             9112.18    9394.00      1
             10720.61   13212.60     1
             11334.86   11334.86     1
             13090      13090.00     1
             13702.5    13985.25     1
             14081.43   14081.43     1
             14783.11   20853.45     1
             15588.32   22275.44     1
             15589      15589.00     1
             18886.29   23456.85     1
             19627.32   20121.75     1
             19640.24   20253.04     1
             22214.92   24521.21     1
             23273.46   24245.48     1
             25806.3    28831.53     1
             32800.98   42206.52     1
             88463.55   118821.36    1
             88914      94594.50     1
             93036.33   97927.83     1
             98485.08   103669.74    1
             99193.54   105525.72    1
United       Kingdom    264.00       1
                        2085.47      1
                        2639.00      1
                        5101.39      1
                        7668.00      1
                        8591.12      1
                        8654.34      1
                        8766.60      1
                        11426.60     1
                        11976.20     1
                        12622.32     1
                        12836.18     1
                        13761.07     1
                        14476.00     1
                        14581.44     1
                        18793.53     1
                        19865.02     1
                        22766.91     1
                        28908.13     1
                        36996.80     1
                        39111.96     1
                        39635.99     1
                        43398.08     1
                        52722.34     1
                        55034.37     1
                        56406.01     1
                        59565.97     1
                        59983.00     1
             States     345.18       1
                        793.32       1
                        1050.00      1
                        2196.60      1
                        2328.00      1
                        5458.05      1
                        9603.00      1
                        10258.90     1
                        11641.00     1
                        11644.36     1
                        12204.00     1
                        17196.24     1
                        17848.01     1
                        19881.19     1
                        20258.97     1
                        20348.51     1
                        21021.41     1
                        27948.96     1
                        28676.43     1
                        31504.20     1
                        31785.57     1
                        32784.80     1
                        37150.96     1
                        43254.71     1
                        46050.20     1
                        47405.02     1
                        52130.72     1
                        55372.60     1
                        58425.59     1
                        58919.00     1
                        60325.89     1
                        68990.75     1
                        79452.24     1
                        80481.81     1
                        84690.88     1
                        85245.40     1
                        85688.36     1
                        88236.56     1
                        97052.45     1
                        97114.30     1
                        107544.18    1
                        108792.86    1
                        119176.05    1
                        121437.93    1
                        127161.20    1
                        149563.40    1
                        172693.03    1
                        176285.18    1
                        275556.72    1
                        294067.80    1
                        368122.59    1
                        387494.73    1
                        448115.54    1
                        957223.56    1
Name: Year, dtype: int64

In [369]:
temp2 = copy.deepcopy(temp1[temp1["country"].isin(["Kingdom", "States"])])
temp2.head()

,Year,Retailer,country,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
168,2004,United,States,58425.6,66045.6,34894,5271,6.620,12.53,23531.57,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit
183,2004,United,Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit
462,2004,United,States,11644.4,12118.3,2814.35,3311,0.850,3.66,8830.01,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit
477,2004,United,Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit
1197,2004,United,States,176285,216266,87415.3,16359,5.425,13.22,88869.88,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit

In [370]:
temp2.groupby(["Retailer", "country", "Revenue"])["Year"].count()

Retailer  country  Revenue
United    Kingdom  264.00       1
                   2085.47      1
                   2639.00      1
                   5101.39      1
                   7668.00      1
                               ..
          States   294067.80    1
                   368122.59    1
                   387494.73    1
                   448115.54    1
                   957223.56    1
Name: Year, Length: 82, dtype: int64

In [371]:
temp2.columns

Index(['Year', 'Retailer', 'country', 'Revenue', 'Planned', 'revenue',
       'Product.3', 'cost', 'Quantity', 'Unit', 'cost.1', 'Unit.1', 'price',
       'Gross', 'profit', 'Unit.2', 'sale', 'price.1', 'Product line',
       'Product type', 'Product', 'Order method type'],
      dtype='object')

In [372]:
temp2["Retailer country"] = temp2["Retailer"] + " " + temp2["country"]
temp2 = temp2.drop(["Retailer", "country"], axis=1)

temp2["Planned revenue"] = temp2["Planned"]
temp2 = temp2.drop(["Planned"], axis=1)

temp2["Product cost"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Unit price"] = temp2["Quantity"]
temp2 = temp2.drop(["Quantity"], axis=1)

temp2["Quantity"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Unit cost"] = temp2["cost"]
temp2 = temp2.drop(["cost"], axis=1)

temp2["Gross profit"] = temp2["Unit"]
temp2 = temp2.drop(["Unit"], axis=1)

temp2["Unit sale price"] = temp2["cost.1"]
temp2 = temp2.drop(['cost.1', 'Unit.1', 'price', 'Gross', 'profit', 'Unit.2', 'sale', 'price.1'], axis=1)

temp2.head()

,Year,Revenue,Product line,Product type,Product,Order method type,Retailer country,Planned revenue,Product cost,Unit price,Quantity,Unit cost,Gross profit,Unit sale price
168,2004,58425.6,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,United States,66045.6,34894,12.53,5271,6.620,23531.57,11.486667
183,2004,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,United Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN
462,2004,11644.4,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,United States,12118.3,2814.35,3.66,3311,0.850,8830.01,3.526667
477,2004,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,United Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1197,2004,176285,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,United States,216266,87415.3,13.22,16359,5.425,88869.88,11.303750

In [373]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
168,2004,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,United States,58425.6,66045.6,34894,5271,6.620,12.53,23531.57,11.486667
183,2004,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,United Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
462,2004,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,United States,11644.4,12118.3,2814.35,3311,0.850,3.66,8830.01,3.526667
477,2004,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,United Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1197,2004,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,United States,176285,216266,87415.3,16359,5.425,13.22,88869.88,11.303750

In [374]:
str17 = temp2

In [375]:
temp2 = copy.deepcopy(temp1[~temp1["country"].isin(["Kingdom", "States"])])
temp2.head()

,Year,Retailer,country,Revenue,Planned,revenue,Product.3,cost,Quantity,Unit,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
169,2004,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit
170,2004,Mexico,54227.7,58853.4,31094.1,4697,6.62,12.53,23133.53,11.637500,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit
171,2004,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit
172,2004,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit
173,2004,Korea,79294.1,88273.9,46637.9,7045,6.62,12.53,32656.25,11.545714,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit

In [377]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp2.groupby(["Retailer", "country"])["Year"].count())

Retailer     country
Australia    1326.00      1
             1746.82      1
             2058.00      1
             2212.29      1
             2862.00      1
             5194.73      1
             5897.24      1
             7628.88      1
             9525.85      1
             10906.00     1
             10978.32     1
             13726.20     1
             14302.56     1
             16087.68     1
             16576.00     1
             16825.32     1
             20562.29     1
             21543.21     1
             24486.03     1
             25928.10     1
             27518.40     1
             28418.04     1
             35306.28     1
             38113.24     1
             43586.48     1
             51521.12     1
             51867.54     1
             52047.80     1
             57778.56     1
             58150.40     1
             95195.01     1
             95519.04     1
             270663.78    1
Austria      0.00         1
             266.73       1
             402.00       1
             3080.00      1
             4305.00      1
             6036.00      1
             6218.10      1
             6791.85      1
             7772.35      1
             12451.00     1
             18255.68     1
             21286.81     1
             23209.75     1
             24641.88     1
             25438.36     1
             27126.52     1
             36605.19     1
             57236.12     1
             64073.52     1
             69005.72     1
             78121.69     1
             82127.50     1
             99378.19     1
             230408.28    1
             478081.62    1
Belgium      0.00         1
             186.00       1
             372.00       1
             444.00       1
             831.57       1
             1610.68      1
             2214.00      1
             2298.48      1
             2566.27      1
             4493.20      1
             4860.00      1
             5851.70      1
             7084.00      1
             7095.62      1
             10207.74     1
             10350.12     1
             10754.12     1
             13612.98     1
             14282.07     1
             15063.50     1
             15205.68     1
             15248.65     1
             16152.96     1
             18542.73     1
             23039.50     1
             28730.16     1
             32103.12     1
             33027.48     1
             33769.49     1
             40964.00     1
             47747.00     1
             61598.60     1
             61982.84     1
             66421.72     1
             69042.40     1
             76657.00     1
             78519.65     1
             85932.36     1
             86966.36     1
             169899.78    1
             398020.31    1
Canada       234.00       1
             2664.00      1
             6390.36      1
             6510.71      1
             8448.64      1
             8800.80      1
             9325.58      1
             15319.36     1
             17472.53     1
             18312.20     1
             19565.14     1
             21548.10     1
             21690.80     1
             23359.00     1
             24195.66     1
             30569.48     1
             49984.55     1
             50477.28     1
             55496.34     1
             75090.78     1
             79426.72     1
             85884.18     1
             102433.53    1
             116907.00    1
             410458.80    1
China        618.00       1
             1716.00      1
             1736.36      1
             4515.00      1
             5493.14      1
             6395.22      1
             8650.00      1
             10875.00     1
             21942.72     1
             24897.60     1
             25186.00     1
             31037.40     1
             35465.80     1
             80784.72     1
             108165.82    1
             149364.84    1
             156891.34    1
             228182.94    1
Denmark      738.00       1
             852.49       1
             1038.00      1
             2810.97      1
             3341.97      1
             3587.78      1
             3676.16      1
             6548.85      1
             6620.25      1
             6755.83      1
             7711.86      1
             8477.45      1
             15007.77     1
             15670.20     1
             16087.68     1
             16939.50     1
             18221.00     1
             22318.08     1
             25253.76     1
             25827.40     1
             34521.20     1
             35729.40     1
             37743.63     1
             41467.50     1
             41555.83     1
             45128.19     1
             64733.16     1
             125611.92    1
Finland      534.00       1
             1302.27      1
             1674.00      1
             4784.13      1
             4863.90      1
             5755.54      1
             6591.20      1
             8721.75      1
             9930.54      1
             11141.20     1
             14782.74     1
             18122.64     1
             20548.96     1
             23327.04     1
             28109.76     1
             28965.28     1
             28989.03     1
             29572.50     1
             35053.86     1
             41519.80     1
             41861.96     1
             42308.90     1
             46944.19     1
             48691.00     1
             63991.30     1
             83492.05     1
             98507.56     1
             128714.76    1
France       230.12       1
             330.00       1
             384.00       1
             1106.00      1
             1394.32      1
             2060.62      1
             3295.60      1
             4411.56      1
             5182.16      1
             7440.00      1
             8429.60      1
             8588.38      1
             8895.60      1
             9672.60      1
             9846.00      1
             10891.01     1
             11035.68     1
             12689.97     1
             14069.12     1
             17740.71     1
             17761.08     1
             17792.46     1
             19474.30     1
             20836.98     1
             24127.06     1
             27954.02     1
             28026.60     1
             30085.36     1
             30384.45     1
             30591.02     1
             31373.94     1
             35750.40     1
             38173.83     1
             39408.73     1
             42056.65     1
             46581.81     1
             47003.39     1
             49281.28     1
             52734.50     1
             67599.54     1
             69521.76     1
             80993.08     1
             87372.66     1
             93666.66     1
             139552.64    1
             140218.06    1
             170670.80    1
             173771.10    1
             209543.88    1
             287512.28    1
             342660.20    1
Germany      1188.00      1
             2479.02      1
             3252.40      1
             5658.00      1
             9218.09      1
             9935.79      1
             10500.17     1
             10706.08     1
             11339.30     1
             12502.45     1
             12729.82     1
             15044.96     1
             15554.20     1
             19612.92     1
             29262.44     1
             34698.40     1
             36158.61     1
             37792.56     1
             40658.84     1
             41160.00     1
             44687.76     1
             45337.80     1
             51029.79     1
             52478.35     1
             53692.80     1
             68351.94     1
             83552.82     1
             87566.92     1
             92424.53     1
             161360.28    1
             178166.72    1
             247822.68    1
             287112.96    1
             421405.22    1
Italy        611.91       1
             1644.00      1
             5188.16      1
             5508.00      1
             5536.00      1
             10473.30     1
             11574.04     1
             11592.42     1
             11976.20     1
             13319.60     1
             16333.83     1
             16947.82     1
             25376.46     1
             25859.12     1
             31613.61     1
             41831.92     1
             42125.16     1
             43504.50     1
             55090.80     1
             56161.63     1
             58284.48     1
             58608.04     1
             92950.60     1
             107994.39    1
             139568.80    1
             203082.72    1
             342746.20    1
Japan        216.00       1
             611.91       1
             5616.60      1
             6394.64      1
             7305.90      1
             7749.72      1
             9500.76      1
             10965.95     1
             20824.29     1
             37563.06     1
             38177.16     1
             39361.26     1
Korea        702.00       1
             862.95       1
             6188.13      1
             6577.20      1
             11744.32     1
             12096.00     1
             12133.60     1
             14961.62     1
             17191.48     1
             17282.31     1
             22483.65     1
             30078.72     1
             30689.67     1
             40392.54     1
             42141.60     1
             48606.32     1
             79294.15     1
             82959.60     1
             100470.96    1
             108648.96    1
             118961.28    1
             124999.99    1
             135284.80    1
             146764.26    1
             200711.34    1
             310153.56    1
             378458.85    1
             437398.65    1
             689437.68    1
Mexico       432.00       1
             460.24       1
             3885.00      1
             3943.42      1
             5880.00      1
             7055.10      1
             8029.28      1
             8524.95      1
             8534.20      1
             9654.58      1
             12672.00     1
             13286.52     1
             19964.20     1
             23381.99     1
             25902.00     1
             26221.44     1
             26476.80     1
             28764.00     1
             30954.06     1
             34874.00     1
             38256.16     1
             40541.20     1
             43880.85     1
             49244.96     1
             49909.40     1
             51683.80     1
             53192.59     1
             54227.67     1
             54378.42     1
             61963.55     1
             61996.16     1
             63620.36     1
             65469.73     1
             71953.00     1
             73934.35     1
             76443.06     1
             81481.68     1
             93266.89     1
             96505.26     1
             100056.55    1
             108380.94    1
             114770.37    1
             139561.43    1
             225703.32    1
             225708.21    1
             230722.08    1
             429049.20    1
             455155.00    1
             614850.41    1
Netherlands  2226.00      1
             2712.00      1
             3987.53      1
             4906.10      1
             4907.53      1
             10189.60     1
             11525.45     1
             12716.70     1
             13158.40     1
             14659.82     1
             16055.20     1
             20802.32     1
             21395.16     1
             21415.66     1
             24327.60     1
             30318.24     1
             39368.00     1
             57821.36     1
             86571.05     1
             162963.36    1
             246073.68    1
Singapore    8113.70      1
             10728.00     1
             12117.91     1
             12927.60     1
             18648.00     1
             21175.77     1
             24348.48     1
             28146.06     1
             28737.28     1
             30712.88     1
             37548.55     1
             58962.18     1
             70615.75     1
             75814.41     1
             77432.45     1
             134695.09    1
             137838.22    1
             145860.98    1
             211223.46    1
Spain        5270.12      1
             16177.28     1
             25634.96     1
             47589.94     1
             56636.59     1
Sweden       491.62       1
             774.00       1
             3318.00      1
             5630.35      1
             6574.94      1
             8404.00      1
             11186.00     1
             24853.41     1
             26078.65     1
             29729.70     1
             40317.59     1
             49620.36     1
Switzerland  313.80       1
             972.00       1
             1206.00      1
             1265.66      1
             2478.00      1
             5158.54      1
             5401.20      1
             5684.00      1
             6954.36      1
             9112.18      1
             10720.61     1
             11334.86     1
             13090.00     1
             13702.50     1
             14081.43     1
             14783.11     1
             15588.32     1
             15589.00     1
             18886.29     1
             19627.32     1
             19640.24     1
             22214.92     1
             23273.46     1
             25806.30     1
             32800.98     1
             88463.55     1
             88914.00     1
             93036.33     1
             98485.08     1
             99193.54     1
Name: Year, dtype: int64

In [378]:
temp2["Retailer country"] = temp2["Retailer"]
temp2 = temp2.drop(["Retailer"], axis=1)

temp2["Planned revenue"] = temp2["Revenue"]
temp2 = temp2.drop(["Revenue"], axis=1)

temp2["Revenue"] = temp2["country"]
temp2 = temp2.drop(["country"], axis=1)

temp2["Product cost"] = temp2["Planned"]
temp2 = temp2.drop(["Planned"], axis=1)

temp2["Gross profit"] = temp2["Quantity"]
temp2 = temp2.drop(["Quantity"], axis=1)

temp2["Quantity"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Unit cost"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Unit price"] = temp2["cost"]
temp2 = temp2.drop(["cost"], axis=1)

temp2["Unit sale price"] = temp2["Unit"]
temp2 = temp2.drop(['Unit', 'cost.1', 'Unit.1', 'price', 'Gross', 'profit', 'Unit.2', 'sale', 'price.1'], axis=1)

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Planned revenue,Revenue,Product cost,Gross profit,Quantity,Unit cost,Unit price,Unit sale price
169,2004,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
170,2004,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,Mexico,58853.4,54227.7,31094.1,23133.53,4697,6.62,12.53,11.637500
171,2004,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
172,2004,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
173,2004,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,Korea,88273.9,79294.1,46637.9,32656.25,7045,6.62,12.53,11.545714

In [379]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
169,2004,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
170,2004,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,Mexico,54227.7,58853.4,31094.1,4697,6.62,12.53,23133.53,11.637500
171,2004,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
172,2004,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
173,2004,Camping Equipment,Cooking Gear,TrailChef Order,Sales visit,Korea,79294.1,88273.9,46637.9,7045,6.62,12.53,32656.25,11.545714

In [380]:
str18 = temp2

In [381]:
temp1 = copy.deepcopy(temp[temp["type.1"] != "visit"])
temp1.head()

,Year,method,type.1,Retailer,country,Revenue,Planned,revenue,Product.3,cost,...,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
147,2004,Telephone,United,States,209592,235238,124284,18774,6.62,12.53,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order
148,2004,Telephone,Canada,8489.36,12129,6408.16,968,6.62,12.53,2081.20,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order
149,2004,Telephone,Mexico,11962.3,17090.9,9029.68,1364,6.62,12.53,2932.60,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order
150,2004,Telephone,Brazil,7919.31,11314.6,5977.86,903,6.62,12.53,1941.45,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order
151,2004,Telephone,Japan,107959,124486,65769.7,9935,6.62,12.53,42189.47,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order

In [383]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp1.groupby(["method", "type.1"])["Year"].count())

method     type.1
E-mail     Australia       58
           Austria         58
           Belgium         58
           Brazil          58
           Canada          58
           China           58
           Denmark         58
           Finland         58
           France          58
           Germany         58
           Italy           58
           Japan           58
           Korea           58
           Mexico          58
           Netherlands     58
           Singapore       58
           Spain           58
           Sweden          58
           Switzerland     58
           United         116
Fax        Australia       58
           Austria         58
           Belgium         58
           Brazil          58
           Canada          58
           China           58
           Denmark         58
           Finland         58
           France          58
           Germany         58
           Italy           58
           Japan           58
           Korea           58
           Mexico          58
           Netherlands     58
           Singapore       58
           Spain           58
           Sweden          58
           Switzerland     58
           United         116
Mail       Australia       58
           Austria         58
           Belgium         58
           Brazil          58
           Canada          58
           China           58
           Denmark         58
           Finland         58
           France          58
           Germany         58
           Italy           58
           Japan           58
           Korea           58
           Mexico          58
           Netherlands     58
           Singapore       58
           Spain           58
           Sweden          58
           Switzerland     58
           United         116
Special    Australia       58
           Austria         58
           Belgium         58
           Brazil          58
           Canada          58
           China           58
           Denmark         58
           Finland         58
           France          58
           Germany         58
           Italy           58
           Japan           58
           Korea           58
           Mexico          58
           Netherlands     58
           Singapore       58
           Spain           58
           Sweden          58
           Switzerland     58
           United         116
Telephone  Australia       58
           Austria         58
           Belgium         58
           Brazil          58
           Canada          58
           China           58
           Denmark         58
           Finland         58
           France          58
           Germany         58
           Italy           58
           Japan           58
           Korea           58
           Mexico          58
           Netherlands     58
           Singapore       58
           Spain           58
           Sweden          58
           Switzerland     58
           United         116
Web        Australia       58
           Austria         58
           Belgium         58
           Brazil          58
           Canada          58
           China           58
           Denmark         58
           Finland         58
           France          58
           Germany         58
           Italy           58
           Japan           58
           Korea           58
           Mexico          58
           Netherlands     58
           Singapore       58
           Spain           58
           Sweden          58
           Switzerland     58
           United         116
Name: Year, dtype: int64

In [384]:
temp1["Order method type"] = temp1["method"]
temp1 = temp1.drop(["method"], axis=1)
temp1.head()

,Year,type.1,Retailer,country,Revenue,Planned,revenue,Product.3,cost,Quantity,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
147,2004,United,States,209592,235238,124284,18774,6.62,12.53,85308.180000,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Telephone
148,2004,Canada,8489.36,12129,6408.16,968,6.62,12.53,2081.20,8.770000,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Telephone
149,2004,Mexico,11962.3,17090.9,9029.68,1364,6.62,12.53,2932.60,8.770000,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Telephone
150,2004,Brazil,7919.31,11314.6,5977.86,903,6.62,12.53,1941.45,8.770000,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Telephone
151,2004,Japan,107959,124486,65769.7,9935,6.62,12.53,42189.47,11.286923,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Telephone

In [385]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp1.groupby(["type.1", "Retailer", "country"])["Year"].count())

      1
             74120.94    78017.94      1
             75177.26    87844.65      1
             78532.98    81012.00      1
             82766.66    91647.95      1
             88353.44    91266.00      1
             90014.84    95765.67      1
             93853.15    103986.47     1
             97067.55    102481.44     1
             97804.12    101870.49     1
             101970.43   134759.94     1
             105382.39   120039.45     1
             112893.36   118788.00     1
             114870.52   121676.00     1
             126971.54   153497.42     1
             136123.98   140334.00     1
             136898.11   146112.33     1
             148077.68   152081.30     1
             157381.91   203892.06     1
             162986.6    173390.00     1
             171975.2    209180.76     1
             173961.7    221514.32     1
             175050.8    184264.00     1
             180597.96   190105.38     1
             181875.74   188579.04     1
             192153.08   197904.00     1
             196908.88   208565.00     1
             206845.98   232396.05     1
             214729.6    218530.76     1
             218186.5    229670.00     1
             254788.38   273966.00     1
             323977.26   348378.03     1
             326734.8    406633.98     1
             398334.72   423783.36     1
             430035.52   462404.16     1
             616761.54   649188.54     1
             693607.09   737884.62     1
             966543.84   1014160.50    1
Sweden       0           196.00        1
             210         210.00        1
             426         426.00        1
             528.23      528.23        1
             798         798.00        1
             815.88      2301.20       1
             1176.75     1176.75       1
             1256.09     1256.09       1
             1582        1582.00       1
             2052        2052.00       1
             2454        2454.00       1
             2651.61     2651.61       1
             2956.92     4663.76       1
             3221.83     3287.47       1
             3241.77     3304.98       1
             3451        3451.00       1
             3625.9      3696.60       1
             3984        3984.00       1
             4324.25     4324.25       1
             5170.24     5330.30       1
             6152.15     6342.78       1
             6336.48     6465.48       1
             6625.9      6759.95       1
             6882        6882.00       1
             7608        7608.00       1
             8173.44     8514.00       1
             10199.04    10406.40      1
             10615.68    10944.00      1
             10782.01    11003.71      1
             10881.24    11166.00      1
             11470.48    11634.00      1
             11480.7     11836.44      1
             12224.31    12831.00      1
             12341.7     12596.37      1
             12897.56    13162.76      1
             13076.61    13620.11      1
             14384.61    14678.23      1
             15006.69    15420.09      1
             15127.6     15599.60      1
             15396.41    19408.97      1
             15436.24    16247.38      1
             16008.3     16338.63      1
             16554.52    17011.68      1
             19739.05    20350.95      1
             20013.69    25790.73      1
             20397.07    20812.63      1
             20935.27    25310.10      1
             20988.96    24532.98      1
             21097.6     22208.00      1
             21553.56    22056.00      1
             22319.44    23251.80      1
             22399.44    22939.00      1
             22589.18    25843.26      1
             23557.44    24536.88      1
             24008.29    33159.51      1
             26615.52    27666.00      1
             26749.07    27735.56      1
             27603.24    29164.00      1
             27664.32    29236.00      1
             29592.06    32502.82      1
             30434.22    30734.20      1
             30583       31311.00      1
             31600.68    32715.84      1
             32216.58    33211.26      1
             33172.3     35392.00      1
             33392.28    34186.65      1
             34551.87    38078.67      1
             35071.4     37310.00      1
             35947.8     37837.80      1
             36650.6     38990.00      1
             36877.59    56950.65      1
             37449.66    40270.23      1
             39115.16    41048.00      1
             40767.16    42028.00      1
             41589.54    42603.96      1
             42970.33    62041.46      1
             46851.36    48190.38      1
             47355.01    48822.99      1
             48039.6     49020.00      1
             51092.15    54353.70      1
             51097.23    53783.73      1
             52734.5     55510.00      1
             58272.89    59401.79      1
             60269.58    64806.00      1
             61393       65315.25      1
             62718.3     65224.44      1
             71736.33    73572.06      1
             73056.16    78558.48      1
             75559.91    95699.58      1
             80861.06    84700.00      1
             83901.72    85614.00      1
             85321.4     89812.00      1
             92291.92    108377.56     1
             94696       99680.00      1
             94933.3     102078.90     1
             103893.96   108972.54     1
             113979.28   121261.14     1
             116915.94   123062.94     1
             120331.04   129388.32     1
             121375.01   129123.18     1
             139913.04   145827.00     1
             170224.09   181090.62     1
Switzerland  276         276.00        1
             306         306.00        1
             1218.59     2667.30       1
             1380        1380.00       1
             1656        1656.00       1
             1771.45     1826.34       1
             1993.86     2055.42       1
             1996.26     2058.00       1
             2024.1      2065.05       1
             2387.4      2435.70       1
             2567.04     2674.00       1
             3467.49     3467.49       1
             3678.12     5342.89       1
             5462.8      5691.00       1
             5482.44     5652.00       1
             5499.8      5669.93       1
             5676.44     5852.00       1
             5936        5936.00       1
             6448.4      6860.00       1
             8867.74     9142.00       1
             10785.46    10878.10      1
             16893.03    19679.82      1
             17698.12    18828.81      1
             20330.64    22150.75      1
             22090.95    22673.00      1
             23532       23532.00      1
             27166.07    28900.26      1
             31051.98    33943.77      1
             31990.4     32334.80      1
             33772.54    38993.64      1
             39184.12    49699.14      1
             43853.04    44748.00      1
             49413       50554.00      1
             52506.32    54124.00      1
             58653.83    64161.01      1
             59088.84    61434.59      1
             59828.4     73820.40      1
             61541.66    63444.81      1
             66458.58    68514.00      1
             72955.77    74715.90      1
             76657       81550.00      1
             78608.81    89833.53      1
             79296.34    96334.26      1
             92073.31    95151.00      1
             102619.27   125689.80     1
             104372.01   122536.18     1
             110890.82   136655.14     1
             116125.2    121464.00     1
             131533.33   167761.80     1
             143532.6    152702.55     1
             146949.04   149948.00     1
             160147.94   163103.22     1
             173232.5    182350.00     1
             242500.79   257981.22     1
             305128.35   321170.85     1
             499876.26   523916.64     1
United       Kingdom     276.00        1
                         1265.66       1
                         3963.36       1
                         4788.00       1
                         5416.07       1
                         5507.19       1
                         6328.32       1
                         6496.20       1
                         6791.94       1
                         7147.22       1
                         7294.55       1
                         7386.00       1
                         7426.32       1
                         9735.59       1
                         9816.71       1
                         9989.06       1
                         10122.00      1
                         10300.54      1
                         10691.20      1
                         11144.64      1
                         11350.08      1
                         11605.68      1
                         11616.40      1
                         11646.60      1
                         12598.14      1
                         12686.38      1
                         13160.00      1
                         13653.07      1
                         13768.72      1
                         14940.00      1
                         16002.28      1
                         17489.33      1
                         17552.34      1
                         18135.12      1
                         18728.73      1
                         18965.60      1
                         19204.06      1
                         19551.00      1
                         20436.00      1
                         21121.80      1
                         22710.10      1
                         23185.78      1
                         25981.41      1
                         27407.44      1
                         27503.14      1
                         33646.05      1
                         34185.67      1
                         34393.74      1
                         35891.72      1
                         37117.59      1
                         45528.00      1
                         46983.89      1
                         48736.28      1
                         52519.30      1
                         54714.00      1
                         55094.90      1
                         58347.94      1
                         59860.99      1
                         60811.20      1
                         60911.16      1
                         68429.36      1
                         72027.47      1
                         77304.99      1
                         77925.94      1
                         80828.86      1
                         81646.04      1
                         85136.82      1
                         86295.16      1
                         98462.00      1
                         100220.05     1
                         103573.68     1
                         108403.69     1
                         109547.29     1
                         121881.45     1
                         136434.24     1
                         138671.33     1
                         141447.12     1
                         142067.62     1
                         145225.02     1
                         155872.26     1
                         165649.60     1
                         170718.26     1
                         180361.15     1
                         187246.28     1
                         187709.59     1
                         188846.00     1
                         209545.28     1
                         209925.16     1
                         215708.85     1
                         220020.17     1
                         221738.42     1
                         250180.39     1
                         256390.32     1
                         260026.78     1
                         264295.12     1
                         282559.20     1
                         291755.41     1
                         296537.01     1
                         298252.50     1
                         307472.60     1
                         311640.91     1
                         379103.46     1
                         469754.46     1
                         508201.38     1
                         600175.72     1
                         850779.96     1
                         858296.52     1
                         1047762.92    1
                         1396477.08    1
             States      156.90        1
                         462.00        1
                         564.00        1
                         582.00        1
                         711.28        1
                         904.79        1
                         1134.00       1
                         1307.50       1
                         1406.87       1
                         1452.00       1
                         1590.00       1
                         1830.00       1
                         1950.79       1
                         2044.00       1
                         2970.00       1
                         3148.85       1
                         3773.00       1
                         4018.95       1
                         4068.96       1
                         4541.19       1
                         4795.98       1
                         5043.87       1
                         5434.85       1
                         5559.54       1
                         5691.70       1
                         5804.79       1
                         5934.00       1
                         6237.00       1
                         6305.89       1
                         6796.95       1
                         7065.73       1
                         7357.00       1
                         8547.84       1
                         9584.20       1
                         10341.36      1
                         10633.00      1
                         10864.70      1
                         11299.20      1
                         11839.50      1
                         12498.00      1
                         12794.13      1
                         14786.55      1
                         14847.97      1
                         15088.55      1
                         15987.52      1
                         16142.94      1
                         16272.90      1
                         16623.86      1
                         17010.00      1
                         17363.90      1
                         17755.85      1
                         17792.60      1
                         19333.44      1
                         19577.61      1
                         19870.80      1
                         20097.40      1
                         20595.40      1
                         22253.40      1
                         22703.10      1
                         22835.09      1
                         22862.04      1
                         23587.68      1
                         23876.00      1
                         24615.78      1
                         24780.00      1
                         24899.70      1
                         26377.52      1
                         27181.56      1
                         27594.80      1
                         28310.74      1
                         28850.82      1
                         30439.81      1
                         31832.60      1
                         33575.66      1
                         35162.28      1
                         36496.29      1
                         37278.24      1
                         38481.84      1
                         38558.80      1
                         40895.82      1
                         41286.66      1
                         44076.78      1
                         44738.52      1
                         45153.50      1
                         45830.40      1
                         46023.74      1
                         48553.82      1
                         49152.60      1
                         51624.30      1
                         58623.06      1
                         59057.10      1
                         61020.52      1
                         62457.27      1
                         63086.34      1
                         72739.98      1
                         78920.76      1
                         79199.61      1
                         81609.12      1
                         82744.36      1
                         84239.16      1
                         91913.20      1
                         92498.56      1
                         93004.75      1
                         96193.86      1
                         96973.80      1
                         98015.68      1
                         98451.87      1
                         101870.04     1
                         104613.94     1
                         105248.98     1
                         107315.04     1
                         110896.86     1
                         110958.89     1
                         116466.00     1
                         117535.84     1
                         119822.20     1
                         128958.36     1
                         135811.20     1
                         141614.79     1
                         141660.71     1
                         145400.64     1
                         156197.62     1
                         156644.47     1
                         157916.82     1
                         158594.80     1
                         158957.14     1
                         160030.42     1
                         160128.94     1
                         160562.08     1
                         160792.18     1
                         163315.74     1
                         164079.21     1
                         175914.12     1
                         176704.07     1
                         179142.18     1
                         179287.05     1
                         182296.99     1
                         209592.06     1
                         219475.12     1
                         221736.06     1
                         227664.68     1
                         235522.35     1
                         242340.18     1
                         254674.33     1
                         254963.72     1
                         264150.06     1
                         270907.14     1
                         273964.74     1
                         276214.63     1
                         278076.56     1
                         318884.78     1
                         330790.73     1
                         332805.55     1
                         340810.05     1
                         350516.60     1
                         355366.88     1
                         359326.53     1
                         360522.18     1
                         387249.98     1
                         435798.74     1
                         511467.20     1
                         530857.23     1
                         554191.64     1
                         559037.99     1
                         588644.62     1
                         605602.03     1
                         607726.80     1
                         645502.04     1
                         654247.90     1
                         694922.97     1
                         706057.05     1
                         735396.51     1
                         744918.18     1
                         762398.00     1
                         772032.70     1
                         786590.20     1
                         820211.00     1
                         905452.59     1
                         1053294.52    1
                         1414240.68    1
                         1620991.92    1
                         2199235.05    1
                         3477909.78    1
Name: Year, dtype: int64

In [386]:
temp2 = copy.deepcopy(temp1[temp1["Retailer"].isin(["Kingdom", "States"])])
temp2.head()

,Year,type.1,Retailer,country,Revenue,Planned,revenue,Product.3,cost,Quantity,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
147,2004,United,States,209592,235238,124284,18774,6.62,12.53,85308.18,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Telephone
162,2004,United,Kingdom,108404,123934,65478.4,9891,6.62,12.53,42925.27,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Telephone
189,2004,United,States,156644,176335,93163.3,14073,6.62,12.53,63481.21,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Web
204,2004,United,Kingdom,52519.3,57487.6,30372.6,4588,6.62,12.53,22146.74,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Web
210,2004,United,States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Special

In [387]:
temp2.groupby(["type.1", "Retailer", "country"])["Year"].count()

type.1  Retailer  country
United  Kingdom   276.00        1
                  1265.66       1
                  3963.36       1
                  4788.00       1
                  5416.07       1
                               ..
        States    1053294.52    1
                  1414240.68    1
                  1620991.92    1
                  2199235.05    1
                  3477909.78    1
Name: Year, Length: 292, dtype: int64

In [388]:
temp2.columns

Index(['Year', 'type.1', 'Retailer', 'country', 'Revenue', 'Planned',
       'revenue', 'Product.3', 'cost', 'Quantity', 'Unit', 'cost.1', 'Unit.1',
       'price', 'Gross', 'profit', 'Unit.2', 'sale', 'price.1', 'Product line',
       'Product type', 'Product', 'Order method type'],
      dtype='object')

In [389]:
temp2["Retailer country"] = temp2["type.1"] + " " + temp2["Retailer"]
temp2 = temp2.drop(["type.1", "Retailer"], axis=1)

temp2["Planned revenue"] = temp2["Revenue"]
temp2 = temp2.drop(["Revenue"], axis=1)

temp2["Revenue"] = temp2["country"]
temp2 = temp2.drop(["country"], axis=1)

temp2["Product cost"] = temp2["Planned"]
temp2 = temp2.drop(["Planned"], axis=1)

temp2["Gross profit"] = temp2["Quantity"]
temp2 = temp2.drop(["Quantity"], axis=1)

temp2["Quantity"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Unit cost"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Unit price"] = temp2["cost"]
temp2 = temp2.drop(["cost"], axis=1)

temp2["Unit sale price"] = temp2["Unit"]
temp2 = temp2.drop(['Unit', 'cost.1', 'Unit.1', 'price', 'Gross', 'profit', 'Unit.2', 'sale', 'price.1'], axis=1)

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Planned revenue,Revenue,Product cost,Gross profit,Quantity,Unit cost,Unit price,Unit sale price
147,2004,Camping Equipment,Cooking Gear,TrailChef Order,Telephone,United States,235238,209592,124284,85308.18,18774,6.62,12.53,11.427000
162,2004,Camping Equipment,Cooking Gear,TrailChef Order,Telephone,United Kingdom,123934,108404,65478.4,42925.27,9891,6.62,12.53,11.316667
189,2004,Camping Equipment,Cooking Gear,TrailChef Order,Web,United States,176335,156644,93163.3,63481.21,14073,6.62,12.53,11.500000
204,2004,Camping Equipment,Cooking Gear,TrailChef Order,Web,United Kingdom,57487.6,52519.3,30372.6,22146.74,4588,6.62,12.53,11.652500
210,2004,Camping Equipment,Cooking Gear,TrailChef Order,Special,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [390]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
147,2004,Camping Equipment,Cooking Gear,TrailChef Order,Telephone,United States,209592,235238,124284,18774,6.62,12.53,85308.18,11.427000
162,2004,Camping Equipment,Cooking Gear,TrailChef Order,Telephone,United Kingdom,108404,123934,65478.4,9891,6.62,12.53,42925.27,11.316667
189,2004,Camping Equipment,Cooking Gear,TrailChef Order,Web,United States,156644,176335,93163.3,14073,6.62,12.53,63481.21,11.500000
204,2004,Camping Equipment,Cooking Gear,TrailChef Order,Web,United Kingdom,52519.3,57487.6,30372.6,4588,6.62,12.53,22146.74,11.652500
210,2004,Camping Equipment,Cooking Gear,TrailChef Order,Special,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [391]:
str19 = temp2

In [398]:
temp2 = copy.deepcopy(temp1[~temp1["Retailer"].isin(["Kingdom", "States"])])
temp2.head()

,Year,type.1,Retailer,country,Revenue,Planned,revenue,Product.3,cost,Quantity,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
148,2004,Canada,8489.36,12129,6408.16,968,6.62,12.53,2081.20,8.770000,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Telephone
149,2004,Mexico,11962.3,17090.9,9029.68,1364,6.62,12.53,2932.60,8.770000,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Telephone
150,2004,Brazil,7919.31,11314.6,5977.86,903,6.62,12.53,1941.45,8.770000,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Telephone
151,2004,Japan,107959,124486,65769.7,9935,6.62,12.53,42189.47,11.286923,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Telephone
152,2004,Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Cooking Gear,TrailChef Order,Telephone

In [399]:
temp2["Retailer country"] = temp2["type.1"]
temp2 = temp2.drop(["type.1"], axis=1)

temp2["Product cost"] = temp2["Revenue"]
temp2 = temp2.drop(["Revenue"], axis=1)

temp2["Revenue"] = temp2["Retailer"]
temp2 = temp2.drop(["Retailer"], axis=1)

temp2["Planned revenue"] = temp2["country"]
temp2 = temp2.drop(["country"], axis=1)

temp2["Unit sale price"] = temp2["Quantity"]
temp2 = temp2.drop(["Quantity"], axis=1)

temp2["Quantity"] = temp2["Planned"]
temp2 = temp2.drop(["Planned"], axis=1)

temp2["Unit cost"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Unit price"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Gross profit"] = temp2["cost"]
temp2 = temp2.drop(['cost', 'Unit', 'cost.1', 'Unit.1', 'price', 'Gross', 'profit', 'Unit.2', 'sale', 'price.1'], axis=1)

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Product cost,Revenue,Planned revenue,Unit sale price,Quantity,Unit cost,Unit price,Gross profit
148,2004,Camping Equipment,Cooking Gear,TrailChef Order,Telephone,Canada,6408.16,8489.36,12129,8.770000,968,6.62,12.53,2081.20
149,2004,Camping Equipment,Cooking Gear,TrailChef Order,Telephone,Mexico,9029.68,11962.3,17090.9,8.770000,1364,6.62,12.53,2932.60
150,2004,Camping Equipment,Cooking Gear,TrailChef Order,Telephone,Brazil,5977.86,7919.31,11314.6,8.770000,903,6.62,12.53,1941.45
151,2004,Camping Equipment,Cooking Gear,TrailChef Order,Telephone,Japan,65769.7,107959,124486,11.286923,9935,6.62,12.53,42189.47
152,2004,Camping Equipment,Cooking Gear,TrailChef Order,Telephone,Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [400]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
148,2004,Camping Equipment,Cooking Gear,TrailChef Order,Telephone,Canada,8489.36,12129,6408.16,968,6.62,12.53,2081.20,8.770000
149,2004,Camping Equipment,Cooking Gear,TrailChef Order,Telephone,Mexico,11962.3,17090.9,9029.68,1364,6.62,12.53,2932.60,8.770000
150,2004,Camping Equipment,Cooking Gear,TrailChef Order,Telephone,Brazil,7919.31,11314.6,5977.86,903,6.62,12.53,1941.45,8.770000
151,2004,Camping Equipment,Cooking Gear,TrailChef Order,Telephone,Japan,107959,124486,65769.7,9935,6.62,12.53,42189.47,11.286923
152,2004,Camping Equipment,Cooking Gear,TrailChef Order,Telephone,Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [401]:
str20 = temp2

In [403]:
temp = copy.deepcopy(tmp1[~tmp1.index.isin(tmp2.index.values)])
temp.head()

,Year,Product.2,Order,method,type.1,Retailer,country,Revenue,Planned,revenue,...,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type
2499,2004,Hibernator,Telephone,United,States,968871,1130591,662200,7700,86,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags
2500,2004,Hibernator,Telephone,Canada,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags
2501,2004,Hibernator,Telephone,Mexico,26627.2,28631.8,16770,195,86,146.83,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags
2502,2004,Hibernator,Telephone,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags
2503,2004,Hibernator,Telephone,Japan,624589,720054,421744,4904,86,146.83,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags

In [404]:
temp.groupby(["Product.2", "Order"])["Year"].count()

Product.2   Order
Hibernator  E-mail       63
            Fax          63
            Mail         63
            Sales        63
            Special      63
            Telephone    63
            Web          63
Name: Year, dtype: int64

In [405]:
temp["Product"] = temp["Product.2"]
temp = temp.drop(["Product.2"], axis=1)
temp.head()

,Year,Order,method,type.1,Retailer,country,Revenue,Planned,revenue,Product.3,...,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
2499,2004,Telephone,United,States,968871,1130591,662200,7700,86,146.83,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator
2500,2004,Telephone,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator
2501,2004,Telephone,Mexico,26627.2,28631.8,16770,195,86,146.83,9857.25,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator
2502,2004,Telephone,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator
2503,2004,Telephone,Japan,624589,720054,421744,4904,86,146.83,202845,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator

In [407]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp.groupby(["Order", "method"])["Year"].count())

Order      method
E-mail     Australia       3
           Austria         3
           Belgium         3
           Brazil          3
           Canada          3
           China           3
           Denmark         3
           Finland         3
           France          3
           Germany         3
           Italy           3
           Japan           3
           Korea           3
           Mexico          3
           Netherlands     3
           Singapore       3
           Spain           3
           Sweden          3
           Switzerland     3
           United          6
Fax        Australia       3
           Austria         3
           Belgium         3
           Brazil          3
           Canada          3
           China           3
           Denmark         3
           Finland         3
           France          3
           Germany         3
           Italy           3
           Japan           3
           Korea           3
           Mexico          3
           Netherlands     3
           Singapore       3
           Spain           3
           Sweden          3
           Switzerland     3
           United          6
Mail       Australia       3
           Austria         3
           Belgium         3
           Brazil          3
           Canada          3
           China           3
           Denmark         3
           Finland         3
           France          3
           Germany         3
           Italy           3
           Japan           3
           Korea           3
           Mexico          3
           Netherlands     3
           Singapore       3
           Spain           3
           Sweden          3
           Switzerland     3
           United          6
Sales      visit          63
Special    Australia       3
           Austria         3
           Belgium         3
           Brazil          3
           Canada          3
           China           3
           Denmark         3
           Finland         3
           France          3
           Germany         3
           Italy           3
           Japan           3
           Korea           3
           Mexico          3
           Netherlands     3
           Singapore       3
           Spain           3
           Sweden          3
           Switzerland     3
           United          6
Telephone  Australia       3
           Austria         3
           Belgium         3
           Brazil          3
           Canada          3
           China           3
           Denmark         3
           Finland         3
           France          3
           Germany         3
           Italy           3
           Japan           3
           Korea           3
           Mexico          3
           Netherlands     3
           Singapore       3
           Spain           3
           Sweden          3
           Switzerland     3
           United          6
Web        Australia       3
           Austria         3
           Belgium         3
           Brazil          3
           Canada          3
           China           3
           Denmark         3
           Finland         3
           France          3
           Germany         3
           Italy           3
           Japan           3
           Korea           3
           Mexico          3
           Netherlands     3
           Singapore       3
           Spain           3
           Sweden          3
           Switzerland     3
           United          6
Name: Year, dtype: int64

In [410]:
temp1 = copy.deepcopy(temp[temp["method"] == "visit"])
temp1.head()

,Year,Order,method,type.1,Retailer,country,Revenue,Planned,revenue,Product.3,...,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
2520,2004,Sales,visit,United,States,765609,850733,498284,5794,86,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator
2521,2004,Sales,visit,Canada,37551.2,40378.2,23650,275,86,146.83,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator
2522,2004,Sales,visit,Mexico,385230,439315,257312,2992,86,146.83,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator
2523,2004,Sales,visit,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator
2524,2004,Sales,visit,Japan,46700.1,50215.9,29412,342,86,146.83,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator

In [411]:
temp1["Order method type"] = temp1["Order"] + " " + temp1["method"]
temp1 = temp1.drop(["Order", "method"], axis=1)
temp1.head()

,Year,type.1,Retailer,country,Revenue,Planned,revenue,Product.3,cost,Quantity,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
2520,2004,United,States,765609,850733,498284,5794,86,146.83,267325.1900,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Sales visit
2521,2004,Canada,37551.2,40378.2,23650,275,86,146.83,13901.25,136.5500,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Sales visit
2522,2004,Mexico,385230,439315,257312,2992,86,146.83,127917.62,131.7775,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Sales visit
2523,2004,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Sales visit
2524,2004,Japan,46700.1,50215.9,29412,342,86,146.83,17288.10,136.5500,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Sales visit

In [412]:
temp1.groupby(["type.1", "Retailer", "country"])["Year"].count()

type.1       Retailer   country
Australia    67234.18   70772.06     1
             86374.11   91034.60     1
Austria      17032.28   17032.28     1
             212119.98  222006.96    1
Belgium      43149.8    46398.28     1
             45194.76   47572.92     1
             55760.08   59319.32     1
Canada       37551.25   40378.25     1
             38231.54   40671.91     1
China        83502.1    88832.15     1
             164040.24  172672.08    1
Finland      86685.48   108360.54    1
France       60120.19   63283.73     1
             148976.05  160191.53    1
             158584.98  168707.67    1
Germany      32158.66   34211.39     1
             339277.39  385428.75    1
Italy        48859.08   51977.82     1
             296947.8   344756.84    1
Japan        46700.1    50215.86     1
             53564.16   56382.72     1
Korea        63765.24   67835.46     1
             590417.14  673949.70    1
Mexico       92760.85   97641.95     1
             385229.62  439315.36    1
             409505.34  435644.61    1
Netherlands  53413.74   56823.21     1
             218639.22  228467.48    1
Singapore    450425.76  521099.67    1
Switzerland  41289.04   43461.68     1
             132085.14  140516.31    1
United       Kingdom    22318.40     1
                        60452.76     1
             States     234081.92    1
                        589828.88    1
                        765609.19    1
Name: Year, dtype: int64

In [413]:
temp2 = copy.deepcopy(temp1[temp1["Retailer"].isin(["Kingdom", "States"])])
temp2.head()

,Year,type.1,Retailer,country,Revenue,Planned,revenue,Product.3,cost,Quantity,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
2520,2004,United,States,765609,850733,498284,5794,86,146.83,267325.19,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Sales visit
2535,2004,United,Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Sales visit
23688,2005,United,States,234082,249024,145856,1696,86,146.83,88225.92,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Sales visit
23703,2005,United,Kingdom,60452.8,64311.5,37668,438,86,146.83,22784.76,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Sales visit
44856,2006,United,States,589829,616392,361028,4198,86,146.83,228800.88,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Sales visit

In [414]:
temp2["Retailer country"] = temp2["type.1"] + " " + temp2["Retailer"]
temp2 = temp2.drop(["type.1", "Retailer"], axis=1)

temp2["Planned revenue"] = temp2["Revenue"]
temp2 = temp2.drop(["Revenue"], axis=1)

temp2["Revenue"] = temp2["country"]
temp2 = temp2.drop(["country"], axis=1)

temp2["Product cost"] = temp2["Planned"]
temp2 = temp2.drop(["Planned"], axis=1)

temp2["Gross profit"] = temp2["Quantity"]
temp2 = temp2.drop(["Quantity"], axis=1)

temp2["Quantity"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Unit cost"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Unit price"] = temp2["cost"]
temp2 = temp2.drop(["cost"], axis=1)

temp2["Unit sale price"] = temp2["Unit"]
temp2 = temp2.drop(['Unit', 'cost.1', 'Unit.1', 'price', 'Gross', 'profit', 'Unit.2', 'sale', 'price.1'], axis=1)

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Planned revenue,Revenue,Product cost,Gross profit,Quantity,Unit cost,Unit price,Unit sale price
2520,2004,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,United States,850733,765609,498284,267325.19,5794,86,146.83,134.004667
2535,2004,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,United Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23688,2005,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,United States,249024,234082,145856,88225.92,1696,86,146.83,138.020000
23703,2005,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,United Kingdom,64311.5,60452.8,37668,22784.76,438,86,146.83,138.020000
44856,2006,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,United States,616392,589829,361028,228800.88,4198,86,146.83,140.305556

In [415]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
2520,2004,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,United States,765609,850733,498284,5794,86,146.83,267325.19,134.004667
2535,2004,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,United Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23688,2005,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,United States,234082,249024,145856,1696,86,146.83,88225.92,138.020000
23703,2005,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,United Kingdom,60452.8,64311.5,37668,438,86,146.83,22784.76,138.020000
44856,2006,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,United States,589829,616392,361028,4198,86,146.83,228800.88,140.305556

In [416]:
str21 = temp2

In [417]:
temp2 = copy.deepcopy(temp1[~temp1["Retailer"].isin(["Kingdom", "States"])])
temp2.head()

,Year,type.1,Retailer,country,Revenue,Planned,revenue,Product.3,cost,Quantity,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
2521,2004,Canada,37551.2,40378.2,23650,275,86,146.83,13901.25,136.5500,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Sales visit
2522,2004,Mexico,385230,439315,257312,2992,86,146.83,127917.62,131.7775,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Sales visit
2523,2004,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Sales visit
2524,2004,Japan,46700.1,50215.9,29412,342,86,146.83,17288.10,136.5500,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Sales visit
2525,2004,Korea,590417,673950,394740,4590,86,146.83,195677.14,131.7775,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Sales visit

In [418]:
temp2["Retailer country"] = temp2["type.1"]
temp2 = temp2.drop(["type.1"], axis=1)

temp2["Product cost"] = temp2["Revenue"]
temp2 = temp2.drop(["Revenue"], axis=1)

temp2["Revenue"] = temp2["Retailer"]
temp2 = temp2.drop(["Retailer"], axis=1)

temp2["Planned revenue"] = temp2["country"]
temp2 = temp2.drop(["country"], axis=1)

temp2["Unit sale price"] = temp2["Quantity"]
temp2 = temp2.drop(["Quantity"], axis=1)

temp2["Quantity"] = temp2["Planned"]
temp2 = temp2.drop(["Planned"], axis=1)

temp2["Unit cost"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Unit price"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Gross profit"] = temp2["cost"]
temp2 = temp2.drop(['cost', 'Unit', 'cost.1', 'Unit.1', 'price', 'Gross', 'profit', 'Unit.2', 'sale', 'price.1'], axis=1)

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Product cost,Revenue,Planned revenue,Unit sale price,Quantity,Unit cost,Unit price,Gross profit
2521,2004,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,Canada,23650,37551.2,40378.2,136.5500,275,86,146.83,13901.25
2522,2004,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,Mexico,257312,385230,439315,131.7775,2992,86,146.83,127917.62
2523,2004,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2524,2004,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,Japan,29412,46700.1,50215.9,136.5500,342,86,146.83,17288.10
2525,2004,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,Korea,394740,590417,673950,131.7775,4590,86,146.83,195677.14

In [419]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
2521,2004,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,Canada,37551.2,40378.2,23650,275,86,146.83,13901.25,136.5500
2522,2004,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,Mexico,385230,439315,257312,2992,86,146.83,127917.62,131.7775
2523,2004,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2524,2004,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,Japan,46700.1,50215.9,29412,342,86,146.83,17288.10,136.5500
2525,2004,Camping Equipment,Sleeping Bags,Hibernator,Sales visit,Korea,590417,673950,394740,4590,86,146.83,195677.14,131.7775

In [420]:
str22 = temp2

In [421]:
temp1 = copy.deepcopy(temp[temp["method"] != "visit"])
temp1.head()

,Year,Order,method,type.1,Retailer,country,Revenue,Planned,revenue,Product.3,...,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product
2499,2004,Telephone,United,States,968871,1130591,662200,7700,86,146.83,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator
2500,2004,Telephone,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator
2501,2004,Telephone,Mexico,26627.2,28631.8,16770,195,86,146.83,9857.25,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator
2502,2004,Telephone,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator
2503,2004,Telephone,Japan,624589,720054,421744,4904,86,146.83,202845,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator

In [423]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp1.groupby(["Order", "method"])["Year"].count())

Order      method
E-mail     Australia      3
           Austria        3
           Belgium        3
           Brazil         3
           Canada         3
           China          3
           Denmark        3
           Finland        3
           France         3
           Germany        3
           Italy          3
           Japan          3
           Korea          3
           Mexico         3
           Netherlands    3
           Singapore      3
           Spain          3
           Sweden         3
           Switzerland    3
           United         6
Fax        Australia      3
           Austria        3
           Belgium        3
           Brazil         3
           Canada         3
           China          3
           Denmark        3
           Finland        3
           France         3
           Germany        3
           Italy          3
           Japan          3
           Korea          3
           Mexico         3
           Netherlands    3
           Singapore      3
           Spain          3
           Sweden         3
           Switzerland    3
           United         6
Mail       Australia      3
           Austria        3
           Belgium        3
           Brazil         3
           Canada         3
           China          3
           Denmark        3
           Finland        3
           France         3
           Germany        3
           Italy          3
           Japan          3
           Korea          3
           Mexico         3
           Netherlands    3
           Singapore      3
           Spain          3
           Sweden         3
           Switzerland    3
           United         6
Special    Australia      3
           Austria        3
           Belgium        3
           Brazil         3
           Canada         3
           China          3
           Denmark        3
           Finland        3
           France         3
           Germany        3
           Italy          3
           Japan          3
           Korea          3
           Mexico         3
           Netherlands    3
           Singapore      3
           Spain          3
           Sweden         3
           Switzerland    3
           United         6
Telephone  Australia      3
           Austria        3
           Belgium        3
           Brazil         3
           Canada         3
           China          3
           Denmark        3
           Finland        3
           France         3
           Germany        3
           Italy          3
           Japan          3
           Korea          3
           Mexico         3
           Netherlands    3
           Singapore      3
           Spain          3
           Sweden         3
           Switzerland    3
           United         6
Web        Australia      3
           Austria        3
           Belgium        3
           Brazil         3
           Canada         3
           China          3
           Denmark        3
           Finland        3
           France         3
           Germany        3
           Italy          3
           Japan          3
           Korea          3
           Mexico         3
           Netherlands    3
           Singapore      3
           Spain          3
           Sweden         3
           Switzerland    3
           United         6
Name: Year, dtype: int64

In [424]:
temp1["Order method type"] = temp1["Order"]
temp1 = temp1.drop(["Order"], axis=1)
temp1.head()

,Year,method,type.1,Retailer,country,Revenue,Planned,revenue,Product.3,cost,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
2499,2004,United,States,968871,1130591,662200,7700,86,146.83,306670.750,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Telephone
2500,2004,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Telephone
2501,2004,Mexico,26627.2,28631.8,16770,195,86,146.83,9857.25,136.550,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Telephone
2502,2004,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Telephone
2503,2004,Japan,624589,720054,421744,4904,86,146.83,202845,130.823,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Telephone

In [426]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(temp1.groupby(["method", "type.1", "Retailer"])["Year"].count())

method       type.1      Retailer
Australia    32572.72    34651.88      1
             146853.28   156227.12     1
             169729.38   179719.92     1
             184545.27   194256.09     1
             562833.34   585264.38     1
Austria      32536.42    40671.91      1
             118327.56   136698.73     1
             139309.19   147123.66     1
             164542.75   176930.15     1
             326555.32   347399.78     1
             426845.6    443720.26     1
Belgium      20790.42    25988.91      1
             129202.14   144040.23     1
             381275.89   403635.67     1
             525479.8    547969.56     1
Brazil       139144.45   149619.77     1
             282650.9    318914.76     1
             508744.7    539306.59     1
             673867.44   702434.72     1
Canada       42193.95    45370.47      1
             45408.58    48307.07      1
             91093.2     96907.80      1
             123577.75   132881.15     1
             129725.7    136551.90     1
             158879.11   167239.37     1
             365861.28   408040.57     1
             441470.89   484539.00     1
             899720.14   954395.00     1
             1191419.47  1247614.51    1
China        257942.95   277361.87     1
             920887.04   1043667.64    1
             1072019.1   1134261.75    1
             1432089.63  1493701.59    1
Denmark      91215.4     98082.44      1
             173215.1    184271.65     1
             184184.19   208498.60     1
             412053.25   432708.01     1
Finland      224215.1    241094.86     1
             502536.62   563093.05     1
             717789.25   759698.42     1
             926902.15   968050.19     1
France       51750.79    54473.93      1
             74692.85    80316.01      1
             125598.2    133615.30     1
             207034.54   237277.28     1
             262599.18   305112.74     1
             279980.96   295715.62     1
             355210.67   375737.97     1
             360459.91   398496.62     1
             1035189.95  1079640.99    1
Germany      28984.2     30834.30      1
             41149.55    43314.85      1
             42467.05    45664.13      1
             51192.83    53886.61      1
             276051.82   290429.74     1
             296313.5    318621.10     1
             378028.86   434323.14     1
             555145.83   589522.45     1
             1038860.79  1083752.23    1
Italy        40828.45    43902.17      1
             43013.25    46251.45      1
             79369.81    83546.27      1
             91644.93    96467.31      1
             177788.1    191172.66     1
             255431.01   270020.37     1
             361016.31   382345.32     1
             951628.31   992717.63     1
Japan        20012.9     21290.35      1
             43013.25    46251.45      1
             51615.9     55501.74      1
             66118.26    69597.42      1
             85480.3     91915.58      1
             86365.64    87510.68      1
             197724.4    212609.84     1
             256066.54   287639.97     1
             305394.27   322291.85     1
             624588.8    720054.32     1
             965447.04   1023698.76    1
             1388121.52  1450386.74    1
Korea        75375.6     81050.16      1
             89851.02    95586.33      1
             99595.86    104836.62     1
             191443.1    205855.66     1
             745736.83   789504.91     1
             927055.99   966581.89     1
Mexico       26627.25    28631.85      1
             41647.75    44783.15      1
             60728.8     64605.20      1
             63903.26    67982.29      1
             79881.75    85895.55      1
             234930.68   246233.91     1
             1064350.49  1109300.65    1
Netherlands  53664.15    57704.19      1
             59126.15    63577.39      1
             126270.71   133027.98     1
             135811.68   144480.72     1
             302185.15   324934.79     1
             324191.39   343582.20     1
             328036.96   379849.21     1
             601949.38   626964.10     1
Singapore    54756.55    58878.83      1
             63351.18    67394.97      1
             143126.74   152262.71     1
             279654.4    300707.84     1
             642571.3    679088.75     1
             983931.45   1027663.17    1
Spain        31882.62    33917.73      1
             43149.8     46398.28      1
             74348.17    78260.39      1
             177631.74   188970.21     1
             386279.86   408481.06     1
             427051.63   475582.37     1
             970077.39   1010630.89    1
Sweden       60398.96    62549.58      1
             110791.93   115848.87     1
             141738.9    152409.54     1
             150855.86   160485.19     1
             152792.06   156520.78     1
             182464.3    211288.37     1
Switzerland  31606.58    33624.07      1
             141467.59   149326.11     1
             486723.69   507591.31     1
United       Kingdom     102410.84     1
                         478973.63     1
                         558874.97     1
                         881416.39     1
                         1175927.72    1
             States      70860.92      1
                         72598.52      1
                         176422.60     1
                         184118.68     1
                         739517.13     1
                         833381.07     1
                         968870.75     1
                         1643903.58    1
                         2858284.19    1
Name: Year, dtype: int64

In [427]:
temp2 = copy.deepcopy(temp1[temp1["type.1"].isin(["Kingdom", "States"])])
temp2.head()

,Year,method,type.1,Retailer,country,Revenue,Planned,revenue,Product.3,cost,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
2499,2004,United,States,968871,1130591,662200,7700,86,146.83,306670.75,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Telephone
2514,2004,United,Kingdom,558875,632397,370402,4307,86,146.83,188472.97,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Telephone
2541,2004,United,States,833381,906528,530964,6174,86,146.83,302417.07,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Web
2556,2004,United,Kingdom,478974,525358,307708,3578,86,146.83,171265.63,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Web
2562,2004,United,States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Special

In [429]:
temp2["Retailer country"] = temp2["method"] + " " + temp2["type.1"]
temp2 = temp2.drop(["method", "type.1"], axis=1)

temp2["Product cost"] = temp2["Revenue"]
temp2 = temp2.drop(["Revenue"], axis=1)

temp2["Revenue"] = temp2["Retailer"]
temp2 = temp2.drop(["Retailer"], axis=1)

temp2["Planned revenue"] = temp2["country"]
temp2 = temp2.drop(["country"], axis=1)

temp2["Unit sale price"] = temp2["Quantity"]
temp2 = temp2.drop(["Quantity"], axis=1)

temp2["Quantity"] = temp2["Planned"]
temp2 = temp2.drop(["Planned"], axis=1)

temp2["Unit cost"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Unit price"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Gross profit"] = temp2["cost"]
temp2 = temp2.drop(['cost', 'Unit', 'cost.1', 'Unit.1', 'price', 'Gross', 'profit', 'Unit.2', 'sale', 'price.1'], axis=1)

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Product cost,Revenue,Planned revenue,Unit sale price,Quantity,Unit cost,Unit price,Gross profit
2499,2004,Camping Equipment,Sleeping Bags,Hibernator,Telephone,United States,662200,968871,1130591,129.732143,7700,86,146.83,306670.75
2514,2004,Camping Equipment,Sleeping Bags,Hibernator,Telephone,United Kingdom,370402,558875,632397,131.777500,4307,86,146.83,188472.97
2541,2004,Camping Equipment,Sleeping Bags,Hibernator,Web,United States,530964,833381,906528,135.356875,6174,86,146.83,302417.07
2556,2004,Camping Equipment,Sleeping Bags,Hibernator,Web,United Kingdom,307708,478974,525358,134.959167,3578,86,146.83,171265.63
2562,2004,Camping Equipment,Sleeping Bags,Hibernator,Special,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [430]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
2499,2004,Camping Equipment,Sleeping Bags,Hibernator,Telephone,United States,968871,1130591,662200,7700,86,146.83,306670.75,129.732143
2514,2004,Camping Equipment,Sleeping Bags,Hibernator,Telephone,United Kingdom,558875,632397,370402,4307,86,146.83,188472.97,131.777500
2541,2004,Camping Equipment,Sleeping Bags,Hibernator,Web,United States,833381,906528,530964,6174,86,146.83,302417.07,135.356875
2556,2004,Camping Equipment,Sleeping Bags,Hibernator,Web,United Kingdom,478974,525358,307708,3578,86,146.83,171265.63,134.959167
2562,2004,Camping Equipment,Sleeping Bags,Hibernator,Special,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [431]:
str23 = temp2

In [432]:
temp2 = copy.deepcopy(temp1[~temp1["type.1"].isin(["Kingdom", "States"])])
temp2.head()

,Year,method,type.1,Retailer,country,Revenue,Planned,revenue,Product.3,cost,...,price,Gross,profit,Unit.2,sale,price.1,Product line,Product type,Product,Order method type
2500,2004,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Telephone
2501,2004,Mexico,26627.2,28631.8,16770,195,86,146.83,9857.25,136.550,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Telephone
2502,2004,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Telephone
2503,2004,Japan,624589,720054,421744,4904,86,146.83,202845,130.823,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Telephone
2504,2004,Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment,Sleeping Bags,Hibernator,Telephone

In [434]:
temp2["Retailer country"] = temp2["method"]
temp2 = temp2.drop(["method"], axis=1)

temp2["Quantity"] = temp2["Revenue"]
temp2 = temp2.drop(["Revenue"], axis=1)

temp2["Revenue"] = temp2["type.1"]
temp2 = temp2.drop(["type.1"], axis=1)

temp2["Planned revenue"] = temp2["Retailer"]
temp2 = temp2.drop(["Retailer"], axis=1)

temp2["Product cost"] = temp2["country"]
temp2 = temp2.drop(["country"], axis=1)

temp2["Unit cost"] = temp2["Planned"]
temp2 = temp2.drop(["Planned"], axis=1)

temp2["Unit price"] = temp2["revenue"]
temp2 = temp2.drop(["revenue"], axis=1)

temp2["Gross profit"] = temp2["Product.3"]
temp2 = temp2.drop(["Product.3"], axis=1)

temp2["Unit sale price"] = temp2["cost"]
temp2 = temp2.drop(['cost', 'Unit', 'cost.1', 'Unit.1', 'price', 'Gross', 'profit', 'Unit.2', 'sale', 'price.1'], axis=1)

temp2.head()

,Year,Quantity,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Unit cost,Unit price,Gross profit,Unit sale price
2500,2004,NaN,Camping Equipment,Sleeping Bags,Hibernator,Telephone,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2501,2004,195,Camping Equipment,Sleeping Bags,Hibernator,Telephone,Mexico,26627.2,28631.8,16770,86,146.83,9857.25,136.550
2502,2004,NaN,Camping Equipment,Sleeping Bags,Hibernator,Telephone,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2503,2004,4904,Camping Equipment,Sleeping Bags,Hibernator,Telephone,Japan,624589,720054,421744,86,146.83,202845,130.823
2504,2004,NaN,Camping Equipment,Sleeping Bags,Hibernator,Telephone,Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [435]:
temp2 = temp2[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country', 'Revenue', 'Planned revenue', 'Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]

temp2.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
2500,2004,Camping Equipment,Sleeping Bags,Hibernator,Telephone,Canada,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2501,2004,Camping Equipment,Sleeping Bags,Hibernator,Telephone,Mexico,26627.2,28631.8,16770,195,86,146.83,9857.25,136.550
2502,2004,Camping Equipment,Sleeping Bags,Hibernator,Telephone,Brazil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2503,2004,Camping Equipment,Sleeping Bags,Hibernator,Telephone,Japan,624589,720054,421744,4904,86,146.83,202845,130.823
2504,2004,Camping Equipment,Sleeping Bags,Hibernator,Telephone,Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [436]:
str24 = temp2

In [437]:
tmp

,Year,Product.1,type,Product.2,Order,method,type.1,Retailer,country,Revenue,...,Unit,cost.1,Unit.1,price,Gross,profit,Unit.2,sale,price.1,Product line
0,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,United,States,315044,...,156672.570,5.195714,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
1,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,Canada,13444.7,14313.5,...,6.190,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
2,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,Mexico,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
3,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,Brazil,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
4,2004,Cooking,Gear,TrailChef,Water,Bag,Telephone,Japan,181120,235237,...,5.488,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
65530,2007,Tents,Star,Gazer,3,E-mail,Sweden,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
65531,2007,Tents,Star,Gazer,3,E-mail,Finland,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
65532,2007,Tents,Star,Gazer,3,E-mail,Denmark,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
65533,2007,Tents,Star,Gazer,3,E-mail,France,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment
65534,2007,Tents,Star,Gazer,3,E-mail,Germany,59383,62508.6,38136,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Camping Equipment

In [438]:
df = pd.concat(
    [str1, str2, str3, str4, str5, str6, str7, str8, str9, str10, str11, str12, str13, str14, str15, str16, str17,      str18, str19, str20, str21, str22, str23, str24],
    sort = True)[['Year', 'Product line', 'Product type', 'Product', 'Order method type', 'Retailer country',                       'Revenue', 'Planned revenue','Product cost', 'Quantity', 'Unit cost', 'Unit price', 'Gross profit', 'Unit sale price']]
df.head()

,Year,Product line,Product type,Product,Order method type,Retailer country,Revenue,Planned revenue,Product cost,Quantity,Unit cost,Unit price,Gross profit,Unit sale price
17514,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,United States,5819.7,6586.16,1733.2,619,2.8,10.64,4086.5,5.105
17529,2004,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,United Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
38682,2005,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,United States,10904.3,11363.5,2990.4,1068,2.8,10.64,7913.88,10.210
38697,2005,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,United Kingdom,27987.8,28855.7,7593.6,2712,2.8,10.64,20394.2,10.320
59850,2006,Golf Equipment,Golf Accessories,Course Pro Golf and Tee Set,Sales visit,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [440]:
df.to_csv("sales.csv", index=False)